[
  {
    "id": 10801,
    "en": "What (How) is the student's name? Her name is Anna",
    "de": "Wie heißt die Studentin? Sie heißt Anna",
    "groupCode": 1
  },
  {
    "id": 10802,
    "en": "\n Where (to) are you going? (to Egypt) \n Where do you work? (in Egypt) \n Where are you from? (from Egypt)",
    "de": "\n Wohin gehst du? (nach Ägypten) \n Wo arbeitest du? (in Ägypten) \n Woher kommst du? (aus Ägypten)",
    "groupCode": 1
  },
  {
    "id": 10803,
    "en": "Aren't you studying? Yes (But), I am studying",
    "de": "Studierst du nicht? Doch, ich studiere",
    "groupCode": 1
  },
  {
    "id": 10804,
    "en": "Where (to) are you driving? I'm driving to Munich",
    "de": "Wohin fährst du? Ich fahre nach München",
    "groupCode": 1
  },
  {
    "id": 10805,
    "en": "Where (to) would you like to drive? To (toward) the train station",
    "de": "Wohin möchtest du fahren? Zum Bahnhof",
    "desc": "\"Wohin\" means \"where to\" and is used when asking about a destination or direction. For example, \"Wohin möchtest du gehen?\" means \"Where would you like to go?\" because you're asking about the destination or direction of the person's intended movement.\n\n\"Woher\" means \"where from\" and is used when asking about the origin or source of something. For example, \"Woher kommst du?\" means \"Where are you from?\" because you're asking about the place the person is coming from.",
    "groupCode": 1
  },
  {
    "id": 10806,
    "en": "\n I must go to (toward) school tomorrow. \n Must I go to (toward) school tomorrow? \n Where (to) must I go tomorrow?",
    "de": "\n Ich muss morgen zur Schule gehen. \n Muss ich morgen zur Schule gehen? \n Wohin muss ich morgen gehen?",
    "groupCode": 1
  },
  {
    "id": 10807,
    "en": "That looks beautiful",
    "de": "Das sieht schön aus",
    "groupCode": 1
  },
  {
    "id": 10808,
    "en": "I don't know, where he lives",
    "de": "Ich weiß nicht, wo er wohnt",
    "desc": "No, \"Ich weiß nicht, wo er wohnt\" is correct because in subordinate clauses, the verb goes to the end of the clause in German",
    "groupCode": 1
  },
  {
    "id": 10809,
    "en": "I've lost my identification",
    "de": "Ich habe meinen Ausweis verloren",
    "groupCode": 1
  },
  {
    "id": 10810,
    "en": "Do you like doing outdoor activities?",
    "de": "Machst du gern Aktivitäten draußen?",
    "groupCode": 1
  },
  {
    "id": 10811,
    "en": "When does this train arrive in Hamburg?",
    "de": "Wann kommt dieser Zug in Hamburg an?",
    "groupCode": 1
  },
  {
    "id": 10812,
    "en": "We all hope for better weather",
    "de": "Wir alle hoffen auf besseres Wetter",
    "desc": "\"hoffen auf\" → The verb \"hoffen\" (to hope) is always used with \"auf\" + Akkusativ (accusative case).",
    "groupCode": 1
  },
  {
    "id": 10813,
    "en": "Lisa has a school bag for the lesson. The bag is big, because Lisa needs a lot of stuff in the school",
    "de": "Lisa hat eine Schultasche für den Unterricht. Die Tasche ist groß, denn Lisa braucht in der Schule viele Sachen",
    "groupCode": 1
  },
  {
    "id": 10814,
    "en": "She always has in the bag pens of different colors. With the pens she writes on the board",
    "de": "Sie hat in der Tasche immer Stifte in verschiedenen Farben. Mit den Stiften schreibt sie an die Tafel",
    "desc": "Stifte: General term for all writing tools (pens, pencils).\nKuli: Informal for \"ballpoint pen.\"\nKugelschreiber: Formal term for \"ballpoint pen.\"",
    "groupCode": 1
  },
  {
    "id": 10815,
    "en": "In the school bag is also a thick German book. Lisa needs it for the lesson. The German book is very heavy",
    "de": "In der Schultasche ist auch ein dickes Deutschbuch. Lisa braucht es für den Unterricht. Das Deutschbuch ist sehr schwer",
    "groupCode": 1
  },
  {
    "id": 10816,
    "en": "On the kitchen table lies a glasses. It is the glasses for Lisa. Lisa can read better with the glasses",
    "de": "Auf dem Küchentisch liegt eine Brille. Es ist die Brille von Lisa. Lisa kann mit der Brille besser lesen",
    "groupCode": 1
  },
  {
    "id": 10817,
    "en": "Which T-shirt are you looking for?",
    "de": "Welches T-Shirt suchst du?",
    "groupCode": 1
  },
  {
    "id": 10818,
    "en": "Too bad! Not good, then I take an apple cake",
    "de": "Schade! Na gut, dann nehme ich einen Apfelkuchen",
    "groupCode": 1
  },
  {
    "id": 10819,
    "en": "Where is the dress, is it in the closet?",
    "de": "Wo ist das Kleid, ist es im Schrank?",
    "groupCode": 1
  },
  {
    "id": 10820,
    "en": "We want to celebrate together",
    "de": "Wir wollen zusammen feiern",
    "groupCode": 1
  },
  {
    "id": 10821,
    "en": "Are the dumplings really too spicy for you?",
    "de": "Sind die Knödel wirklich zu scharf für dich?",
    "groupCode": 1
  },
  {
    "id": 10822,
    "en": "Would you like to go by foot to (toward) the hotel?",
    "de": "Möchtest du zu fuß bis zum hotel gehen?",
    "desc": "Use bis to emphasize a limit, endpoint, or duration.\n\nExamples:\n\nOrt (Place): Wir gehen bis zum Park. (We walk all the way to the park.)\nZeit (Time): Ich warte bis morgen. (I wait until tomorrow.)\nReihenfolge (Order): Zähle bis zehn! (Count up to ten!)",
    "groupCode": 1
  },
  {
    "id": 10823,
    "en": "I still want to dance",
    "de": "I will noch tanzen",
    "groupCode": 1
  },
  {
    "id": 10824,
    "en": "Is it sunny today?",
    "de": "Ist es sonnig heute?",
    "groupCode": 1
  },
  {
    "id": 10825,
    "en": "My grandmother has thirty plants at home",
    "de": "Meine Großmutter hat dreißig Pflanzen zu hause",
    "groupCode": 1
  },
  {
    "id": 10826,
    "en": "It's already dark, what (how) time is it?",
    "de": "Es ist schon dunkel, wie spät ist es?",
    "groupCode": 1
  },
  {
    "id": 10827,
    "en": "Every child plays handball",
    "de": "Jedes Kind spielt Handball",
    "groupCode": 1
  },
  {
    "id": 10828,
    "en": "The concert in the park has to end, the weather is bad",
    "de": "Das Konzert im Park muss enden, das Wetter ist schlecht",
    "groupCode": 1
  },
  {
    "id": 10829,
    "en": "When does the concert end?",
    "de": "Wann hört das Konzert auf?",
    "groupCode": 1
  },
  {
    "id": 10830,
    "en": "I believe, the concert ends at half past ten",
    "de": "Ich glaube, das Konzert hört um halb elf auf",
    "groupCode": 1
  },
  {
    "id": 10831,
    "en": "Do you come visit me?",
    "de": "Kommst du mich besuchen?",
    "groupCode": 1
  },
  {
    "id": 10832,
    "en": "I am a software engineer and work at Knauf",
    "de": "Ich bin Software-Ingenieur und arbeite bei Knauf",
    "groupCode": 1
  },
  {
    "id": 10833,
    "en": "We would like to eat in the restaurant",
    "de": "Wir möchten im Restaurant essen",
    "groupCode": 1
  },
  {
    "id": 10834,
    "en": "The party is at home, not in the park",
    "de": "Die Party ist zu Hause, nicht im Park",
    "groupCode": 1
  },
  {
    "id": 10835,
    "en": "What does it smell like? It smells like flowers",
    "de": "Wonach riecht es? Es riecht nach Blumen",
    "desc": "We don't use \"was\" in \"Wonach riecht es?\" because the preposition \"nach\" requires a relative form. In German, \"wo-\" is combined with prepositions (like nach, mit, auf) to form question words for asking about things.\n\nExplanation:\n\"Was riecht es?\" would translate to \"What smells?\" which is asking about the subject (the thing emitting the smell).\n\"Wonach riecht es?\" asks about the object of the smell (what the smell is like or of).\nIn German, using \"wo-\" + preposition (e.g., wonach, womit, wovon) is standard for forming such questions.",
    "groupCode": 1
  },
  {
    "id": 10836,
    "en": "Customer finds receipt from 2002",
    "de": "Kunde/Kundin findet Kassenzettel von 2002",
    "groupCode": 1
  },
  {
    "id": 10837,
    "en": "I don't dance well",
    "de": "Ich tanze nicht gut",
    "groupCode": 1
  },
  {
    "id": 10838,
    "en": "It is foggy in the forest, do you want to camp here?",
    "de": "Es ist neblig im Walt, willst du hier campen?",
    "groupCode": 1
  },
  {
    "id": 10839,
    "en": "Do you need new clothes for the job interview?",
    "de": "Brauchst du neue Kleidung für das Job Interview?",
    "groupCode": 1
  },
  {
    "id": 10840,
    "en": "What else do you (formal) have? We only have nut cake",
    "de": "Was haben Sie denn noch? Wir haben nur noch Nusskuchen",
    "groupCode": 1
  },
  {
    "id": 10841,
    "en": "Do you have a nut allergy?",
    "de": "Hast du eine Nussallergie?",
    "groupCode": 1
  },
  {
    "id": 10842,
    "en": "I don't need a car, I always go by foot",
    "de": "Ich brauche kein Auto, ich gehe immer zu Fuß",
    "groupCode": 1
  },
  {
    "id": 10843,
    "en": "My clothes are too warm for Tehran",
    "de": "Meine Kleidung ist zu warm für Tehran",
    "desc": "\nIn German, Kleidung is singular \"clothes\" is plural, hence \"are\" is used.",
    "groupCode": 1
  },
  {
    "id": 10844,
    "en": "The dress is not in the closet",
    "de": "Das Kleid ist nicht im Schrank",
    "groupCode": 1
  },
  {
    "id": 10845,
    "en": "Our nut cake is specially good. But I don't like a nut cake. Oh right!",
    "de": "Unser Nusskuchen ist besonders gut. Ich mag aber keinen Nusskuchen. Ach so!",
    "groupCode": 1
  },
  {
    "id": 10846,
    "en": "I don't like the socks, they are too small",
    "de": "Ich mag die Socken nicht, sie sind zu klein",
    "groupCode": 1
  },
  {
    "id": 10847,
    "en": "Are the suitcases already full?",
    "de": "Sind die Koffer schon voll?",
    "groupCode": 1
  },
  {
    "id": 10848,
    "en": "I'm celebrating my birthday in the park",
    "de": "Ich feiere meinen Geburtstag im Park",
    "groupCode": 1
  },
  {
    "id": 10849,
    "en": "Do you have birthday in April?",
    "de": "Hast du im April Geburtstag?",
    "groupCode": 1
  },
  {
    "id": 10850,
    "en": "I pay for groceries with my EC card",
    "de": "Ich zahle mit meiner EC Karte für Lebensmittel",
    "groupCode": 1
  },
  {
    "id": 10851,
    "en": "My pets eat bananas every day! On Sundays I always have to buy twenty bananas",
    "de": "Meine Haustiere essen jeden Tag Bananen! Sonntags muss ich immer zwanzig Bananen kaufen",
    "groupCode": 1
  },
  {
    "id": 10852,
    "en": "My children don't like oranges",
    "de": "Meine Kinder mögen keine Orangen",
    "groupCode": 1
  },
  {
    "id": 10853,
    "en": "I want to invite you to breakfast, are you coming?",
    "de": "Ich will dich zum (toward) Frühstück einladen, kommst du?",
    "groupCode": 1
  },
  {
    "id": 10854,
    "en": "How many weeks are you (formal) staying here?",
    "de": "Wie viele Wochen bleiben Sie hier?",
    "groupCode": 1
  },
  {
    "id": 10855,
    "en": "Do you like eating cucumbers? Don't eat my cheese bread again",
    "de": "Isst du gern Gurken? Iss nicht wieder mein Käsebrot",
    "groupCode": 1
  },
  {
    "id": 10856,
    "en": "Are cars better than a train? Where are my motorcycle keys? Your keys lay (are placed) often in strange places",
    "de": "Sind Autos besser als ein Zug? Wo sind meine Motorradschlüssel? Deine Schlüssel liegen oft an komischen Orten",
    "desc": "We use \"an\" with places to say where something is.\n\n🟢 \"liegen an Orten\" = \"lie at places\"",
    "groupCode": 1
  },
  {
    "id": 10857,
    "en": "My wife needs a cucumber for the salad. Are you (formal) lying in the shower? No, that's too funny",
    "de": "Meine Frau braucht eine Gurke für den Salat. Liegen sie in der Dusche? Nein, das ist zu komisch",
    "groupCode": 1
  },
  {
    "id": 10858,
    "en": "We need flowers, go inside the flower shop. How many bananas do we need for the week?",
    "de": "Wir brauchen Blumen, geh in den Blumenladen. Wie viele Bananen brauchen wir für die Woche?",
    "groupCode": 1
  },
  {
    "id": 10859,
    "en": "We need less than a hundred pieces of pizza. Why are you always on the phone and always so loud? be quieter",
    "de": "Wir brauchen weniger als hundert Stück Pizza. Warum bist du immer am Telefon und immer so laut? Sie leiser",
    "groupCode": 1
  },
  {
    "id": 10860,
    "en": "I get up every day at 7 o'clock. The fridge is empty again",
    "de": "Ich stehe jeden Tag um 7 Uhr auf. Der Kühlschrank ist wieder leer",
    "groupCode": 1
  },
  {
    "id": 10861,
    "en": "How many books? My grandparents want to visit us and the apartment is now clean enough",
    "de": "Wie viele Bücher? Meine Großeltern möchten uns besuchen und die Wohnung ist jetzt sauber genug",
    "desc": "Wie viel: For uncountable nouns. (Wie viel Geld?)\nWie viele: For countable nouns. (Wie viele Bücher?)",
    "groupCode": 1
  },
  {
    "id": 10862,
    "en": "The girl lives in Munich. Our house is tidy again",
    "de": "Das Mädchen wohnt in München. Unser Haus ist wieder ordentlich",
    "groupCode": 1
  },
  {
    "id": 10863,
    "en": "I buy the orange juice in the supermarket. I ruined the cake (I have made the cake destroy)",
    "de": "Ich kaufe den Orangensaft im Supermarkt. I habe den Kuchen kaputt gemacht",
    "groupCode": 1
  },
  {
    "id": 10864,
    "en": "Is that a ballpoint pen or a pen or a pencil?",
    "de": "Ist das ein Kugelschreiber oder ein Stift oder ein Bleistift?",
    "groupCode": 1
  },
  {
    "id": 10865,
    "en": "I have a pen in my bag. I really wanted this cake. It was something entire special",
    "de": "Ich habe einen Stift in meiner Tasche. Ich wollte diesen Kuchen wirklich. Er war etwas ganz Besondere",
    "desc": "besonders = adverb (describes verbs/adjectives)\n\nbesondere = adjective (describes nouns)",
    "groupCode": 1
  },
  {
    "id": 10866,
    "en": "The reporter places (asks) many questions",
    "de": "Der Reporter (Die Reporterin) stellt viele Fragen",
    "groupCode": 1
  },
  {
    "id": 10867,
    "en": "You don't have to wait, I come later. What is your (formal) profession?",
    "de": "Du musst nicht warten, ich komme später. Was ist Ihr Beruf?",
    "groupCode": 1
  },
  {
    "id": 10868,
    "en": "Is your wife a lawyer or a professor?",
    "de": "Ist deine Frau Anwältin oder Professorin?",
    "groupCode": 1
  },
  {
    "id": 10869,
    "en": "The coat keeps me warm in winter",
    "de": "Der Mantel hält mich im Winter warm",
    "groupCode": 1
  },
  {
    "id": 10870,
    "en": "The coats hang on the coat rack",
    "de": "Die Mäntel hängen an der Garderobe",
    "groupCode": 1
  },
  {
    "id": 10871,
    "en": "You show him the table",
    "de": "Du zeigst ihm den Tisch",
    "desc": "Subject + Verb + DAT + AKK",
    "groupCode": 1
  },
  {
    "id": 10872,
    "en": "I have tomatoes and salad on the table",
    "de": "Ich habe Tomaten und Salat auf dem Tisch",
    "groupCode": 1
  },
  {
    "id": 10873,
    "en": "In the room are many things. A sofa, a table, a picture, a bottle, a pencil, a book, a key, a bag and so on",
    "de": "Im Zimmer sind viele Dinge. Ein Sofa, ein Tisch, ein Bild, eine Flasche, ein Bleistift, ein Buch, ein Schlüssel, eine Tasche und so weiter",
    "groupCode": 1
  },
  {
    "id": 10874,
    "en": "The closet is not practical. It is too small",
    "de": "Der Schrank ist nicht praktisch. Er ist zu klein",
    "groupCode": 1
  },
  {
    "id": 10875,
    "en": "The tables in the classroom are clean",
    "de": "Die Tische im Klassenzimmer sind sauber",
    "groupCode": 1
  },
  {
    "id": 10876,
    "en": "For breakfast I drink juice or tea",
    "de": "Zum Frühstück trinke ich Saft oder Tee",
    "groupCode": 1
  },
  {
    "id": 10877,
    "en": "The juice is fresh",
    "de": "Der Saft ist frisch",
    "groupCode": 1
  },
  {
    "id": 10878,
    "en": "I like apple juice and other juices",
    "de": "Ich mag Apfelsaft und andere Säfte",
    "groupCode": 1
  },
  {
    "id": 10879,
    "en": "The child is playing in the garden",
    "de": "Das Kind spielt im Garten",
    "groupCode": 1
  },
  {
    "id": 10880,
    "en": "Is your girlfriend an actress?",
    "de": "Ist deine Freundin Schauspielerin?",
    "groupCode": 1
  },
  {
    "id": 10881,
    "en": "The men are working hard",
    "de": "Die Männer arbeiten hart",
    "groupCode": 1
  },
  {
    "id": 10882,
    "en": "In this city there are many cinemas",
    "de": "In dieser Stadt gibt es viele Kinos",
    "groupCode": 1
  },
  {
    "id": 10883,
    "en": "Would you like to drink a specific beer?",
    "de": "Möchtest du ein bestimmtes Bier trinken?",
    "groupCode": 1
  },
  {
    "id": 10884,
    "en": "The exercise is easy",
    "de": "Die Übung ist einfach",
    "groupCode": 1
  },
  {
    "id": 10885,
    "en": "I do exercises every day",
    "de": "Ich mache jeden Tag Übungen",
    "groupCode": 1
  },
  {
    "id": 10886,
    "en": "The tree is very tall",
    "de": "Der Baum ist sehr hoch",
    "groupCode": 1
  },
  {
    "id": 10887,
    "en": "The trees in the park are green",
    "de": "Die Bäume im Park sind grün",
    "groupCode": 1
  },
  {
    "id": 10888,
    "en": "Many professions require special skills",
    "de": "Viele Berufe erfordern spezielle Fähigkeiten",
    "groupCode": 1
  },
  {
    "id": 10889,
    "en": "\n Chair \n Bag \n Folder \n Pen \n Cup \n Flower",
    "de": "\n der Stuhl/Stühle \n die Tasche/Taschen \n die Mappe/Mappen \n der Stift/Stifte \n die Tasse/Tassen \n die Blume/Blumen",
    "groupCode": 1
  },
  {
    "id": 10890,
    "en": "\n Computer \n Jacket \n Apfel \n Door \n German Book \n Shoe",
    "de": "\n der Computer/Computer \n die Jacke/Jacken \n der Apfel/Äpfel \n die Tür/Türen \n das Deutschbuch/Deutschbücher \n der Schuh/Schuhe",
    "groupCode": 1
  },
  {
    "id": 10891,
    "en": "I come too late. The party starts at 3 pm",
    "de": "Ich komme zu spät. Die Party fängt um 15 Uhr an",
    "groupCode": 1
  },
  {
    "id": 10892,
    "en": "When does the concert start and end? Too bad, the concert is already sold out",
    "de": "Wann fängt das Konzert an und hört es auf? Schade, das Konzert ist schon ausverkauft",
    "groupCode": 1
  },
  {
    "id": 10893,
    "en": "Our anniversary is on May 1st",
    "de": "Unser Jahrestag ist am ersten Mai",
    "groupCode": 1
  },
  {
    "id": 10894,
    "en": "We need less than ten bottles of white wine",
    "de": "Wir brauchen weniger als zehn Flaschen Weißwein",
    "groupCode": 1
  },
  {
    "id": 10895,
    "en": "My family eats a lot of meat. I always have to go into the butcher",
    "de": "Meine Familie isst viel Fleisch. Ich muss immer in die Metzgerei gehen",
    "groupCode": 1
  },
  {
    "id": 10896,
    "en": "Please, buy a pack of cookies",
    "de": "Bitte, kauf eine Packung kekse",
    "groupCode": 1
  },
  {
    "id": 10897,
    "en": "Thirty-five packs are too many",
    "de": "Fünfunddreißig Packungen sind zu viel",
    "groupCode": 1
  },
  {
    "id": 10898,
    "en": "I need two packs of eggs. I want to bake a cake",
    "de": "Ich brauche zwei Packungen Eier. Ich will einen Kuchen backen",
    "groupCode": 1
  },
  {
    "id": 10899,
    "en": "He meets us at quarter past six",
    "de": "Er trifft uns um Viertel nach sechs",
    "groupCode": 1
  },
  {
    "id": 10900,
    "en": "I don't see it. You have to talk to the airline, sorry.",
    "de": "Ich sehe ihn nicht. Du musst mit der Fluggesellschaft sprechen, tut mir leid",
    "groupCode": 1
  },
  {
    "id": 10901,
    "en": "I would like to pay now, where is the cash desk?",
    "de": "Ich möchte jetzt zahlen, wo ist die Kasse?",
    "groupCode": 1
  },
  {
    "id": 10902,
    "en": "How many liters of water does the elephant drink?",
    "de": "Wie viele liter Wasser trinkt der Elefant?",
    "desc": "Wie viel: For uncountable nouns. (Wie viel Geld?)\nWie viele: For countable nouns. (Wie viele Bücher?)",
    "groupCode": 1
  },
  {
    "id": 10903,
    "en": "Your father comes home soon. I have to clean the apartment now",
    "de": "Dein Vater kommt bald nach Hause. Ich muss jetzt die Wohnung putzen",
    "groupCode": 1
  },
  {
    "id": 10904,
    "en": "I can do the dishes. Correct. That here is my apartment. I often clean the apartment, I am messy",
    "de": "Ich kann abwaschen. Richtig. Das hier ist meine Wohnung. Ich putze oft die Wohnung, ich bin unordentlich",
    "groupCode": 1
  },
  {
    "id": 10905,
    "en": "Ali goes into the kitchen and washes off (does the dishes)",
    "de": "Ali geht in die Küche und wäscht ab",
    "groupCode": 1
  },
  {
    "id": 10906,
    "en": "I believe, you are really an adult (male)",
    "de": "Ich glaube, du bist wirklich ein Erwachsener",
    "groupCode": 1
  },
  {
    "id": 10907,
    "en": "The flower shop is closed. We still need flowers for your mother. Are there flowers in the garden",
    "de": "Der Blumenladen ist geschlossen. Wir brauchen noch Blumen für deine Mutter. Gibt es Blumen im Garten",
    "groupCode": 1
  },
  {
    "id": 10908,
    "en": "I want flowers, I have to go into the flower shop",
    "de": "Ich will Blumen, ich muss in den Blumenladen gehen",
    "groupCode": 1
  },
  {
    "id": 10909,
    "en": "I often play piano and I often play with my cat",
    "de": "Ich spiele oft Klavier und Ich spiele oft mit meiner Katze",
    "groupCode": 1
  },
  {
    "id": 10910,
    "en": "Ali is definitely (in any case) coming. Ali takes a taxi",
    "de": "Ali kommt auf jeden Fall. Ali nimmt ein Taxi",
    "groupCode": 1
  },
  {
    "id": 10911,
    "en": "Please introduce yourself (formal)",
    "de": "Bitte stellen Sie sich vor",
    "groupCode": 1
  },
  {
    "id": 10912,
    "en": "Please spell (formal) kuchen. There's a zoo in the neighborhood. My children want to visit the elephant every day. He's very big and sweet (love)",
    "de": "Bitte buchstabieren Sie kuchen. Es gibt einen Zoo in dem Stadtviertal. Meine Kinder möchten den Elefanten jeden Tag besuchen. Er ist sehr groß und lieb",
    "groupCode": 1
  },
  {
    "id": 10913,
    "en": "We learn German, but German is a bit difficult",
    "de": "Wir lernen Deutsch, aber Deutsch ist ein bisschen schwer",
    "groupCode": 1
  },
  {
    "id": 10914,
    "en": "What is healthier, coffee or tea?",
    "de": "Was ist gesünder, Kaffee oder Tee?",
    "groupCode": 1
  },
  {
    "id": 10915,
    "en": "I speak three languages: My mother tongue is Persian. I speak English well and a little German. I am currently learning German",
    "de": "Ich spreche drei Sprachen: Meine Muttersprache ist Persisch. Ich spreche gut Englisch und ein bisschen Deutsch. Zurzeit lerne ich Deutsch",
    "groupCode": 1
  },
  {
    "id": 10916,
    "en": "I am a software engineer by profession. My hobbies are swimming and playing with my child",
    "de": "Ich bin Software-Ingenieur von Beruf. Meine Hobbys sind Schwimmen und mit meinem Kind spielen",
    "groupCode": 1
  },
  {
    "id": 10917,
    "en": "Please place a question (formal). I know your elephant, he is my friend",
    "de": "Bitte Stellen Sie eine Frage. Ich kenne deinen Elefanten, er ist mein Freund",
    "groupCode": 1
  },
  {
    "id": 10918,
    "en": "What do you usually eat for breakfast? Is there a bank in the neighborhood",
    "de": "Was isst du meistens zum (toward) frühstück? Gibt es eine Bank in dem Stadtviertel",
    "groupCode": 1
  },
  {
    "id": 10919,
    "en": "This is not a good idea. The student (male) is not married. Do you like the student?",
    "de": "Das ist keine gute Idee. Der Student ist nicht verheiratet, Magst du den Studenten?",
    "desc": "In German, nouns change based on their case (subject, object, etc.). When the noun is in the accusative case (i.e., it's the direct object of the sentence), the article and the noun itself may change.",
    "groupCode": 1
  },
  {
    "id": 10920,
    "en": "Buy only cucumbers and rice. Does the student live downstairs?",
    "de": "Kauft nur Gurken und Reis. Wohnt der Student unten?",
    "groupCode": 1
  },
  {
    "id": 10921,
    "en": "We have only one cucumber in the fridge. The building is very old and really high",
    "de": "Wir haben nur eine Gurke im Kühlschrank. Das Gebäude ist sehr alt und wirklich hoch",
    "groupCode": 1
  },
  {
    "id": 10922,
    "en": "Are you going to the supermarket right soon (in a moment)? I'm going into the supermarket right soon (in a moment)",
    "de": "Gehst du gleich in den Supermarkt? Ich gehe gleich in den Supermarkt",
    "groupCode": 1
  },
  {
    "id": 10923,
    "en": "The supermarket and the bakery are in the city center. I go into the bakery and into supermarket and I buy cakes",
    "de": "Der supermarkt und die bäckerei sind im stadtzentrum. ich gehe in die bäckerei und in den Supermarkt und ich kaufe Kuchen",
    "groupCode": 1
  },
  {
    "id": 10924,
    "en": "Does a pack of tomatoes cost only sixty cents?",
    "de": "Kostet eine Packung Tomaten nur sechzig Cent?",
    "groupCode": 1
  },
  {
    "id": 10925,
    "en": "I want to pay now. Where is the cash register?",
    "de": "Ich will jetzt zahlen. Wo ist die Kasse?",
    "groupCode": 1
  },
  {
    "id": 10926,
    "en": "A bag costs sixty cents and you (formal) can pack your food here. Are two bags enough?",
    "de": "Eine Tüte kostet sechzig Cent und Sie können ihr Essen hier einpacken. Sind zwei Tuten genung?",
    "groupCode": 1
  },
  {
    "id": 10927,
    "en": "Yes, I would like the receipt. I know the boy because he is my brother",
    "de": "Ja, ich möchte den kassenzettel. Ich kenne den jungen, denn er ist mein Bruder",
    "groupCode": 1
  },
  {
    "id": 10928,
    "en": "Do we really have hundred cucumbers in the garden?",
    "de": "Haben wir wirklich hundert Gurken im Garten?",
    "groupCode": 1
  },
  {
    "id": 10929,
    "en": "Do you want to invite your parents to lunch?",
    "de": "Willst du deine Eltern zum (toward) Mittagessen einladen?",
    "groupCode": 1
  },
  {
    "id": 10930,
    "en": "Which sport do you want to do? I know the student student (male). He's my neighbor. The university is nearby, and there are many students in the neighborhood.",
    "de": "Welchen Sport willst du machen? Ich kenne den Studenten. Er ist mein Nachbar. Die Universität ist in der Nahe und es gibt in dem Stadtviertel viele Studenten",
    "desc": "In German, nouns change based on their case (subject, object, etc.). When the noun is in the accusative case (i.e., it's the direct object of the sentence), the article and the noun itself may change.",
    "groupCode": 1
  },
  {
    "id": 10931,
    "en": "It is often cloudy in spring",
    "de": "Es ist oft bewölkt im frühling",
    "groupCode": 1
  },
  {
    "id": 10932,
    "en": "It is already quarter to eleven",
    "de": "Es ist schon Viertel vor elf",
    "groupCode": 1
  },
  {
    "id": 10933,
    "en": "I eat chicken with pasta on Sundays",
    "de": "Ich esse sonntags Hähnchen mit Nudeln",
    "groupCode": 1
  },
  {
    "id": 10934,
    "en": "What are you doing on March 1st?",
    "de": "Was machst du am ersten März?",
    "groupCode": 1
  },
  {
    "id": 10935,
    "en": "Exactly, the departure is at half past nine",
    "de": "Genau, die Abfahrt ist um halb zehn",
    "groupCode": 1
  },
  {
    "id": 10936,
    "en": "Ali saves the number",
    "de": "Ali speichert die Nummer",
    "groupCode": 1
  },
  {
    "id": 10937,
    "en": "Which of these banks do you know?",
    "de": "Welche dieser Banken kennst du?",
    "desc": "In \"Welche dieser Banken kennst du?\", \"dieser\" is in the genitive case because it means \"of these banks\" (a subset of banks). The genitive is needed to show this relationship.",
    "groupCode": 1
  },
  {
    "id": 10938,
    "en": "Do you speak Portuguese? No, I don't speak Portuguese so well. I speak spanish. I am spanish",
    "de": "Sprichst du Portugiesisch? Nein, Ich spreche nicht so gut Portugiesisch. Ich spreche Spanisch. Ich bin Spanier",
    "groupCode": 1
  },
  {
    "id": 10939,
    "en": "The violin is very inexpensive",
    "de": "Die Geige ist sehr günstig/billig",
    "groupCode": 1
  },
  {
    "id": 10940,
    "en": "Munich is a city in Germany",
    "de": "München ist eine Stadt in Deutschland",
    "groupCode": 1
  },
  {
    "id": 10941,
    "en": "He is Chinese and speaks Chinese and a little German",
    "de": "Er ist Chinese und spricht Chinesisch und ein bisschen Deutsch",
    "groupCode": 1
  },
  {
    "id": 10942,
    "en": "That is my German course",
    "de": "Das ist mein Deutschkurs",
    "groupCode": 1
  },
  {
    "id": 10943,
    "en": "We are 14 people and together we are 420 years old",
    "de": "Wir sind 14 Leute und zusammen sind wir 420 Jahre alt",
    "groupCode": 1
  },
  {
    "id": 10944,
    "en": "Who has a chair? The basketball game begins soon (in a moment), do you want to come along?",
    "de": "Wer hat einen Stuhl? Das Basketballspiel beginnt gleich, willst du mitkommen?",
    "groupCode": 1
  },
  {
    "id": 10945,
    "en": "She is 24 years old and saleswoman",
    "de": "Sie ist 24 Jahre alt und Verkäuferin",
    "groupCode": 1
  },
  {
    "id": 10946,
    "en": "(The) Most of time I spent with my family",
    "de": "Die meiste Zeit verbringe ich mit meiner Familie",
    "groupCode": 1
  },
  {
    "id": 10947,
    "en": "(The) Most people like pizza",
    "de": "Die meisten Leute mögen Pizza",
    "groupCode": 1
  },
  {
    "id": 10948,
    "en": "I eat usually bread for breakfast",
    "de": "Ich esse meistens Brot zum (toward) Frühstück",
    "groupCode": 1
  },
  {
    "id": 10949,
    "en": "She meets her mother in an hour in the cafe shop",
    "de": "Sie trifft ihre Mutter in einer Stunde im Café",
    "groupCode": 1
  },
  {
    "id": 10950,
    "en": "How many cucumbers do you need for the salad?",
    "de": "Wie viele Gurken brauchst du für den Salat?",
    "groupCode": 1
  },
  {
    "id": 10951,
    "en": "My husband goes to the pastry shop once a week",
    "de": "Mein Mann geht einmal pro Woche in die Konditorei",
    "groupCode": 1
  },
  {
    "id": 10952,
    "en": "I can't see the bags. I don't need a receipt",
    "de": "Ich kann die Tüten nicht sehen. Ich brauche keinen Kassenzettel",
    "groupCode": 1
  },
  {
    "id": 10953,
    "en": "Where is your turtle going so fast?",
    "de": "Wohin geht deine Schildkröte so schnell?",
    "groupCode": 1
  },
  {
    "id": 10954,
    "en": "Which seat would you (formal) like in the cinema?",
    "de": "Welchen Sitz möchten Sie im Kino?",
    "groupCode": 1
  },
  {
    "id": 10955,
    "en": "The cash register is not at the back",
    "de": "Die Kasse ist nicht hinten",
    "groupCode": 1
  },
  {
    "id": 10956,
    "en": "We need three things for my party",
    "de": "Wir brauchen drei Dinge für meine Party",
    "groupCode": 1
  },
  {
    "id": 10957,
    "en": "Can you bake a cake for me?",
    "de": "Kannst du einen Kuchen für mich backen?",
    "groupCode": 1
  },
  {
    "id": 10958,
    "en": "Mr. Zandi, thank you for your (formal) help. Ali, thank you for your help.",
    "de": "Herr Zandi, danke für ihre hilfe. Ali, danke für deine Hilfe",
    "groupCode": 1
  },
  {
    "id": 10959,
    "en": "I would definitely (in any case) like to come. Can we eat breakfast a little later? We're also going to the club tonight and want to sleep in tomorrow",
    "de": "Ich möchte Auf jeden fall kommen. Können wir ein bisschen später frühstücken? Wir gehen heute Abend noch in den Club und wollen morgen aussclafen",
    "groupCode": 1
  },
  {
    "id": 10960,
    "en": "Today is an important day, we are having (making) a party",
    "de": "Heute ist ein wichtiger Tag, wir machen eine Party",
    "groupCode": 1
  },
  {
    "id": 10961,
    "en": "She is excited, her partner's (male) birthday is soon",
    "de": "Sie ist aufgeregt, ihr Partner hat bald Geburtstag",
    "groupCode": 1
  },
  {
    "id": 10962,
    "en": "He hopes his wife likes the party. My bear is not dangerous. He is very sweet (love)",
    "de": "Er hofft seine Frau mag die Party. Mein Bär ist nicht gefährlich. Er ist sehr lieb",
    "groupCode": 1
  },
  {
    "id": 10963,
    "en": "Can you please buy carrots this afternoon? My pets love carrots",
    "de": "Kannst du bitte heute Nachmittag Karotten kaufen? Meine Haustiere lieben Karotten",
    "groupCode": 1
  },
  {
    "id": 10964,
    "en": "Are you bringing along a cake? There is a bear in the neighborhood",
    "de": "Bringst du einen Kuchen mit? Es gibt einen Bären in dem Stadtviertel",
    "desc": "In German, when you use \"Es gibt\" (there is/are), it's a special case that requires the accusative for the object, not the nominative. So, even though you might expect nominative (because you're saying something exists), the correct case is accusative.",
    "groupCode": 1
  },
  {
    "id": 10965,
    "en": "I'm bringing along chocolate to (toward) the party. I bring along a gift for you",
    "de": "Ich bringe Schokolade zur Party mit. Ich bringe ein Geschenk für dich mit",
    "groupCode": 1
  },
  {
    "id": 10966,
    "en": "You don't have to bring along gifts to (toward) the party",
    "de": "Du musst keine Geschenke zur Party mitbringen",
    "groupCode": 1
  },
  {
    "id": 10967,
    "en": "How many presents does Ali get? Who's coming later? With whom do you want to watch TV?",
    "de": "Wie viele Geschenke bekommt Ali? Wer kommt später? Mit wem willst du fernsehen?",
    "groupCode": 1
  },
  {
    "id": 10968,
    "en": "I have to pick up my parents earlier. This woman knows you, do you know her?",
    "de": "Ich muss meine Eltern früher abholen. Diese Frau kennt dich, kennst du sie?",
    "groupCode": 1
  },
  {
    "id": 10969,
    "en": "Are you picking up your parents ? No, this woman is not my neighbor (female). We are married and live together. That is my wife",
    "de": "Holst du deine Eltern ab? Nein, diese Frau ist nicht meine Nachbarin. Wir sind verheiratet und wohnen zusammen. Das ist meine Frau",
    "groupCode": 1
  },
  {
    "id": 10970,
    "en": "Whom do I pick up? I'm not paying any bills this month, you pay everything",
    "de": "Wen hole ich ab? Ich zahle diesen monat keine Rechnungen, du zahlst alles",
    "groupCode": 1
  },
  {
    "id": 10971,
    "en": "For Whom are you buying the gifts? We want to fly to Turkey for a few days",
    "de": "Für wen kaufst du die Geschenke? Wir wollen für ein paar tage in die Türkei fliegen",
    "desc": "The preposition \"in\" is used when referring to entering or traveling to a country \n\n\n The preposition \"zu\" is generally used when referring to going to a specific place, person, or event (e.g., \"zur Schule\" = to school, \"zum Arzt\" = to the doctor). It is not used for countries",
    "groupCode": 1
  },
  {
    "id": 10972,
    "en": "The food is bland",
    "de": "Das Essen ist fade",
    "groupCode": 1
  },
  {
    "id": 10973,
    "en": "My mother picks up eight bottles of wine. My girlfriend and I are eating breakfast with my mom",
    "de": "Meine Mutter holt acht Flaschen wein ab. Meine Freundin und ich frühstücken mit meiner Mama",
    "groupCode": 1
  },
  {
    "id": 10974,
    "en": "The house is dirty, we have to clean it. Who is that? Who are you going to the movies to see?",
    "de": "Das Haus ist schmutzig, wir müssen es putzen. Wer ist das? Wem gehst du inst Kino?",
    "groupCode": 1
  },
  {
    "id": 10975,
    "en": "The train arrives in forty-five minutes. My brother pick Ali up from the train station, then they come to (toward) the party together",
    "de": "Der Zug kommt in fünfundvierzig Minuten. Mein Bruder holt Ali vom Bahnhof ab, dann kommen sie zusammen zur Party",
    "groupCode": 1
  },
  {
    "id": 10976,
    "en": "I have a request, can you find a band?",
    "de": "Ich habe eine Bitte, kannst du eine Band finden?",
    "groupCode": 1
  },
  {
    "id": 10977,
    "en": "The gift is boring. I don't like it \n Who can continue?",
    "de": "Das Geschenk ist langweilig. Ich mag es nicht \n Wer kann weiter machen?",
    "groupCode": 1
  },
  {
    "id": 10978,
    "en": "I have to speak to you (formal), do you (formal) have a moment?",
    "de": "Ich muss mit ihnen sprechen, haben Sie einen Moment?",
    "groupCode": 1
  },
  {
    "id": 10979,
    "en": "I'm sorry, I'm nervous because I don't understand the question",
    "de": "Es tut mir leid, ich bin nervös, denn ich verstehe die Frage nicht",
    "groupCode": 1
  },
  {
    "id": 10980,
    "en": "We have to give the forms to the boss (female). I was distracted and didn’t listen",
    "de": "Wir müssen die Formulare der Chefin geben. Ich war abgelenkt und habe nicht zugehört",
    "groupCode": 1
  },
  {
    "id": 10981,
    "en": "I don't understand this word, what does it mean? I was so absent-minded. I forgot my key",
    "de": "Ich verstehe dieses Wort nicht, was bedeutet es? Ich war so geistesabwesend. Ich habe meinen Schlüssel vergessen",
    "groupCode": 1
  },
  {
    "id": 10982,
    "en": "I don't understand the question, do you understand it? I am doing training as a mechanic",
    "de": "Ich verstehe die Frage nicht, verstehst du sie? Ich mache eine Ausbildung als Mechanike",
    "groupCode": 1
  },
  {
    "id": 10983,
    "en": "We drive almost always by the street car. The traffic in the city is very slow",
    "de": "Wir fahren fast immer mit der Straßenbahn. Der Verkehr in der Stadt ist sehr langsam",
    "groupCode": 1
  },
  {
    "id": 10984,
    "en": "I ride with the bike to (toward) the embassy and of course I wear my bike helmet",
    "de": "Ich fahre mit dem Fahrrad zur Botschaft und natürlich trage ich meinen Fahrradhelm",
    "groupCode": 1
  },
  {
    "id": 10985,
    "en": "I usually drive with the bus to the bank. I am single and have no children",
    "de": "Ich fahre meistens mit dem Bus zur Bank. Ich bin ledig und habe keine Kinder",
    "groupCode": 1
  },
  {
    "id": 10986,
    "en": "I'm staying home because I'm sick",
    "de": "\n 1.Ich bleibe zu Hause, weil ich krank bin \n 2.Ich bleibe zu Hause, denn ich bin krank",
    "desc": "weil → verb at end\n\ndenn → verb in normal spot",
    "groupCode": 1
  },
  {
    "id": 10987,
    "en": "I'm paying these bills this month, but can you pay the rent? I'm looking for a new job and pay again next time",
    "de": "Ich zahle diesen Monat die Rechnungen. aber kannst du die Miete zahlen? Ich suche einen neuen Job und zahle nächstes Mal wieder",
    "groupCode": 1
  },
  {
    "id": 10988,
    "en": "I go hiking in the Black Forest with my brother this summer. I'm pleased because we're also camping there",
    "de": "Ich gehe diesen Sommer mit meinem Bruder im Schwarzwald wandern. Ich frue mich, denn wir campen dort auch",
    "groupCode": 1
  },
  {
    "id": 10989,
    "en": "We always read in the morning. My parents read the newspaper, and I read a children's book with my niece. She cannot read alone yet",
    "de": "Wir lesen morgens immer. Meine Eltern lesen die Zeitung und ich lese mit meiner Nichte ein Kinderbuch. Sie kann noch nicht allein lesen",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "Are you coming? The class starts soon (in a moment)",
    "de": "Kommt ihr? Der Unterricht fängt gleich an",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "Sometimes we watch movies in German course",
    "de": "Manchmal sehen wir im Deutschkurs Filme an",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "We want to learn German together. Are you joining in (Do you participate)?",
    "de": "Wir wollen zusammen Deutsch lernen. Machst du mit?",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "Is there no class today? Oh, I did not receive the information",
    "de": "Heute ist kein Unterricht? Oh, ich habe die Information nicht bekommen",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "In our German class, we took photos of food and made a photo dictionary.\nAt home, I looked at the dictionary repeatedly and learned the words.\nIt worked well!",
    "de": "Im Deutschkurs haben wir Essen fotografiert und ein Foto-Wörterbuch gemacht.\nZu Hause habe ich das Wörterbuch immer wieder angesehen und die Wörter gelernt.\nDas hat gut funktioniert!",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "Last Tuesday, we played a chain game in class.\nAli started, and then everyone joined in. It was great",
    "de": "Letzten Dienstag haben wir im Kurs ein Kettenspiel gespielt.\nAli hat angefangen, dann haben alle mitgemacht. Das war toll",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "Yesterday I called my friend Ali.\nWe were studying together in Zagreb.\nWe talked on the phone for three hours – and only spoke German!",
    "de": "Gestern habe ich meinen Freund Ali angerufen.\nWir haben zusammen in Zagreb studiert.\nDrei Stunden haben wir telefoniert – und nur Deutsch gesprochen!",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Ich habe mit meinem Sohn gespielt, gelernt und meine Hausaufgaben gemacht",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Ich bin im Museum. bist du dort? (positiopn) Ich gehe ins Museum. Gehst du dorthin?",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Was hast du letztes Wochenende gemacht?",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Ich habe Freunde getroffen",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Seid ihr in einen Club gegangen?",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Ja, und wir haben den ganzen Abend getanzt",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Hat das Spaß gemacht?",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Gestern bin ich um 7 Uhr aufgestanden und habe das Frühstück gemacht.",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Dann sind die Kinder in den Kindergarten gegangen und ich bin mit dem Bus zum Büro gefahren",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Dort habe ich bis 16 Uhr gearbeitet",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Danach habe ich die Kinder abgeholt.",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Zu Hause habe ich die Wohnung geputzt und Abendessen gekocht.",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Am Abend hat Emir aus Rom angerufen und wir haben lange telefoniert",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "",
    "groupCode": 1
  }




  140

  gefallen
  das essen gefallt dem kind

  143-7









]
