[
  {
    "id": 1001,
    "fa": "ولم کن",
    "en": "Let go of me"
  },
  {
    "id": 1002,
    "fa": "سیگار کشیدن از شخصیت تو بعیده",
    "en": "It's out of character for you to smoke"
  },
  {
    "id": 1003,
    "fa": "برق اومد",
    "en": "Power's back on"
  },
  {
    "id": 1004,
    "fa": "گاز قطعه",
    "en": "Gas is cut off"
  },
  {
    "id": 1005,
    "fa": "چرا هوس صحبت با اجسام بی جان دارید؟",
    "en": "Why do you feel the urge to speak to inanimate objects?",
    "desc": "While the overall meaning is similar, \"I feel an urge\" places more emphasis on the personal perception or awareness of the desire, while \"I get an urge\" places more emphasis on the occurrence or triggering of the desire. The choice between the two phrases can depend on the specific context and the speaker's intended emphasis."
  },
  {
    "id": 1006,
    "fa": "داشتن یک مدیر خوب یک نعمت است",
    "en": "Having a good manager is a blessing"
  },
  {
    "id": 1007,
    "fa": "من قصد دارم این ساندویچ را در سلفون بپیچم",
    "en": "I'm gonna wrap this sandwich in Saran (/səˈræn/) wrap"
  },
  {
    "id": 1008,
    "fa": "اشتباه می کنی",
    "en": "You're mistaken"
  },
  {
    "id": 1009,
    "fa": "پریشب، خواب شگفت انگیزی در مورد پرواز داشتم",
    "en": "The night before last, I had a wonderful dream about flying"
  },
  {
    "id": 1010,
    "fa": "پریروز یک دوست قدیمی را که سال ها ندیده بود ملاقات کردم",
    "en": "The day before yesterday, I met an old friend whom I hadn't seen in years",
    "desc": "\"in years\" refers to a past duration of time, while \"for years\" emphasizes the ongoing nature of the duration."
  },
  {
    "id": 1011,
    "fa": "من برای اکران فیلم هیجان زده هستم. پس فردا داره میاد بیرون",
    "en": "I'm excited for the movie release. It's coming out the day after tomorrow"
  },
  {
    "id": 1012,
    "fa": "من یک روز در میان برای حفظ تناسب اندامم به باشگاه می روم",
    "en": "I go to the gym every other day to keep my body fit"
  },
  {
    "id": 1013,
    "fa": "چه روزی است امروز؟",
    "en": "What's the day today?"
  },
  {
    "id": 1014,
    "fa": "امروز چندم است؟",
    "en": "What's the date today?"
  },
  {
    "id": 1015,
    "fa": "چند روز پیش در خواربارفروشی با علی برخورد کردم",
    "en": "I bumped into Ali at the grocery store the other day"
  },
  {
    "id": 1016,
    "fa": "مجبور بودم دو روز متوالی دیر کار کنم تا به ضرب الاجل پروژه برسم",
    "en": "I had to work late two days in a row to meet the project deadline"
  },
  {
    "id": 1017,
    "fa": "کمی بخواب",
    "en": "Get some sleep"
  },
  {
    "id": 1018,
    "fa": "عیبی نداره",
    "en": "No biggie"
  },
  {
    "id": 1019,
    "fa": "اصلا و ابدا!",
    "en": "Hell no!"
  },
  {
    "id": 1020,
    "fa": "کفش هام پامو میزنه",
    "en": "My shoes pinch"
  },
  {
    "id": 1021,
    "fa": "رنگ پریده به نظر میرسی",
    "en": "You look pale"
  },
  {
    "id": 1022,
    "fa": "شما نمی توانید من را گول بزنید",
    "en": "You can't fool me"
  },
  {
    "id": 1023,
    "fa": "من باهات رو راستم",
    "en": "I'm upfront with you"
  },
  {
    "id": 1024,
    "fa": "روزم رو ساختی",
    "en": "You made my day"
  },
  {
    "id": 1025,
    "fa": "بپر بالا",
    "en": "Hop in"
  },
  {
    "id": 1026,
    "fa": "دارند به رادیو گوش می دهند",
    "en": "They're listening to the radio"
  },
  {
    "id": 1027,
    "fa": "دیروز کجا بودی؟",
    "en": "Where were you yesterday?"
  },
  {
    "id": 1028,
    "fa": "آیا تا به حال خارج رفتی؟",
    "en": "Have ever gone abroad?",
    "desc": "\"Have you ever been abroad?\" is the more commonly used phrase to ask about someone's experience of being in another country. \"Have you ever gone abroad?\" can also be understood, but it specifically highlights the act of physically traveling to another country."
  },
  {
    "id": 1029,
    "fa": "بستگی به آب و هوا دارد",
    "en": "It depends on the weather"
  },
  {
    "id": 1030,
    "fa": "او (زن) رفت بدون گفتن خداحافظ",
    "en": "She left without saying goodbye"
  },
  {
    "id": 1031,
    "fa": "اینجا انگلیسی صحبت می شه",
    "en": "English is spoken here"
  },
  {
    "id": 1032,
    "fa": "در نظر داشته باشید که فردا آخرین مهلت عرضه درخواست شماست",
    "en": "Keep in mind that tomorrow is the deadline for submitting your application"
  },
  {
    "id": 1033,
    "fa": "من رو 2 نفر حساب کن",
    "en": "Count me as 2 people"
  },
  {
    "id": 1034,
    "fa": "پس از تجزیه و تحلیل تمام داده ها، به این نتیجه رسیدیم که پروژه به زمان بیشتری نیاز دارد",
    "en": "After analyzing all the data, we came to the conclusion that the project needs more time"
  },
  {
    "id": 1035,
    "fa": "مردم از من می پرسند که چرا با هم نیستیم؟ فقط نمیدونم چی بهشون بگم",
    "en": "People ask me why we're not together. I just don't know what to tell them"
  },
  {
    "id": 1036,
    "fa": "واقعا گیج شدم",
    "en": "I got really confused"
  },
  {
    "id": 1037,
    "fa": "من نگاهی محافظه کارانه به مسائل اجتماعی دارم",
    "en": "I hold conservative view on social issues"
  },
  {
    "id": 1038,
    "fa": "چیزی که من از نقطه نظر فنی فهمیدم این است که نرم افزار نیاز دارد به یک بروز رسانی ",
    "en": "What I understood from a technical point of view is that the software requires an update"
  },
  {
    "id": 1039,
    "fa": "من مطمئن نیستم که تا چه حد می توانیم حمایت کنیم",
    "en": "I'm not sure to what extent we can support"
  },
  {
    "id": 1040,
    "fa": "حجم کار بیش از حد منجر به سرریز وظایف شد",
    "en": "The excessive workload led to a spillover of tasks"
  },
  {
    "id": 1041,
    "fa": "مهم است که شرایط آب و هوایی را در نظر بگیرید",
    "en": "It's important to take into account the weather conditions"
  },
  {
    "id": 1042,
    "fa": "شما باید کار واگذار شده خود را در مهلت مقرر عرضه کنید",
    "en": "You must submit your assignment by the deadline",
    "desc": "\"should\" suggests a recommendation or preference, allowing some discretion, while \"must\" conveys a stronger sense of obligation or requirement, leaving little to no room for choice."
  },
  {
    "id": 1043,
    "fa": "آنهایی با پوسته های سخت ارزش این زحمت را ندارند",
    "en": "Those with hard shells aren't worth the trouble"
  },
  {
    "id": 1044,
    "fa": "او (زن) به دلیل ترسش از ارتفاع (بلندی ها) نمی توانست از نردبان بالا برود",
    "en": "She couldn't climb the ladder due to her fear of heights"
  },
  {
    "id": 1045,
    "fa": "نیاز دارم سیم را از رابط بکشم و آن را به پریز دیواری بزنم",
    "en": "I need to unplug it from the extension cord and plug it into the wall socket"
  },
  {
    "id": 1046,
    "fa": "کنترل خنک کننده و رادیاتور را روی \"دانه برف\" تنظیم کنید",
    "en": "Set cooling controller and radiator to \"snowflake\""
  },
  {
    "id": 1047,
    "fa": "کلیه اتاق های جلسات در دفتر ما مسدود خواهد شد و نمی توان استفاده کرد",
    "en": "All meeting rooms in our office will be blocked and cannot be used"
  },
  {
    "id": 1048,
    "fa": "دیدش (زن) بعد از برداشتن عینکش تار شده بود",
    "en": "Her vision got blurry (بلِری) after removing her glasses"
  },
  {
    "id": 1049,
    "fa": "من بودم مطمئنا",
    "en": "It was me for sure"
  },
  {
    "id": 1050,
    "fa": "باید یک پنالتی علیه شما وجود داشته باشد",
    "en": "There should be a penalty against you"
  },
  {
    "id": 1051,
    "fa": "تلفن هر لحظه میتونست با اخبار هیجان انگیز از آمریکا زنگ بخورد",
    "en": "The phone could ring with exciting news from America at any second"
  },
  {
    "id": 1052,
    "fa": "آیا هر چیزی که گفتم معنی میده؟",
    "en": "Does everything I said make sense?"
  },
  {
    "id": 1053,
    "fa": "منظور من را اشتباه برداشت نکن",
    "en": "Don't get me wrong"
  },
  {
    "id": 1054,
    "fa": "من فقط می خواهم در موردش شفاف باشم",
    "en": "I just want to be transparent about it"
  },
  {
    "id": 1055,
    "fa": "فکر کردم حل شد",
    "en": "I thought it was solved"
  },
  {
    "id": 1056,
    "fa": "آیا کسی سرنخی دارد که این اعداد چه خواهند بود؟",
    "en": "Does anybody have any clue what these numbers would be?"
  },
  {
    "id": 1057,
    "fa": "او (مرد) قرار است مثل پارسال جشن بگیرد",
    "en": "He will be throwing a party like last year",
    "desc": "Future Continuous tense emphasizes the ongoing nature of an action in the future"
  },
  {
    "id": 1058,
    "fa": "او (زن) قراره نوشتن گزارش خود را تا هفته آینده به پایان برساند",
    "en": "She will have finished writing her report by next week",
    "desc": "Future Perfect tense emphasizes the completion of an action before a future reference point"
  },
  {
    "id": 1059,
    "fa": "من قراره دو ساعت منتظر باشم تا آن زمان که او (مرد) بیاید",
    "en": "I will have been waiting for two hours by the time he arrives",
    "desc": "Future Perfect Continuous tense combines continuity and completion in the future"
  },
  {
    "id": 1060,
    "fa": "میدونستم کمکش (مرد) نمیکنی",
    "en": "I knew you would not help him"
  },
  {
    "id": 1061,
    "fa": "من می توانم توضیح مختصری در مورد فرآیند به شما بدهم، آنچنان زمانی نخواهد برد",
    "en": "I can give you a brief explanation of the process, it won't take that much time"
  },
  {
    "id": 1062,
    "fa": "خدا نکند حادثه بیافتد، ما باید اطمینان حاصل کنیم که تدابیر ایمنی در جای خود هستند",
    "en": "God forbid any accidents, we must ensure the safety measures are in place"
  },
  {
    "id": 1063,
    "fa": "مدتی است که (تا حالا) نیاز به سرمایه گذاری دارد",
    "en": "It has needed investment for a while now",
    "desc": "\"It has needed investment for a while now\": This sentence implies that the subject has been in need of investment for an extended period of time, including the present moment. The use of \"now\" emphasizes that the need for investment has persisted over time and continues to be relevant.\n\n\"It has needed investment for a while\": This sentence indicates that the subject has been in need of investment for a significant duration in the past. However, it does not explicitly mention whether the need for investment still exists at the present moment."
  },
  {
    "id": 1064,
    "fa": "نمی توانیم انتظار داشته باشیم که اوضاع به این زودی بهتر شه",
    "en": "We can't expect the situation to improve anytime soon"
  },
  {
    "id": 1065,
    "fa": "کدام حیوان بهترین حس بویایی را دارد؟",
    "en": "Which animal has the best sense of smell?"
  },
  {
    "id": 1066,
    "fa": "من تازه رسیدم مطب دکتر",
    "en": "I have just arrived at the doctor's office"
  },
  {
    "id": 1067,
    "fa": "به نظر شما چقدر احتمال دارد که آن بتونه به عنوان یک پیامد باشه؟",
    "en": "How likely do you think that could be as an outcome?"
  },
  {
    "id": 1068,
    "fa": "برای شما و شرکتتان آرزوی موفقیت روزافزون دارم",
    "en": "I wish you and your company continued success"
  },
  {
    "id": 1069,
    "fa": "به خاطر خدا، لطفا در را ببند!",
    "en": "For God's sake, please close the door!"
  },
  {
    "id": 1070,
    "fa": "جلو پات رو نگاه کن در حال راه رفتن در مسیر یخی",
    "en": "Watch your step while walking on the icy path"
  },
  {
    "id": 1071,
    "fa": "نگران آن وظیفه نباشید، آن را به من بسپارید",
    "en": "Don't worry about that task, leave it to me"
  },
  {
    "id": 1072,
    "fa": "حدس بزن چی شده! برنده لاتاری شدم!",
    "en": "Guess what! I won the lottery!"
  },
  {
    "id": 1073,
    "fa": "بدون شک استعداد من فوق العاده است",
    "en": "My talent is extraordinary without doubt"
  },
  {
    "id": 1074,
    "fa": "دمت گرم برای تکمیل ماراتن",
    "en": "Big up to you for completing the marathon"
  },
  {
    "id": 1075,
    "fa": "با خیال راحت در طول جلسه نظر خود را بگویید",
    "en": "Feel free to speak your mind during the meeting"
  },
  {
    "id": 1076,
    "fa": "صداش رو در نیار ( خاموش باش) تا زمانی که ما آماده باشیم اخبار را به همه اعلام کنیم",
    "en": "Keep it dark until we're ready to announce the news to everyone"
  },
  {
    "id": 1077,
    "fa": "دیشب پلک رو هم نزاشتم",
    "en": "I didn't sleep a wink last night"
  },
  {
    "id": 1078,
    "fa": "حواسم را پرت نکن!",
    "en": "Don't distract me!"
  },
  {
    "id": 1079,
    "fa": "تمام روز به مغزم فشار آوردم سعی کردم به یاد بیاورم که کلیدهایم را کجا گذاشتم",
    "en": "I've been racking my brains all day trying to remember where I put my keys",
    "desc": "\"I have been racking my brains\" is a plural form and suggests that the person has been putting in a lot of mental effort or trying hard to solve a problem or find an answer. It implies that multiple aspects or ideas are being considered.\n\n\"I have been racking my brain\" is a singular form and implies the same idea of putting in mental effort, but it suggests a focus on a single problem or question."
  },
  {
    "id": 1080,
    "fa": "از تو بعیده",
    "en": "It's unlike you"
  },
  {
    "id": 1081,
    "fa": "بیا برای شام بریم بیرون, این دفعه مهمون من",
    "en": "Let's go out for dinner, my treat this time"
  },
  {
    "id": 1082,
    "fa": "این دفتر بسته باقی خواهد ماند تا اطلاع ثانوی به دلیل بازسازی های در حال انجام",
    "en": "This office will remain closed until further notice due to the ongoing renovations"
  },
  {
    "id": 1083,
    "fa": "به رستوران هندی برویم یا (مودبانه) غذاهای چینی را ترجیح می دهید؟ برای من فرقی نمیکنه",
    "en": "Shall we go to the Indian restaurant, or would you prefer Chinese food? I'm easy"
  },
  {
    "id": 1084,
    "fa": "مشتاقم ببینمت",
    "en": "I'm eager to see you"
  },
  {
    "id": 1085,
    "fa": "هر چه باداباد, من تلاش خواهم کرد",
    "en": "Come what may, I will try it"
  },
  {
    "id": 1086,
    "fa": "حتی فرصتش را هم پیدا نکردم بگم بله",
    "en": "I didn't even get to say yes",
    "desc": "\"I didn't even say yes\": This sentence suggests that you had the opportunity to say \"yes,\" but for some reason, you didn't. It implies that you had the chance to respond positively but chose not to or were unable to do so.\n\n\"I didn't even get to say yes\": This sentence conveys that you were not given the opportunity to say \"yes.\" It suggests that the chance to respond affirmatively was denied or taken away from you."
  },
  {
    "id": 1087,
    "fa": "افسر پلیس جزئیات را از روی پلاک ثبت کرد",
    "en": "The police officer recorded the details from the number plate"
  },
  {
    "id": 1088,
    "fa": "شما میتونی (مودبانه) در موردش اشتباه کنی",
    "en": "You could be wrong about it"
  },
  {
    "id": 1089,
    "fa": "اگر آن را به سوپرمارکت بازگردانید دریافت میکنید مثل 25 سنت براش",
    "en": "If you bring it back to the supermarket you get like 25 cents for it"
  },
  {
    "id": 1090,
    "fa": "من پنجشنبه ها کار نمی کنم",
    "en": "I don't work on Thursdays"
  },
  {
    "id": 1091,
    "fa": "شما در فرم عالی هستید! کار سخت شما در ورزشگاه داره نتیجه می ده",
    "en": "You're in great shape! Your hard work at the gym is paying off"
  },
  {
    "id": 1092,
    "fa": "فس فس نکن! نیاز داریم همین الان ترک کنیم اگر میخواهیم به قطار برسیم",
    "en": "Don't dilly-dally! We need to leave now if we want to catch the train"
  },
  {
    "id": 1093,
    "fa": "بیا بریم یه دور بزنیم",
    "en": "Let's go for a spin"
  },
  {
    "id": 1094,
    "fa": "از دست من ناراحتی؟",
    "en": "Are you upset with me?"
  },
  {
    "id": 1095,
    "fa": "رو من حساب نکنید",
    "en": "Count me out"
  },
  {
    "id": 1096,
    "fa": "حتی اگر در حال حاضر همه چیز سخت است، شاد باش و به جلو برو",
    "en": "Even though things are tough right now, cheer up and keep moving forward"
  },
  {
    "id": 1097,
    "fa": "می تونی لطفاً در طول جلسه از من حمایت کنی؟ داشتن حمایت شما عالی خواهد بود",
    "en": "Can you please back me up during the meeting? It would be great to have your support"
  },
  {
    "id": 1098,
    "fa": "روم نمیشه از او (مرد) تقاضای لطفی کنم بعد از اتفاقی که افتاد",
    "en": "I don't have the face to ask him for a favor after what happened"
  },
  {
    "id": 1099,
    "fa": "انجام بده هرچی خوشایندته، این تصمیم توئه که می گیری",
    "en": "Do as you please, it's your decision to make"
  },
  {
    "id": 1100,
    "fa": "این بهانه را به من نده. من می دانم که قادر هستی بهتر انجام بدی",
    "en": "Don't give me that excuse. I know you're capable of doing better"
  },
  {
    "id": 1101,
    "fa": "من تشنمه (خشک شدم). میتونی لطفاً یه لیوان آب برام بگیری؟",
    "en": "I'm parched. Can you please get me a glass of water?",
    "desc": "\"Get me a glass of water\": This phrase implies a request for someone to obtain or fetch a glass of water for you. It suggests that you want the person to take action and bring the water to you.\n\n\"Give me a glass of water\": This phrase indicates a direct request for someone to hand you a glass of water. It implies that you want the person to physically pass the water to you."
  },
  {
    "id": 1102,
    "fa": "به فروشنده مزاحم گفتم بزن به چاک و تنهام بگذار",
    "en": "I told the annoying salesperson to beat it and leave me alone"
  },
  {
    "id": 1103,
    "fa": "نترس! چیزی برای ترس وجود ندارد. همه چیز درست خواهد شد",
    "en": "Don't be scared! There's nothing to fear, everything will be alright"
  },
  {
    "id": 1104,
    "fa": "خوب گفتی! شما آن نظر را شیوا و دقیق بیان کردید",
    "en": "Well said! You expressed that idea eloquently (ˈeləkwəntlē) and accurately"
  },
  {
    "id": 1105,
    "fa": "خیلی به هم میاییم! شخصیت ها و علایق ما به طور عالی با هم هماهنگ هستند",
    "en": "We're a perfect match! Our personalities and interests align perfectly"
  },
  {
    "id": 1106,
    "fa": "صحنه سازی نکن (الم شنگه به پا نکن)! بیایید با آرامش و با احتیاط با این وضعیت برخورد کنیم",
    "en": "Don't make a scene! Let's handle this situation calmly and discreetly"
  },
  {
    "id": 1107,
    "fa": "داشت یادم می رفت! نیاز داریم در راه خانه مقداری مواد غذایی برداریم",
    "en": "I almost forgot! We need to pick up some groceries on the way home"
  },
  {
    "id": 1108,
    "fa": "بهم قول بده",
    "en": "Give me your word"
  },
  {
    "id": 1109,
    "fa": "زدی زیر قولت",
    "en": "You broke your word"
  },
  {
    "id": 1110,
    "fa": "قبل از اینکه تو یک تصمیم بگیری، صبور باش و همه گزینه ها را در نظر بگیر",
    "en": "Before you make a decision, hold your horses and consider all the options"
  },
  {
    "id": 1111,
    "fa": "هر چه می خواهی بردار",
    "en": "Take whatever you want"
  },
  {
    "id": 1112,
    "fa": "بهم بگو چه اشتباهی کردم",
    "en": "Tell me what I did wrong"
  },
  {
    "id": 1113,
    "fa": "نمیدونم دیگه چی بگم",
    "en": "I don't know what else to say"
  },
  {
    "id": 1114,
    "fa": "من با این ناحیه آشنا نیستم",
    "en": "I'm not familiar with this area"
  },
  {
    "id": 1115,
    "fa": "من چیزی بهت بدهکار نیستم",
    "en": "I owe you nothing"
  },
  {
    "id": 1116,
    "fa": "او (زن) نه تنها باهوش است بلکه زیبا هم است",
    "en": "She is not only intelligent but also beautiful"
  },
  {
    "id": 1117,
    "fa": "بایستی راهی وجود داشته باشد",
    "en": "There must be a way"
  },
  {
    "id": 1118,
    "fa": "خوابم برد",
    "en": "I fell asleep"
  },
  {
    "id": 1119,
    "fa": "هر چه زودتر شروع کنی زودتر تمامش خواهی کرد",
    "en": "The sooner you start the sooner you will finish"
  },
  {
    "id": 1120,
    "fa": "او (مرد) تک فرزند هست",
    "en": "He is an only child"
  },
  {
    "id": 1121,
    "fa": "کدام بازیکنان بیشترین عناوین لیگ قهرمانان را بردند؟",
    "en": "Which players have won the most champion league titles?"
  },
  {
    "id": 1122,
    "fa": "ما طبقه بالا هستیم، واحد روبرویی",
    "en": "We're upstairs, the opposite unit"
  },
  {
    "id": 1123,
    "fa": "گریه کردن فایده ای نداره",
    "en": "It's no use crying"
  },
  {
    "id": 1124,
    "fa": "دروغ گفتن فایده ای نداره",
    "en": "It's no use lying"
  },
  {
    "id": 1125,
    "fa": "بحث کردن با او (زن) فایده ای ندارد",
    "en": "It's no use arguing with her"
  },
  {
    "id": 1126,
    "fa": "حرف زدن باهاش (مرد) فایده نداره",
    "en": "It's no use talking to him"
  },
  {
    "id": 1127,
    "fa": "می تونستم سوت را از دور بشنوم",
    "en": "I could hear the whistle from a distance",
    "desc": "In this sentence, the word \"a\" is used before \"distance\" to indicate an indefinite distance. It means that the whistle sound was audible from some unspecified distance away. \"A distance\" is a more natural way to express this idea in English."
  },
  {
    "id": 1128,
    "fa": "برق رفت",
    "en": "The electricity went out"
  },
  {
    "id": 1129,
    "fa": "یک نقص در سیستم وجود داشت",
    "en": "There was a glitch in the system"
  },
  {
    "id": 1130,
    "fa": "نباید مته به خشخاش بزنی, من تمام تلاشم را كرده بودم",
    "en": "You shouldn't nitpick, I had done my best"
  },
  {
    "id": 1131,
    "fa": "بردار هر آنچه را که میتونی بخوری, اما بخور هر آنچه را که میبری",
    "en": "Take all you can eat, but eat all you take"
  },
  {
    "id": 1132,
    "fa": "من هم به تو اعتماد ندارم",
    "en": "I don't trust you either"
  },
  {
    "id": 1133,
    "fa": "من عاشق آتش بازی هستم! برای جشن 2 جولای است",
    "en": "I love fireworks! It's for the 2th of July celebration"
  },
  {
    "id": 1134,
    "fa": "حدس بزن چه کسی دیگه داره جشن می گیره؟",
    "en": "Guess who else is celebrating?"
  },
  {
    "id": 1135,
    "fa": "آیا می توانم چمدانم را در صندوق عقب بگذارم؟",
    "en": "Can I put my luggage in the trunk?"
  },
  {
    "id": 1136,
    "fa": "میتونی کمکم کنی بلندش کنم؟",
    "en": "Can you help me to lift it?"
  },
  {
    "id": 1137,
    "fa": "این گوشت فاسد است",
    "en": "This meat is rancid"
  },
  {
    "id": 1138,
    "fa": "چیزی برای شستن طعم دارید؟",
    "en": "Do you have something to wash down the taste?"
  },
  {
    "id": 1139,
    "fa": "شیر (خوردن) خرابه",
    "en": "This milk is off"
  },
  {
    "id": 1140,
    "fa": "پام خواب رفته",
    "en": "My foot fell asleep"
  },
  {
    "id": 1141,
    "fa": "چگونه می توانم در صورت امکان آن را بچرخانم؟",
    "en": "How can I possibly turn it around?"
  },
  {
    "id": 1142,
    "fa": "من سخت درس خواهم خواند تا به بقیه دانش آموزان برسم",
    "en": "I will study hard to catch up with the rest of the students"
  },
  {
    "id": 1143,
    "fa": "من دارم وانمود می کنم که با کلاس باشم",
    "en": "I'm pretending to be upper class"
  },
  {
    "id": 1144,
    "fa": "بچه ها را حمام کردم و گذاشتم تو تخت",
    "en": "I bathed (/ˈbeɪð/) the children and put them to bed",
    "desc": "\"Put children to bed\" means preparing them for sleep, while \"put children into bed\" means physically placing them in their beds. Use the first phrase for bedtime routines and the second for the act of placing them in bed."
  },
  {
    "id": 1145,
    "fa": "توی وان گرم نشستم و خودم رو اسفنج زدم",
    "en": "I sat in the warm bath (/ˈbæθ/) and sponged myself"
  },
  {
    "id": 1146,
    "fa": "مردم هنگام دویدن سریعتر نفس می کشند",
    "en": "People breathe faster when they run"
  },
  {
    "id": 1147,
    "fa": "من برای هر گونه ناراحتی ناشی از لغو عذرخواهی می کنم",
    "en": "I apologise for any inconvenience caused by the cancellation"
  },
  {
    "id": 1148,
    "fa": "من حتی اسم کوچک شما را هم نمی دانم",
    "en": "I don't even know your first name"
  },
  {
    "id": 1149,
    "fa": "لطفا ببرش آنجا ",
    "en": "Please take it over there"
  },
  {
    "id": 1150,
    "fa": "لطفا بیارش اینجا",
    "en": "Please bring it over here",
    "desc": "\"Please bring it over here\" emphasizes a specific movement towards the speaker or a designated spot, while \"Please bring it here\" generally requests the object to be brought to the speaker's location without specifying a particular direction."
  },
  {
    "id": 1151,
    "fa": "پول خود را برای آن فیلم هدر ندهید. واقعا بد است",
    "en": "Don't waste your money on that movie. It's really bad"
  },
  {
    "id": 1152,
    "fa": "میتونی (مودبانه) به من یادآوری کنید که به خانه زنگ بزنم؟",
    "en": "Could you remind me to call home?"
  },
  {
    "id": 1153,
    "fa": "دانشگاه کتاب درسی را امانت می دهد",
    "en": "The university lends textbook"
  },
  {
    "id": 1154,
    "fa": "من نمی توانم برسونم به رویداد امشب. قابل درکه (منطقی است). شاید دفعه بعد",
    "en": "I can't make it to the event tonight. Fair enough. Maybe next time",
    "desc": "\"I can't get to the event tonight\":\n\nIn this phrase, the emphasis is on the physical act of reaching or arriving at the event. It suggests that there might be some obstacles preventing the speaker from physically attending the event.\n\n\"I can't make it to the event tonight\":\n\nIn this phrase, the emphasis is on the ability or possibility of attending the event. It suggests that the speaker is unable to attend, regardless of the reasons. It could be due to conflicting schedules, prior commitments, or other reasons preventing them from being there."
  },
  {
    "id": 1155,
    "fa": "تمام تلاشم به هدر رفت",
    "en": "All my effort went down the drain"
  },
  {
    "id": 1156,
    "fa": "به پایان رساندن یک ماراتن دستاورد بزرگی است",
    "en": "Finishing a marathon is no mean feat"
  },
  {
    "id": 1157,
    "fa": "شما هرگز نمی دانید چی داره اون زیر میگذره",
    "en": "You never know what is going on underneath"
  },
  {
    "id": 1158,
    "fa": "به آن اجازه نده که شما را بترساند",
    "en": "Don't let that frighten you"
  },
  {
    "id": 1159,
    "fa": "من قصد دارم به گونه ای بهت توضیح بدم که برات درکش آسان تر باشه",
    "en": "I'm gonna explain it to you in a way that makes it much easier for you to understand"
  },
  {
    "id": 1160,
    "fa": "این برای چیزی کم و بیش دائمی است",
    "en": "This is for something more or less permanent"
  },
  {
    "id": 1161,
    "fa": "خورشید از مشرق طلوع و در مغرب غروب می کند",
    "en": "The sun rises in the east and sets in the west"
  },
  {
    "id": 1162,
    "fa": "او (زن) همیشه اتوبوس می گیره",
    "en": "She always takes the bus"
  },
  {
    "id": 1163,
    "fa": "آیا آنها کمک نیاز دارند؟ نه، ندارند",
    "en": "Do they need help? No, the don't"
  },
  {
    "id": 1164,
    "fa": "آنها مرا نادیده گرفتن",
    "en": "They snubbed me"
  },
  {
    "id": 1165,
    "fa": "آیا آنها دارند به جلسه می روند؟ نه، نمی روند",
    "en": "Are they going to the meeting? No, they aren't"
  },
  {
    "id": 1166,
    "fa": "او (زن) جذاب نیست!",
    "en": "Ain't she cute!"
  },
  {
    "id": 1167,
    "fa": "نگاه کن! خورشید داره غروب میکنه",
    "en": "Look! the sun is setting"
  },
  {
    "id": 1168,
    "fa": "قیمتها هر سال افزایش می یابد, اما امسال اونا دارن با سرعت بیشتری نسبت به قبل افزایش می یابند",
    "en": "The prices rise every year, but this year they are rising more rapidly than before"
  },
  {
    "id": 1169,
    "fa": "او (زن) همیشه داره از اتوبوس شکایت میکنه",
    "en": "She is always complaining about the bus"
  },
  {
    "id": 1170,
    "fa": "آنها داشتن شام می خوردند که ما رسیدیم",
    "en": "They were having dinner when we arrived"
  },
  {
    "id": 1171,
    "fa": "داشتم برنامه ریزی میکردم به مامانم زنگ بزنم اما وقت نداشتم",
    "en": "I was planning to call my mom but I didn't have time"
  },
  {
    "id": 1172,
    "fa": "چرا دستمزدها در نیوزیلند پایین است بااینکه هزینه های زندگی بالا است؟",
    "en": "Why are wages in New Zealand low even though the cost of living is high?"
  },
  {
    "id": 1173,
    "fa": "چگونه رهبران خوش بینی را حفظ می کنند وقتی خسته هستند؟",
    "en": "How do leaders maintain optimism when they are tired?"
  },
  {
    "id": 1174,
    "fa": "آیا شما یکی از این کتاب ها را دارید؟",
    "en": "Do you have any of these books?",
    "desc": "So, in most cases, \"any\" is used directly with a singular or uncountable noun, but when used with plural nouns, it requires the addition of \"of\" before the plural noun."
  },
  {
    "id": 1175,
    "fa": "بچه ها به نظر نمی رسید متوجه سرما باشند",
    "en": "Children don't seem to notice the cold"
  },
  {
    "id": 1176,
    "fa": "من شما را تا مترو خواهم رساند",
    "en": "I'll give you a ride to the subway",
    "desc": "If someone mentions driving you to the subway, they are explicitly referring to using their car for transportation. However, if they say they'll give you a ride to the subway, it could involve various modes of transportation, including driving, public transportation, or other means."
  },
  {
    "id": 1177,
    "fa": "وقتی به خانه شما آمدم کمی دسر بیاورم؟",
    "en": "Shall I bring some dessert when I come to your house?"
  },
  {
    "id": 1178,
    "fa": "بیایید فرض کنیم کسی از شما می پرسد",
    "en": "Let's suppose somebody asks you"
  },
  {
    "id": 1179,
    "fa": "من قصد دارم برای امتحانم درس بخوانم و بعد شاید یک شو خواهم دید",
    "en": "I'm gonna study for my exam and then maybe I'll watch a show"
  },
  {
    "id": 1180,
    "fa": "من قبلاً آن کتاب را خوانده ام",
    "en": "I have already read that book"
  },
  {
    "id": 1181,
    "fa": "تیم ما همین الان بازی را برد",
    "en": "Our team has just won the game"
  },
  {
    "id": 1182,
    "fa": "من برای چندین سال از اینجا خرید کرده ام",
    "en": "I have shopped here for many years",
    "desc": "We user present perfect for repetitive action in the past"
  },
  {
    "id": 1183,
    "fa": "شرم بر تو",
    "en": "Shame on you"
  },
  {
    "id": 1184,
    "fa": "چیزی برای بحث نیست",
    "en": "There's nothing to discuss"
  },
  {
    "id": 1185,
    "fa": "به جهنم",
    "en": "To hell with it"
  },
  {
    "id": 1186,
    "fa": "شما می توانی هر چقدر که دوست داری اینجا بمانی",
    "en": "You can stay here as long as you like"
  },
  {
    "id": 1187,
    "fa": "من این را ازت انتظار نداشتم",
    "en": "I didn't expect this from you"
  },
  {
    "id": 1188,
    "fa": "من ازت انتظار بیشتری داشتم",
    "en": "I expected more from you"
  },
  {
    "id": 1189,
    "fa": "به عبارت دیگر ...",
    "en": "In other words ..."
  },
  {
    "id": 1190,
    "fa": "او (مرد) فوت شده",
    "en": "He's passed away"
  },
  {
    "id": 1191,
    "fa": "احساس گناه می کنم",
    "en": "I feel guilty"
  },
  {
    "id": 1192,
    "fa": "خودت قضاوت کن",
    "en": "Judge for yourself"
  },
  {
    "id": 1193,
    "fa": "من در کمد گیر کردم",
    "en": "I'm stuck in the closet"
  },
  {
    "id": 1194,
    "fa": "دیشب یک کابوس داشتم",
    "en": "I had a nightmare last night"
  },
  {
    "id": 1195,
    "fa": "این شخصی است که من در مورد او به شما گفتم",
    "en": "This is the person whom I told you about"
  },
  {
    "id": 1196,
    "fa": "میتونی یه لطفی به من بکنی؟",
    "en": "Can you do me a favor?"
  },
  {
    "id": 1197,
    "fa": "این مدت صبر کردم، کمی بیشتر صبر خواهم کرد",
    "en": "I waited this long, I'll wait a little longer"
  },
  {
    "id": 1198,
    "fa": "تصمیم گرفته ام سیگار را ترک کنم",
    "en": "I have decided to stop smoking"
  },
  {
    "id": 1199,
    "fa": "این نباید اتفاق می افتاد",
    "en": "This should not have happened"
  },
  {
    "id": 1200,
    "fa": "برای همین اینجایی؟",
    "en": "Is this why you are here?"
  },
  {
    "id": 1201,
    "fa": "این کتاب ارزش خواندن دارد",
    "en": "This book is worth reading"
  },
  {
    "id": 1202,
    "fa": "شارژر داری؟ شارژ گوشیم داره تمام میشه",
    "en": "Do you have a charger? My phone is dying"
  },
  {
    "id": 1203,
    "fa": "شارژ گوشیم تمام شد",
    "en": "My phone is dead"
  },
  {
    "id": 1204,
    "fa": "میتوانی کلیدها را به من پرتاب کنی؟",
    "en": "Can you chuck me the keys?"
  },
  {
    "id": 1205,
    "fa": "شما یک قدم با دیده شدن فاصله دارید",
    "en": "You're one step away from being visible"
  },
  {
    "id": 1206,
    "fa": "قرارداد شامل یک شرط برای پرداختن اضافه کاری بود",
    "en": "The contract included a provision for overtime pay"
  },
  {
    "id": 1207,
    "fa": "اطمینان حاصل کنید که همه همکاران کم و بیش از یک سطح دانش برخوردار هستند",
    "en": "Ensure that all colleagues have more or less the same level of knowledge"
  },
  {
    "id": 1208,
    "fa": "آیا دوست دارید (مودبانه) مقداری مواد اضافی روی پیتزای خود؟",
    "en": "Would you like some extra ingredients on your pizza?"
  },
  {
    "id": 1209,
    "fa": "آیا می توانم نقدی پرداخت کنم؟",
    "en": "Can I pay cash?"
  },
  {
    "id": 1210,
    "fa": "آیا این برای بیرون بردنه؟",
    "en": "Is this for takeout?"
  },
  {
    "id": 1211,
    "fa": "راننده آنجا خواهد بود در حدود 40 دقیقه دیگر",
    "en": "The driver will be there in about 40 minutes"
  },
  {
    "id": 1212,
    "fa": "من عاشق دکور هستم، شیک و سنتی است",
    "en": "I love the decor, it's elegant and traditional"
  },
  {
    "id": 1213,
    "fa": "آیا غذاهای مورد علاقه ای دارید توصیه کنید؟",
    "en": "Do you have any favorite dishes you would recommend?"
  },
  {
    "id": 1214,
    "fa": "سفارش شما تا دقایقی دیگر سرو خواهد شد",
    "en": "Your order will be served in a few minutes"
  },
  {
    "id": 1215,
    "fa": "من خیلی وقته موهام رو کوتاه نکردم",
    "en": "I'm way overdue for a haircut",
    "desc": "The person has not had a haircut for a long time and it is now overdue or past the appropriate time for them to have gotten one."
  },
  {
    "id": 1216,
    "fa": "میتونی لطفاً به من بگید حق عضویت این باشگاه چقدره؟",
    "en": "Can you please tell me how much the membership fee at this gym is?"
  },
  {
    "id": 1217,
    "fa": "ساعات کاری (ساعتهای که باز هستید) شما چیست؟",
    "en": "What are your opening hours?"
  },
  {
    "id": 1218,
    "fa": "امروز برای این تمرین خیلی مشتاقم",
    "en": "I'm so pumped for this workout today"
  },
  {
    "id": 1219,
    "fa": "من هنوز از آخرین تمرینمان درد دارم",
    "en": "I'm still sore from our last workout"
  },
  {
    "id": 1220,
    "fa": "اگر شروع به خوردن غذای سالم کنید، تعجب خواهید کرد که چقدر آسان است که وزن کم کنید",
    "en": "If you start eating healthy food, you will be surprised how easy it is to lose weight"
  },
  {
    "id": 1221,
    "fa": "آن دسته گل جداً تک به نظر می رسد",
    "en": "That bouquet looks indeed unique"
  },
  {
    "id": 1222,
    "fa": "من گلدان را در یک جعبه محکم برای شما قرار خواهم داد تا بتوانید آن را به سلامت به خانه برسانید",
    "en": "I'll put the vase in a sturdy box for you so you can get it home safely"
  },
  {
    "id": 1223,
    "fa": "واقعا اتاق را روشن می کند",
    "en": "It really brightens up the room"
  },
  {
    "id": 1224,
    "fa": "من برش خواهم داشت",
    "en": "I'll take it"
  },
  {
    "id": 1225,
    "fa": "آیا مدرکی دال بر اقامت دارید؟ گواهینامه رانندگی یا چیزی نشان دهد که شما در این شهر زندگی می کنید",
    "en": "Do you have proof of residence? A driver's license or something showing that you live in this city",
    "desc": "In North American English, \"Driver's license\" is the more common term and refers to the official document issued by the government that allows an individual to operate a motor vehicle. The possessive form \"Driver's\" indicates that it belongs to the driver.\n\nIn British English and many other English-speaking countries, \"Driving license\" is the more commonly used term. It refers to the same document, but without the possessive form \"Driver's\"."
  },
  {
    "id": 1226,
    "fa": "(شما آماده هستید) همه چیز مرتب است",
    "en": "You're all set"
  },
  {
    "id": 1227,
    "fa": "سازش بخش اجتناب ناپذیری از ازدواج است",
    "en": "Compromise is an inevitable part of marriage"
  },
  {
    "id": 1228,
    "fa": "من داشتم میمردم که این مکان را امتحان کنم",
    "en": "I've been dying to try this place"
  },
  {
    "id": 1229,
    "fa": "نمی توانم ذهنم را درست کنم (نمی توانم تصمیم بگیرم)",
    "en": "I can't make up my mind"
  },
  {
    "id": 1230,
    "fa": "چطور بودی؟",
    "en": "How have you been?"
  },
  {
    "id": 1231,
    "fa": "حدود دو هفته شده و می خوام بدونم چقدر طول خواهد کشید برای من تا ماشینم را بگیرم",
    "en": "It has been around two weeks and I want to know how long it will take for me to get my car"
  },
  {
    "id": 1232,
    "fa": "کدام حیوان کشنده تر است؟",
    "en": "Which animal is deadlier?"
  },
  {
    "id": 1233,
    "fa": "بستن کمربند ایمنی در بسیاری از کشورها اجباری است",
    "en": "Wearing a seatbelt is compulsory in many countries"
  },
  {
    "id": 1234,
    "fa": "من به او (زن) یک تعریف صادقانه درباره مهارت های پخت و پزش دادم",
    "en": "I gave her a sincere compliment on her cooking skills"
  },
  {
    "id": 1235,
    "fa": "آیا شما علی اتفاقی هستید؟",
    "en": "Are you Ali by any chance?"
  },
  {
    "id": 1236,
    "fa": "فکر می کنم لهجه ام مرا لو داده",
    "en": "I think my accent gave me away"
  },
  {
    "id": 1237,
    "fa": "خوش آمدید",
    "en": "Welcome aboard"
  },
  {
    "id": 1238,
    "fa": "اول اولین بارم است اینجا",
    "en": "It is my very first time here"
  },
  {
    "id": 1239,
    "fa": "من 2 روز پیش تهران رسیدم",
    "en": "I got into Tehran 2 days ago"
  },
  {
    "id": 1240,
    "fa": "چی فکر می کنی در موردش تا الان؟",
    "en": "What do you think about it so far?"
  },
  {
    "id": 1241,
    "fa": "من جنب و جوش اینجا را دوست دارم. واقعا پر انرژی است",
    "en": "I like the vibe here. It's really energetic (/ˌenərˈdʒetɪk/)"
  },
  {
    "id": 1242,
    "fa": "من واقعاً احساس خوشبختی می کنم برای اینجا بودن",
    "en": "I feel really blessed to be here"
  },
  {
    "id": 1243,
    "fa": "مونیخ به نظر می رسه شهری ایده آل برای قدم زدن طولانی",
    "en": "Munich seems to be the ideal city for long strolls"
  },
  {
    "id": 1244,
    "fa": "این جریان مداوم انرژی کاملاً هیجان انگیز است",
    "en": "This continuous flow of energy is quite thrilling"
  },
  {
    "id": 1245,
    "fa": "شما نیاز داری خیلی منظم باشی",
    "en": "You need to be very disciplined"
  },
  {
    "id": 1246,
    "fa": "او (مرد) اصرار داشت که ما شما را با همه تجهیزات پیشرفته تجهیز کنیم",
    "en": "He insisted that we set you up with all state-of-the-art equipments"
  },
  {
    "id": 1247,
    "fa": "می توانید کمی در مورد زمان بندیت به من بگی؟",
    "en": "Can you tell me a little about your schedule?"
  },
  {
    "id": 1248,
    "fa": "به غیر از آن، چگونه سازماندهی می کنی زمانت رو به خودت بستگی داره",
    "en": "Other than that, how you organize your time is up to you"
  },
  {
    "id": 1249,
    "fa": "ما یک فرصتی بدست خواهیم آورد برای آشنایی بهتر با یکدیگر ",
    "en": "We'll get a chance to get better acquainted with each other"
  },
  {
    "id": 1250,
    "fa": "سرویس بهداشتی در پشت راهرو در سمت چپ است",
    "en": "The restroom is at the back of the hallway on the left side "
  },
  {
    "id": 1251,
    "fa": "شما نامرتب به نظر میرسی",
    "en": "You look out of sorts"
  },
  {
    "id": 1252,
    "fa": "آیا برای رو فرم بودن کاری انجام می دی؟",
    "en": "Do you do anything to keep fit?"
  },
  {
    "id": 1253,
    "fa": "دوچرخه سواری در تمام خیابان های اصلی و محلی در سراسر شهر مجاز است",
    "en": "Bicycling is permitted on all main and local streets throughout the city"
  },
  {
    "id": 1254,
    "fa": "خیلی قشنگه در اوایل صبح. چرا با من نمی آیی؟",
    "en": "It's so beautiful early in the morning. Why don't you come with me?"
  },
  {
    "id": 1255,
    "fa": "یکی آن طرف خیابان است",
    "en": "There's one across the street"
  },
  {
    "id": 1256,
    "fa": "فردا صبح به مکان شما سر خواهم زد",
    "en": "I'll come by your place tomorrow morning",
    "desc": "Come by often implies making a brief visit or stopping by a place temporarily"
  },
  {
    "id": 1257,
    "fa": "میتونیم کمی بعد بسازیمش؟",
    "en": "Can we make it a bit later?"
  },
  {
    "id": 1258,
    "fa": "آیا این کفش ها را در 45 دارید؟ بله بفرمایید. آیا می خواهید آنها را امتحان کنید؟",
    "en": "Do you have these shoes in 45? Yes, Here you are. Do you wanna try them on?"
  },
  {
    "id": 1259,
    "fa": "من نمی خواهم پول را پس بدهم. من این جفت (کفش) را خواهم برد",
    "en": "I don't wanna refund. I'll take this pair"
  },
  {
    "id": 1260,
    "fa": "همه چیز چطور داره پیش می ره؟",
    "en": "How is everything going?"
  },
  {
    "id": 1261,
    "fa": "خوشحالی که اومدی؟",
    "en": "Are you happy you came?"
  },
  {
    "id": 1262,
    "fa": "من از اینکه تمام مدت بیرون غذا بخورم کمی خسته ام",
    "en": "I am a bit tired of eating out all the time"
  },
  {
    "id": 1263,
    "fa": "چرا بعد از کار به مکان من نمیای؟",
    "en": "Why don't you come over to my place after work?",
    "desc": "Come over specifically emphasizes moving to the location where the speaker is"
  },
  {
    "id": 1264,
    "fa": "من آشپز خیلی خوبی هستم",
    "en": "I'm a very good cook"
  },
  {
    "id": 1265,
    "fa": "شاید دارم مبتلا به آنفولانزا یا چیز دیگری می شم",
    "en": "I might be coming down with a flu or something"
  },
  {
    "id": 1266,
    "fa": "آیا یک داروخانه در نزدیکی وجود دارد؟",
    "en": "Is there a pharmacy nearby?"
  },
  {
    "id": 1267,
    "fa": "آیا تب داری؟",
    "en": "Do you have a fever?"
  },
  {
    "id": 1268,
    "fa": "آیا به هر دارویی آلرژیک هستید؟",
    "en": "Are you allergic to any drugs?"
  },
  {
    "id": 1269,
    "fa": "این ایبوپروفن است. باعث خواهد شد شما احساس بهتری کنی",
    "en": "This is ibuprofen (ˌībyo͞oˈprōfən). It'll make you feel better"
  },
  {
    "id": 1270,
    "fa": "چندتا باید بگیرم؟",
    "en": "How many do I have to take?"
  },
  {
    "id": 1271,
    "fa": "تا به حال چه تفاوت هایی را متوجه شده اید؟",
    "en": "What differences have you been noticed so far?"
  },
  {
    "id": 1272,
    "fa": "تقریباً تمام است",
    "en": "It's almost finished"
  },
  {
    "id": 1273,
    "fa": "خیلی مناسب است",
    "en": "It is so convenient"
  },
  {
    "id": 1274,
    "fa": "من بیرون برای آبجو دعوت شدم",
    "en": "I got invited out for beer"
  },
  {
    "id": 1275,
    "fa": "من عاشق در اطراف طبیعت بودن هستم. صداهای آرامش بخش و هوای تازه همیشه مرا جوان می کند",
    "en": "I love to be around nature. the soothing sounds and fresh air always rejuvenate me"
  },
  {
    "id": 1276,
    "fa": "به اعصابت مسلط باش و متمرکز بمان",
    "en": "Get a grip and stay focused"
  },
  {
    "id": 1277,
    "fa": "اگر هرچیز مهمی در جلسه مطرح شد، بعداً به شما دربارش خواهم گفت",
    "en": "If anything important comes up during the meeting, I'll tell you about it later"
  },
  {
    "id": 1278,
    "fa": "من در یک خانواده نظامی بزرگ شدم",
    "en": "I grew up in a military family"
  },
  {
    "id": 1279,
    "fa": "چه کوفتیه, چرا قطار داره به این سمت می ره؟ باید برعکس می رفت",
    "en": "What the fuck, why train is going this way? It should have gone the other way around"
  },
  {
    "id": 1280,
    "fa": "او (زن) دوست دارد در زمان آزادش چه کار کند؟",
    "en": "What does she like to do in her free time?",
    "desc": "\"What does it like?\": This phrase is not grammatically correct. However, if we modify it slightly to \"What does it like?\" it could be interpreted as asking about the preferences or tastes of something."
  },
  {
    "id": 1281,
    "fa": "من تقریباً تمام کردم",
    "en": "I'm almost done"
  },
  {
    "id": 1282,
    "fa": "عالی بود ببینی چقدر همه فعال بودند",
    "en": "It was great to see how active everyone was"
  },
  {
    "id": 1283,
    "fa": "ما آن را به دل گرفتیم و به راه حل های مناسب فکر کردیم",
    "en": "We took it to heart and thought about appropriate solutions",
    "desc": "\n\"Take it to heart\" is an idiomatic expression that means to take something very seriously or personally, often with strong emotional impact"
  },
  {
    "id": 1284,
    "fa": "غیر آلمانی های عزیز، چرا آلمان را به جای آمریکا برای گرفتن شغل انتخاب کردید با وجود داشتن حقوق به مراتب کمتر؟",
    "en": "Dear non-Germans, why did you choose Germany over the US to get a job despite having a far lower salary?"
  },
  {
    "id": 1285,
    "fa": "آیا می دانید اقیانوس در شب چقدر تاریک می شود؟",
    "en": "Do you know how dark ocean gets at night?"
  },
  {
    "id": 1286,
    "fa": "شما در حال حاضر دسترسی داری",
    "en": "You already have access"
  },
  {
    "id": 1287,
    "fa": "آیا می توانم سوالات را بپرسم(شلیک کنم)؟",
    "en": "Can I shoot questions?"
  },
  {
    "id": 1288,
    "fa": "یه لحظه صبر کن",
    "en": "Wait a moment"
  },
  {
    "id": 1289,
    "fa": "چند وقته می خواستم بهت زنگ بزنم",
    "en": "I've been meaning to call you"
  },
  {
    "id": 1290,
    "fa": "وضعیت چطوره؟",
    "en": "What's the situation like?"
  },
  {
    "id": 1291,
    "fa": "بزار ببینم",
    "en": "Let me see"
  },
  {
    "id": 1292,
    "fa": "مطمئن شو آدرس و مشروعیت هر گیرنده را چک کنی",
    "en": "Make sure to check the address and legitimacy of any recipient"
  },
  {
    "id": 1293,
    "fa": "کدام یک از ما واقعی است؟",
    "en": "Which one of us is real?"
  },
  {
    "id": 1294,
    "fa": "چه طبقه ای زندگی می کنید؟",
    "en": "What floor do you live on?"
  },
  {
    "id": 1295,
    "fa": "می توانید آن شانس را بگیری",
    "en": "You can take that chance"
  },
  {
    "id": 1296,
    "fa": "نمیتونم به دویدن ادامه بدم",
    "en": "I can't keep running"
  },
  {
    "id": 1297,
    "fa": "شوهرت داره چیکار میکنه؟ داره گیتار میزنه",
    "en": "What's your husband doing? He's playing the guitar"
  },
  {
    "id": 1298,
    "fa": "دوست دارم (مودبانه) او (مرد) را معرفی کنم",
    "en": "I'd like to introduce him"
  },
  {
    "id": 1299,
    "fa": "هوا چطوره؟ آفتابی است",
    "en": "What's the weather like? It's sunny"
  },
  {
    "id": 1300,
    "fa": "پیش بینی آب و هوا چیست؟ داره میره برای یک طوفان گرد و غبار",
    "en": "What's the weather forecast? There's going to be a dust storm"
  },
  {
    "id": 1301,
    "fa": "چند بار در هفته ورزش می کنید؟",
    "en": "How many times a week do you exercise?"
  },
  {
    "id": 1302,
    "fa": "دماسنج نشان داد افت دما را هنگام صبح تار (غبارآلود)",
    "en": "The thermometer showed a drop in temperature during the hazy morning"
  },
  {
    "id": 1303,
    "fa": "صبح مه آلود به روزی گرم و مرطوب با نم نم باران تبدیل شد",
    "en": "The foggy morning turned into a muggy day with a drizzle of rain"
  },
  {
    "id": 1304,
    "fa": "در طول زمستان, ما تجربه کردیم یک طوفان برف شدید همراه با تگرگ و برفک",
    "en": "During the winter, we experienced a severe snowstorm with hail and sleet"
  },
  {
    "id": 1305,
    "fa": "در طول طوفان گرد و غبار، رعد و برق در همان حوالی اصابت کرد",
    "en": "During the dust storm, lightning struck nearby"
  },
  {
    "id": 1306,
    "fa": "آیا این اولین سفر شما به کشورمان است؟",
    "en": "Is this your first trip to our country?"
  },
  {
    "id": 1307,
    "fa": "یک پنی چقدر می ارزد؟",
    "en": "How much is a penny worth?"
  },
  {
    "id": 1308,
    "fa": "میتونی (مودبانه) مقداری پول خرد به من بدی؟",
    "en": "Could you give me some change?"
  },
  {
    "id": 1309,
    "fa": "من می خواهم یک تماس تلفنی راه دور بگیرم",
    "en": "I wanna make a long-distance phone call"
  },
  {
    "id": 1310,
    "fa": "چه ماهی است؟",
    "en": "What month is it?"
  },
  {
    "id": 1311,
    "fa": "آخر هفته گذشته چه کار کردی؟ رفتم مسافرت",
    "en": "What did you do last weekend? I went on a trip"
  },
  {
    "id": 1312,
    "fa": "وای نه! چیزی گفتی که قرار نبود بگی",
    "en": "Oh no! You said something that you were not supposed to say"
  },
  {
    "id": 1313,
    "fa": "هی, تازه رسیدم اینجا. می توانید مرا در جریان بزارید در رابطه با آنچه که اتفاق افتاد زمانیکه من دور بودم؟",
    "en": "Hey, I just got here. Can you fill me in on what happened while I was away?"
  },
  {
    "id": 1314,
    "fa": "شما قهوه را با خامه اضافی سفارش دادید,  بفرمائید، خدمت شما!",
    "en": "You ordered the coffee with extra cream, here you go"
  },
  {
    "id": 1315,
    "fa": "من یک فرصت را داشتم که در کنفرانس با مدیرعامل صحبت کنم",
    "en": "I had a chance to speak with the CEO at the conference (/ˈkɑːnfərəns/)",
    "desc": " \"Speak to\" implies a one-sided communication directed towards someone, while \"Speak with\" indicates a two-way conversation with mutual participation and interaction between the parties. \n In general, \"speak\" is more formal and can refer to the act of communicating in any context, while \"talk\" is more casual and often implies a conversation or informal exchange of informatio"
  },
  {
    "id": 1316,
    "fa": "این صدای اگزوز ماشینم است وقتی داخل تونل دنده معکوس میدم",
    "en": "This is the sound of my car's exhaust when I downshift in a tunnel"
  },
  {
    "id": 1317,
    "fa": "این قدر پررو نباش",
    "en": "Don't be so cheeky"
  },
  {
    "id": 1318,
    "fa": "من منتظرم که سوار دوچرخه ام شم (بپرم روش)",
    "en": "I'm looking forward to hopping on my bike"
  },
  {
    "id": 1319,
    "fa": "بعد از رویداد، می توانید باقی مانده کیک را به سلامت به خانه ببرید",
    "en": "After the event, you can take the leftover cake home safely"
  },
  {
    "id": 1320,
    "fa": "من اغلب در روزهای بارانی افسرده می شوم",
    "en": "I often get depressed on rainy days"
  },
  {
    "id": 1321,
    "fa": "من اونو (مرد) از 2010 می شناسم",
    "en": "I've known him since 2010"
  },
  {
    "id": 1322,
    "fa": "چی قصد داری بهشون بگی؟",
    "en": "What are you gonna tell them?"
  },
  {
    "id": 1323,
    "fa": "من عواقب آن را می پذیرم",
    "en": "I accept the consequences"
  },
  {
    "id": 1324,
    "fa": "مراقب باش",
    "en": "Take care"
  },
  {
    "id": 1325,
    "fa": "من می توانم به شما اطمینان دهم آن اتفاق نخواهد افتاد",
    "en": "I can assure you that will not happen"
  },
  {
    "id": 1326,
    "fa": "من هنوز کارم را اینجا تمام نکردم",
    "en": "I haven't finished my work here"
  },
  {
    "id": 1327,
    "fa": "داری به من تهمت می زنی؟",
    "en": "Are you accusing me?"
  },
  {
    "id": 1328,
    "fa": "وقتی بزرگ شدی میخواهی چی بشی؟",
    "en": "What do you want to be when you grow up?"
  },
  {
    "id": 1329,
    "fa": "من برای تو اینجا آمدم",
    "en": "I've come here for you"
  },
  {
    "id": 1330,
    "fa": "میدونستم برخواهی گشت",
    "en": "I knew you would come back"
  },
  {
    "id": 1331,
    "fa": "بزار شفاف باشم",
    "en": "Let me be clear"
  },
  {
    "id": 1332,
    "fa": "این ویدیو را تا آخر ببینید",
    "en": "Watch this video till the end"
  },
  {
    "id": 1333,
    "fa": "دارم دیونه میشم",
    "en": "I'm going crazy"
  },
  {
    "id": 1334,
    "fa": "می دونستم اینجوری میشه",
    "en": "I saw this coming"
  },
  {
    "id": 1335,
    "fa": "چگونه این اتفاق افتاد؟",
    "en": "How did this happen?"
  },
  {
    "id": 1336,
    "fa": "چه چیزی مهمتر از پول است؟",
    "en": "What is more important than money?"
  },
  {
    "id": 1337,
    "fa": "اونجا برام یه کار جور کن",
    "en": "Get me a job there"
  },
  {
    "id": 1338,
    "fa": "بذار ببینم چیکار میتونم بکنم",
    "en": "Let me see what I can do"
  },
  {
    "id": 1339,
    "fa": "گوش های خود را بپوشانید",
    "en": "Cover your ears"
  },
  {
    "id": 1340,
    "fa": "قول میدم ناامیدت نخواهم کرد",
    "en": "I promise I won't disappoint you"
  },
  {
    "id": 1341,
    "fa": "بگیرش",
    "en": "Take it"
  },
  {
    "id": 1342,
    "fa": "بوی بدی می ده، نمیده",
    "en": "It smells bad, doesn't it"
  },
  {
    "id": 1343,
    "fa": "تقصیر ما بود",
    "en": "It was our fault"
  },
  {
    "id": 1344,
    "fa": "با اینکه گم شده بودم، به نوعی, راه برگشت به خانه را پیدا کردم",
    "en": "Even though I was lost, somehow, I found my way back home"
  },
  {
    "id": 1345,
    "fa": "می دانم که آنها می گویند پول خوشبختی نمی آورد. اما اگر پول داشتم خوشحال می شدم",
    "en": "I know that they say money doesn't bring happiness. But if I had money I would be happy"
  },
  {
    "id": 1346,
    "fa": "اصلاً شد سوشی بخوری زمانیکه در فرانسه بودی؟",
    "en": "Did you ever eat sushi while you were in France?"
  },
  {
    "id": 1347,
    "fa": "به ما اجازه نده عجلت بندازیم",
    "en": "Don't let us rush you"
  },
  {
    "id": 1348,
    "fa": "تعمیر قفسه شکسته امکان پذیر است",
    "en": "Fixing the broken shelf is doable"
  },
  {
    "id": 1349,
    "fa": "او (مرد) تصمیم گرفت با قاطعیت وظیفه دشوار را رسیدگی کند",
    "en": "He decided to tackle the difficult task with determination"
  },
  {
    "id": 1350,
    "fa": "من از آن آگاه هستم",
    "en": "I'm aware of it"
  },
  {
    "id": 1351,
    "fa": "کی دوباره هوا سرد میشه؟",
    "en": "When does the weather get cold again?"
  },
  {
    "id": 1352,
    "fa": "آنها به طور آزمایشی موافقت کردند هفته آینده برای قهوه با هم ملاقات کنند",
    "en": "They tentatively agreed to meet up for coffee next week"
  },
  {
    "id": 1353,
    "fa": "او (زن) به نوعی همیشه در دسترس است",
    "en": "She is somehow always available"
  },
  {
    "id": 1354,
    "fa": "هدف کلی این پروژه هست بهبود دادن تمرین های پایداری در درون شرکت",
    "en": "The overarching goal of this project is to improve sustainability practices within the company"
  },
  {
    "id": 1355,
    "fa": "قطع برق باعث یک اضافه بار در ژنراتور پشتیبان شد",
    "en": "The power outage caused an overload on the backup generator"
  },
  {
    "id": 1356,
    "fa": "شده با یک آقای بری بیرون؟",
    "en": "Did you ever go out with a guy?"
  },
  {
    "id": 1357,
    "fa": "من یک فنجان قهوه می خواهم",
    "en": "I wanna cup of coffee",
    "desc": "I want a cup of coffee"
  },
  {
    "id": 1358,
    "fa": "هر کسی را که می شناسم دارن یا ازدواج می کنند یا ترفیع می گیرند",
    "en": "Everyone I know is either getting married or getting promoted"
  },
  {
    "id": 1359,
    "fa": "من به شما علاقه ای ندارم, من حواسم بهت هست",
    "en": "I'm not into you, I'm onto you"
  },
  {
    "id": 1360,
    "fa": "با لباس زیرم نمیتونم بخوابم. خوب، تو مجبوری",
    "en": "I can't sleep in my underwear. Well, your gonna"
  },
  {
    "id": 1361,
    "fa": "من یبوست دارم",
    "en": "I'm constipated"
  },
  {
    "id": 1362,
    "fa": "چرا نمی توانی همه اینها را در یک پیام تایپ کنید؟",
    "en": "Why can't you type all this in one message?"
  },
  {
    "id": 1363,
    "fa": "فکر میکنی امکان داشته باشد اگر من ۱۰۰ $ از حقوقم رو جلوتر بگیرم",
    "en": "Do you think it would be possible if I got 100$ advance on my salary?"
  },
  {
    "id": 1364,
    "fa": "آتش در جنگل پیشروی کرد",
    "en": "The fire advanced through the forest"
  },
  {
    "id": 1365,
    "fa": "چی میشه اگر یکی از ما بخواد اسباب کشی کنی؟",
    "en": "What if one of us wants to move out?"
  },
  {
    "id": 1366,
    "fa": "تو به من میگفتی اگر داشتی خارج میشدی",
    "en": "You'd tell me if you were moving out"
  },
  {
    "id": 1367,
    "fa": "وحشت نکن",
    "en": "Don't panic"
  },
  {
    "id": 1368,
    "fa": "او (زن) منو غافلگیرم کرد اما یک شکست کامل نبود",
    "en": "She took me by surprise but it wasn't a total loss"
  },
  {
    "id": 1369,
    "fa": "بسیاری از مردم ازدواج شاد داشتند اما در نهایت طلاق گرفتند",
    "en": "A lot of people had a happy marriage but they ended up getting divorced"
  },
  {
    "id": 1370,
    "fa": "من نباید اون کیک رو میخوردم",
    "en": "I shouldn't have eaten that cake"
  },
  {
    "id": 1371,
    "fa": "من برای محافظت از فرش خودروم یک کفپوش جدید ماشین خریدم",
    "en": "I bought a new car floor mats to protect the carpet in my vehicle"
  },
  {
    "id": 1372,
    "fa": "من یک روکش صندلی جدید ماشین خریدم تا محافظت کنم از صندلی های چرمی خود از ریختنی ها و لکه ها",
    "en": "I bought a new car seat cover to protect my leather seats from spills and stains"
  },
  {
    "id": 1373,
    "fa": "من امروز قراره از خانه کار کنم، بچه ام حالش خوب نیست و در خانه خواهد ماند",
    "en": "I'll be working from home today, my kid doesn't feel well and will stay home"
  },
  {
    "id": 1374,
    "fa": "چند روز پیش، کتابی که به دنبال آن بودم رو پیدا کردم",
    "en": "The other day, I found a book I had been searching for"
  },
  {
    "id": 1375,
    "fa": "لطفاً تسلیت مرا بپذیر",
    "en": "Please accept my condolences (/kənˈdoʊləns/)"
  },
  {
    "id": 1376,
    "fa": "هنوز بیداری؟",
    "en": "Are you still up?"
  },
  {
    "id": 1377,
    "fa": "خوابم میاد",
    "en": "I feel sleepy"
  },
  {
    "id": 1378,
    "fa": "چقدر احتمال برای انتخاب مجدد او (مرد) وجود دارد؟",
    "en": "What are the odds on him being re-elected?"
  },
  {
    "id": 1379,
    "fa": "بعید است که آنها به موقع خواهند رسید",
    "en": "It's unlikely that they'll arrive on time"
  },
  {
    "id": 1380,
    "fa": "او بعید است (مرد) قبل از زمان ناهار برسد",
    "en": "He's unlikely to arrive before lunchtime"
  },
  {
    "id": 1381,
    "fa": "سر من فریاد نزن",
    "en": "Don't yell at me"
  },
  {
    "id": 1382,
    "fa": "منو نپیچون",
    "en": "Don't ditch me"
  },
  {
    "id": 1383,
    "fa": "من عرق کردم",
    "en": "I'm sweaty"
  },
  {
    "id": 1384,
    "fa": "بهم بی احترامی نکن",
    "en": "Don't diss me"
  },
  {
    "id": 1385,
    "fa": "من تا گردنم تو کار هستم",
    "en": "I'm up to my neck in work"
  },
  {
    "id": 1386,
    "fa": "من پایه ام",
    "en": "I'm game"
  },
  {
    "id": 1387,
    "fa": "بذار کمکت کنم",
    "en": "Let me give you a hand"
  },
  {
    "id": 1388,
    "fa": "از من دلخوری؟",
    "en": "Are you cross with me?"
  },
  {
    "id": 1389,
    "fa": "شما خوشگل به نظر می رسی",
    "en": "You look gorgeous"
  },
  {
    "id": 1390,
    "fa": "ادبت کجاست؟",
    "en": "Where are your manners?"
  },
  {
    "id": 1391,
    "fa": "درست رفتار کن",
    "en": "Behave yourself"
  },
  {
    "id": 1392,
    "fa": "مناسب سنت عمل کن",
    "en": "Act your age"
  },
  {
    "id": 1393,
    "fa": "عطر میزنی؟",
    "en": "Are you wearing perfume?"
  },
  {
    "id": 1394,
    "fa": "من زیر سرم بودم",
    "en": "I was on a drip"
  },
  {
    "id": 1395,
    "fa": "قوز نکن, صاف بشین",
    "en": "Don't slouch, sit up straight"
  },
  {
    "id": 1396,
    "fa": "موهام داره میریزه",
    "en": "My hair is falling out",
    "desc": "In English, when referring to the strands of hair on your head collectively, we use \"hair\" as an uncountable noun. Therefore, it does not take the plural form \"hairs.\""
  },
  {
    "id": 1397,
    "fa": "من دارم کچل میشم",
    "en": "I'm going bald"
  },
  {
    "id": 1398,
    "fa": "بینیم گرفته",
    "en": "My nose is blocked up"
  },
  {
    "id": 1399,
    "fa": "بیرون اونجا خیلی سرد است، من دارم می لرزم",
    "en": "It's so cold out there, I'm shivering"
  },
  {
    "id": 1400,
    "fa": "هر روز تا کی کار می کنی؟",
    "en": "How late do you work everyday?"
  },
  {
    "id": 1401,
    "fa": "گاهی اوقات چیزها آنطور که فکر می کردید پیش نمی رود",
    "en": "Sometimes things don't work out the way you thought they would"
  },
  {
    "id": 1402,
    "fa": "به کی شکایت کردی؟",
    "en": "To whom did you complain?"
  },
  {
    "id": 1403,
    "fa": "با تمام مرورها مثبت، غذای آن رستوران باید (با تاکید) واقعاً خوب باشد",
    "en": "With all the positive reviews, that restaurant's food has got to be really good",
    "desc": "The use of \"got to be\" conveys a sense of confidence and assurance, suggesting that there is no doubt about the quality or goodness of the thing in question"
  },
  {
    "id": 1404,
    "fa": "می تونیم از نو شروع کنیم؟",
    "en": "Can we start over?"
  },
  {
    "id": 1405,
    "fa": "امشب دارم میبرمش (زن) بیرون",
    "en": "I'm taking her out tonight"
  },
  {
    "id": 1406,
    "fa": "من کلاً قیدش (زن) رو زدم",
    "en": "I'm totally over her"
  },
  {
    "id": 1407,
    "fa": "صدات رو بیار پایین",
    "en": "Lower your voice"
  },
  {
    "id": 1408,
    "fa": "اشتباهت چه بود؟",
    "en": "What was your mistake?"
  },
  {
    "id": 1409,
    "fa": "من هنوز زندگیم را مدیونت هستم",
    "en": "I still owe you my life"
  },
  {
    "id": 1410,
    "fa": "ما باید این را خیلی جدی بگیریم",
    "en": "We should take this very seriously"
  },
  {
    "id": 1411,
    "fa": "به نظر شما چه کسی امروز بازی را خواهد برد؟",
    "en": "Who do you think will win the match today?"
  },
  {
    "id": 1412,
    "fa": "من هیچ دردسری نمی خواهم",
    "en": "I don't want any trouble"
  },
  {
    "id": 1413,
    "fa": "با چشمان خودم دیدمش",
    "en": "I saw it with my own eyes"
  },
  {
    "id": 1414,
    "fa": "به کار خوب ادامه بده",
    "en": "Keep up the good work"
  },
  {
    "id": 1415,
    "fa": "چرا مدام این سوال را از من می پرسی؟",
    "en": "Why do you keep asking me this question?"
  },
  {
    "id": 1416,
    "fa": "من حلش خواهم كرد",
    "en": "I'll figure it out"
  },
  {
    "id": 1417,
    "fa": "قسم می خورم که چیزی نمی دانم",
    "en": "I swear I don't know anything"
  },
  {
    "id": 1418,
    "fa": "نه تا جایی که یادم میاد",
    "en": "Not as far as I remember"
  },
  {
    "id": 1419,
    "fa": "تقصیر کسی نیست",
    "en": "It's no one's fault"
  },
  {
    "id": 1420,
    "fa": "شبیه نمک است",
    "en": "It looks like salt"
  },
  {
    "id": 1421,
    "fa": "هیچ چیز کامل نیست",
    "en": "Nothing's perfect"
  },
  {
    "id": 1422,
    "fa": "کی از بچه هات مراقبت میکنه زمانیکه سر کار هستی",
    "en": "Who looks after your children when you're at work?"
  },
  {
    "id": 1423,
    "fa": "هر چه در ذهنت هست بگو",
    "en": "Say whatever is on your mind"
  },
  {
    "id": 1424,
    "fa": "گفتم اونجا نرو",
    "en": "I told you not to go there"
  },
  {
    "id": 1425,
    "fa": "اسم دوست داشتنی است",
    "en": "It's a lovely name"
  },
  {
    "id": 1426,
    "fa": "من برای سالهاست در حال انجام این هستم",
    "en": "I've been doing this for years"
  },
  {
    "id": 1427,
    "fa": "گاییدمش",
    "en": "Screw it"
  },
  {
    "id": 1428,
    "fa": "چه جور مادری هستی؟",
    "en": "What kind of mother are you?"
  },
  {
    "id": 1429,
    "fa": "من براش (مرد) هر کاری خواهم کرد",
    "en": "I'll do anything for him"
  },
  {
    "id": 1430,
    "fa": "شایعات را شنیدم",
    "en": "I heard the rumors"
  },
  {
    "id": 1431,
    "fa": "اولش باور نکردم",
    "en": "I didn't believe it at first"
  },
  {
    "id": 1432,
    "fa": "زنی که داشتی باهاش حرف میزدی کی بود؟",
    "en": "Who was the woman you were talking to?"
  },
  {
    "id": 1433,
    "fa": "من از آن مردم متنفرم",
    "en": "I hate those people"
  },
  {
    "id": 1434,
    "fa": "بعدا سر خواهم زد",
    "en": "I'll stop by later"
  },
  {
    "id": 1435,
    "fa": "من اصلاً سرگرم نشدم",
    "en": "I was not amused at all"
  },
  {
    "id": 1436,
    "fa": "میتونیم الان (بحث) تمومش کنیم",
    "en": "Can we drop it now?"
  },
  {
    "id": 1437,
    "fa": "پسرم داره دنیا می آید و من باید در آنجا باشم",
    "en": "My son is being born and I should be in there"
  },
  {
    "id": 1438,
    "fa": "همسرم همین الان داره زایمان میکنه",
    "en": "My wife's giving birth right now"
  },
  {
    "id": 1439,
    "fa": "من عصبانی نبودم. منم نبودم",
    "en": "I wasn't angry. Neither was I"
  },
  {
    "id": 1440,
    "fa": "من در لندن زندگی نمی کنم. منم زندگی نمی کنم",
    "en": "I don't live in London. Neither do I"
  },
  {
    "id": 1441,
    "fa": "من پاریس نبودم. منم نبودم",
    "en": "I haven't been to paris. Neither have I"
  },
  {
    "id": 1442,
    "fa": "من چیزی (مودبانه) نخواهم گفت. منم نخواهم گفت",
    "en": "I wouldn't say anything. Neither would I"
  },
  {
    "id": 1443,
    "fa": "کدام یک را ترجیح میدی؟ آیا دوست داری بخوابید با نور کم یا نور روشن یا در تاریکی",
    "en": "Which one do you prefer? Do you like to sleep with the dim light or bright light or in darkness"
  },
  {
    "id": 1444,
    "fa": "به من اطلاع دهید در نظرات زیر",
    "en": "Let me know in the comments below"
  },
  {
    "id": 1445,
    "fa": "تو همسن من هستی",
    "en": "You're my age"
  },
  {
    "id": 1446,
    "fa": "داری چند ساله میشی؟ من دارم ۲۸ ساله میشم",
    "en": "How old are you turning? I'm turning 28"
  },
  {
    "id": 1447,
    "fa": "قصد فضولی ندارم",
    "en": "I don't mean to pry",
    "desc": "\"Nosy\" is an adjective and \"Pry\" is a verb"
  },
  {
    "id": 1448,
    "fa": "اینقدر فضول نباش",
    "en": "Don't be so nosy",
    "desc": "\"Nosy\" is an adjective and \"Pry\" is a verb"
  },
  {
    "id": 1449,
    "fa": "من گفتم نپر جلو همه تو خط دارن انتظار میکشند",
    "en": "I said no skipping everyone's waiting in line"
  },
  {
    "id": 1450,
    "fa": "من از قبل سفارش دادم, من الان اومدم تحویل بگیرم",
    "en": "I pre-ordered, I just come to pick it up"
  },
  {
    "id": 1451,
    "fa": "کسی میدونه آیا این رویداد اجباری هست؟",
    "en": "Does anybody know if this event is mandatory?"
  },
  {
    "id": 1452,
    "fa": "گفتنش راحت تر از انجام دادن",
    "en": "Easier said than done"
  },
  {
    "id": 1453,
    "fa": "فردا صورت خواهد گرفت",
    "en": "It will take place tomorrow"
  },
  {
    "id": 1454,
    "fa": "تو حتی اهمیتی نمی دی",
    "en": "You don't even care"
  },
  {
    "id": 1455,
    "fa": "او (مرد) با همه (هر کی می تونست) تماس گرفت تا یک مکانیکی نزدیک پیدا کند",
    "en": "He called around to find a nearby mechanic"
  },
  {
    "id": 1456,
    "fa": "به چه کسی دیگر می توانیم اعتماد کنیم؟",
    "en": "Who else can we trust?"
  },
  {
    "id": 1457,
    "fa": "آنها جلسه را کنسل کردن",
    "en": "They called off the meeting"
  },
  {
    "id": 1458,
    "fa": "شما درست سر وقت هستی",
    "en": "You're right on time"
  },
  {
    "id": 1459,
    "fa": "وقت خود را با توضیحات تلف نکنید. مردم فقط چیزی را می شنوند که می خواهند بشنوند",
    "en": "Don't waste your time with explanations. People only hear what they want to hear"
  },
  {
    "id": 1460,
    "fa": "چرا منو دعوت کردی اینجا؟",
    "en": "Why did you invite me here?"
  },
  {
    "id": 1461,
    "fa": "اختلاف در سن آن ها به نظر می رسد مهم نباشه",
    "en": "The discrepancy in their ages seemed not to matter",
    "desc": "Subject + auxiliary verb (did not/didn't) + main verb (seem) + infinitive marker (to) + main verb (matter)"
  },
  {
    "id": 1462,
    "fa": "چطور آن ممکن است؟",
    "en": "How is that possible?"
  },
  {
    "id": 1463,
    "fa": "کمپین بازاریابی اولیه ما بار اول جواب نداد",
    "en": "Our initial marketing campaign didn't work the first time"
  },
  {
    "id": 1464,
    "fa": "به شما مربوط نیست",
    "en": "It's not up to you"
  },
  {
    "id": 1465,
    "fa": "با وجود از دست دادن شوت بسکتبال، مربی بازیکن را تشویق کرد تا یک ضربه دیگر را امتحان کند",
    "en": "Despite missing the basketball shot, the coach encouraged the player to try another shot"
  },
  {
    "id": 1466,
    "fa": "کسی خیاط خوب میشناسه؟",
    "en": "Does anybody know a good tailor?"
  },
  {
    "id": 1467,
    "fa": "اگر فردا یک انتخابات باشه, به چه کسی رای می دادی؟",
    "en": "If there was (were) an election tomorrow, who would you vote for?"
  },
  {
    "id": 1468,
    "fa": "چه توصیه ای برای من داری؟",
    "en": "What advice do you have for me?"
  },
  {
    "id": 1469,
    "fa": "چه می کردید اگر مار شما را می گزید؟",
    "en": "What would you do if you were bitten by a snake?"
  },
  {
    "id": 1470,
    "fa": "هرگز یک اشتباه مشابه را دوبار انجام نده",
    "en": "Never make a same mistake twice"
  },
  {
    "id": 1471,
    "fa": "من خیلی می ترسم اگر کسی اسلحه را به سمت من نشانه بگیره",
    "en": "I'd be very scared if somebody pointed a gun at me"
  },
  {
    "id": 1472,
    "fa": "من کی هستم که بحث کنم؟",
    "en": "Who am I to argue?"
  },
  {
    "id": 1473,
    "fa": "اگه الان برم بخوابم, نمی خوابم",
    "en": "If I went to bed now, I wouldn't sleep"
  },
  {
    "id": 1474,
    "fa": "از کجا می خوای شروع کنم؟",
    "en": "Where do you want me to start?"
  },
  {
    "id": 1475,
    "fa": "من برای پیاده روی می رفتم اگه خیلی سرد نبود",
    "en": "I'd go for a walk if it wasn't (weren't) so cold"
  },
  {
    "id": 1476,
    "fa": "اگر به جشن تولدم نیای، هرگز با تو صحبت نخواهم کرد",
    "en": "If you don't come to my birthday party I will never talk to you again"
  },
  {
    "id": 1477,
    "fa": "می توانستم شغل بهتری بگیرم, اگر می توانستم انگلیسی صحبت کنم",
    "en": "I could get a better job, if I could speak english"
  },
  {
    "id": 1478,
    "fa": "بزارش کنار",
    "en": "Put it away"
  },
  {
    "id": 1479,
    "fa": "سپاسگزار می شم (مودبانه) اگر شما (مودبانه) در اسرع وقت تصمیم خود را به من اطلاع دهید",
    "en": "I would be grateful if you would let me know your decision as soon as possible"
  },
  {
    "id": 1480,
    "fa": "هیچ مدرکی داری؟",
    "en": "Do you have any proof?"
  },
  {
    "id": 1481,
    "fa": "اگه دانسته بودم تو در بیمارستانی حتما رفته بودم ببینمت",
    "en": "If I'd known you were in hospital, I would have gone to see you"
  },
  {
    "id": 1482,
    "fa": "چرا امروز انقدر زود بیدار شدی؟",
    "en": "Why did you wake up so early today?"
  },
  {
    "id": 1483,
    "fa": "بیرون رفته بودم اگر اینقدر خسته نبودم",
    "en": "I would have gone out if I hadn't been so tired"
  },
  {
    "id": 1484,
    "fa": "خودتان را با دیگران مقایسه نکن",
    "en": "Don't compare yourself with others"
  },
  {
    "id": 1485,
    "fa": "اگر او (مرد) در حال نگاه کردن بود به جایی که داشت می رفت، به داخل دیوار قدم نگذاشته بود",
    "en": "If he had been looking where he was going, he wouldn't have walked into the wall"
  },
  {
    "id": 1486,
    "fa": "چرا داری این را به من میگی؟",
    "en": "Why are you telling me this?"
  },
  {
    "id": 1487,
    "fa": "اگر گرسنه بودم، چیزی خورده بودم",
    "en": "If I had been hungry, I would have eaten something"
  },
  {
    "id": 1488,
    "fa": "چه کار می توانم برات انجام بدم؟",
    "en": "What can I do for you?"
  },
  {
    "id": 1489,
    "fa": "اگر تو را دیده بودم سلام کرده بودم",
    "en": "If I had seen you, I would have said hello"
  },
  {
    "id": 1490,
    "fa": "هیچ کس نمی داند من اینجا هستم",
    "en": "No one knows I'm here"
  },
  {
    "id": 1491,
    "fa": "اگر هوا اینقدر بد نبود رفته بودیم بیرون",
    "en": "If the weather hadn't been so bad, we would have gone out"
  },
  {
    "id": 1492,
    "fa": "من هرگز آن اشتباه را دوباره نخواهم كرد",
    "en": "I'll never make that mistake again"
  },
  {
    "id": 1493,
    "fa": "اگر هوا اینقدر بد نبود توانسته بودیم برویم بیرون",
    "en": "If the weather hadn't been so bad, we could have gone out"
  },
  {
    "id": 1494,
    "fa": "لطفا بیرون منتظر بمانید",
    "en": "Please wait outside"
  },
  {
    "id": 1495,
    "fa": "اگر دیشب به مهمانی رفته بودم، الان خسته بودم",
    "en": "If I'd gone to the party last night, I would be tired now"
  },
  {
    "id": 1496,
    "fa": "آیا چیزی برای گفتن داری؟",
    "en": "Do you have anything to say?"
  },
  {
    "id": 1497,
    "fa": "اگر در مدرسه سخت تر کار کرده بودم، الان یک شغل بهتری داشتم",
    "en": "If I had worked harder at school, I would have a better job now"
  },
  {
    "id": 1498,
    "fa": "آنها را برگردان",
    "en": "Bring them back"
  },
  {
    "id": 1499,
    "fa": "اگر به نقشه نگاه انداخته بودم, گم نمی شدیم",
    "en": "If we had looked at the map, we wouldn't be lost"
  },
  {
    "id": 1500,
    "fa": "اگر کسی بیاد داخل چی؟",
    "en": "What if someone comes in?"
  },
  {
    "id": 1501,
    "fa": "اگر از عنکبوت نمی ترسیدید، آن را برداشته بودید و بیرون گذاشته بودید",
    "en": "If you weren't afraid of spider, you would have picked it up and put it outside"
  },
  {
    "id": 1502,
    "fa": "با تمام وجود",
    "en": "By all means"
  },
  {
    "id": 1503,
    "fa": "برای شما بهترین ها را در آینده آرزو می کنم",
    "en": "I wish you all the best in the future"
  },
  {
    "id": 1504,
    "fa": "امیدوارم به زودی احساس بهتری كنی",
    "en": "I hope you feel better soon"
  },
  {
    "id": 1505,
    "fa": "کاش شماره تلفنش (مرد) را می دانستم",
    "en": "I wish I knew his phone number"
  },
  {
    "id": 1506,
    "fa": "یک بقل بهم بده",
    "en": "Give me a hug"
  },
  {
    "id": 1507,
    "fa": "اینجا خیلی باران می بارد. کاش اینهمه بارون نمیبارید",
    "en": "It rains a lot here. I wish it didn't rain so much"
  },
  {
    "id": 1508,
    "fa": "او (زن) را منتظر نگه ندار",
    "en": "Don't keep her waiting"
  },
  {
    "id": 1509,
    "fa": "اینجا خیلی شلوغه. کاش این همه آدم نبود",
    "en": "It's very crowded here. I wish there weren't so many people"
  },
  {
    "id": 1510,
    "fa": "اینها برای شما هستند",
    "en": "These are for you"
  },
  {
    "id": 1511,
    "fa": "آرزو داری نزدیک دریا زندگی کنی؟",
    "en": "Do you wish you lived near the sea?"
  },
  {
    "id": 1512,
    "fa": "آیا نگرانی من را درک می کنی؟",
    "en": "Do you understand my concern?"
  },
  {
    "id": 1513,
    "fa": "من اضافه وزن دارم. کاش لاغرتر بودم",
    "en": "I'm overweight. I wish I were thinner"
  },
  {
    "id": 1514,
    "fa": "من به توجه کامل شما نیاز دارم",
    "en": "I need your full attention"
  },
  {
    "id": 1515,
    "fa": "آیا تا به حال آرزو کردی بتوانی پرواز کنید؟",
    "en": "Do you ever wish you could fly?"
  },
  {
    "id": 1516,
    "fa": "ما هر دو می دانیم چرا",
    "en": "We both know why"
  },
  {
    "id": 1517,
    "fa": "متاسفم باید برم. کاش می تونستم بیشتر بمانم",
    "en": "I'm sorry I have to go. I wish I could stay longer"
  },
  {
    "id": 1518,
    "fa": "نباید خودت را به کسی ثابت کنی",
    "en": "You don't have to prove yourself to anybody"
  },
  {
    "id": 1519,
    "fa": "کاش باران قطع می شد",
    "en": "I wish it would stop raining"
  },
  {
    "id": 1520,
    "fa": "در حقیقت",
    "en": "As a matter of fact"
  },
  {
    "id": 1521,
    "fa": "کاش تو (مودبانه) مدام حرفم را قطع نکنی",
    "en": "I wish you wouldn't keep interrupting me"
  },
  {
    "id": 1522,
    "fa": "هیچوقت من را تنها نگذار",
    "en": "Never leave me alone"
  },
  {
    "id": 1523,
    "fa": "کاش دانسته بودم که اصغر بیمار بود. من رفته بودم تا ببینمش",
    "en": "I wish I'd known that Asghar was ill. I would have gone to see him"
  },
  {
    "id": 1524,
    "fa": "من سراپا گوشم",
    "en": "I'm all ears"
  },
  {
    "id": 1525,
    "fa": "من احساس مریضی می كنم. کاش اینقدر کیک نخورده بودم",
    "en": "I feel sick. I wish I hadn't eaten so much cake"
  },
  {
    "id": 1526,
    "fa": "هیچ کس ندیدش",
    "en": "Nobody saw it"
  },
  {
    "id": 1527,
    "fa": "چیز احمقانه ای بود برای گفتن. کاش نگفته بودم",
    "en": "It was a stupid thing to say. I wish I hadn't said it"
  },
  {
    "id": 1528,
    "fa": "به شماره یک قفل ساز نیاز دارم",
    "en": "I need the number of a locksmith"
  },
  {
    "id": 1529,
    "fa": "شنیدم که مهمانی عالی بود. کاش توانسته بودم به آنجا بروم",
    "en": "I heard the party was great. I wish I could have gone there"
  },
  {
    "id": 1530,
    "fa": "فراموش نکنید که چراق چشمک زن خود را روشن کنید قبل از شما اینکه بپیچید",
    "en": "Don't forget to put your blinker on before you make a turn"
  },
  {
    "id": 1531,
    "fa": "نیش پشه را روی بازویم خاراندم",
    "en": "I scratched the mosquito bite on my arm"
  },
  {
    "id": 1532,
    "fa": "من همه پولم را احمقانه تلف کردن",
    "en": "I have fooled away all my money",
    "desc": "\"I have fooled away all my money\" is a general statement about wasting money.\n\"I have fooled away all of my money\" emphasizes that every bit of money has been wasted."
  },
  {
    "id": 1533,
    "fa": "اگر جهش های قیمت ادامه یابد، مردم قادر به خرید خانه های جدید مورد نظر خود نخواهند بود",
    "en": "If price spikes continue, people will not be able to afford the new houses they want"
  },
  {
    "id": 1534,
    "fa": "او (زن) داشت طبقه بالا و پایین را تمیز می کرد",
    "en": "She was cleaning the upstairs and downstairs"
  },
  {
    "id": 1535,
    "fa": "توقع داشتی چیکار کنم؟",
    "en": "What did you expect me to do?"
  },
  {
    "id": 1536,
    "fa": "آیا آن چیزی است که شما می خواهید؟",
    "en": "Is that what you want?"
  },
  {
    "id": 1537,
    "fa": "برگرد سر کار",
    "en": "Get back to work"
  },
  {
    "id": 1538,
    "fa": "کلیدهایت را داری؟",
    "en": "Do you have your keys?"
  },
  {
    "id": 1539,
    "fa": "او (مرد) منتظر ماند برای مدیریت تا به عهد خود وفا کند مبنی بر ارتقاء یا افزایش حقوق او",
    "en": "He kept waiting for management to keep its promise of giving him a promotion or a raise"
  },
  {
    "id": 1540,
    "fa": "بینیمت در تماس تصویریمان روی لپ تاپ",
    "en": "See you in our video call on the laptop"
  },
  {
    "id": 1541,
    "fa": "همه آن بدان معناست که این دیفرانسیل عقب است",
    "en": "All that means is that this is rear-wheel drive",
    "desc": "\"All that means\" is the main clause of the sentence. \"Means\" is the verb, and \"all that\" is the subject.\n\n\"is that this is rear-wheel drive\" is a subordinate clause that provides further information about what \"all that means.\" The first \"is\" in this clause is the main verb linking \"this\" to \"rear-wheel drive,\" and the second \"is\" is the verb that describes the nature of \"this\" (rear-wheel drive)."
  },
  {
    "id": 1542,
    "fa": "صندلی ها کمی تنگ است",
    "en": "The seats are a little bit cramped"
  },
  {
    "id": 1543,
    "fa": "خفه شو و تحویلش بده",
    "en": "Shut up and hand it over"
  },
  {
    "id": 1544,
    "fa": "او (زن) انگشت وسط خود رو پشت سرش (مرد) گرفت ",
    "en": "She flipped him off behind his back"
  },
  {
    "id": 1545,
    "fa": "من پنج بار این را پشت سر گذاشتم",
    "en": "I've been through this five times"
  },
  {
    "id": 1546,
    "fa": "چه فرقی می کنه؟",
    "en": "What difference does it make?"
  },
  {
    "id": 1547,
    "fa": "برای دهمین بار",
    "en": "For the tenth time"
  },
  {
    "id": 1548,
    "fa": "تو بیش از اندازه حساسی",
    "en": "You're way too sensitive"
  },
  {
    "id": 1549,
    "fa": "من نمی خواستم هیچ کدام از این اتفاق بیفته",
    "en": "I didn't want any of this to happen"
  },
  {
    "id": 1550,
    "fa": "ازت میخوام تو چشمام نگاه کنی",
    "en": "I want you to look into my eyes"
  },
  {
    "id": 1551,
    "fa": "کی در مورد تو چیزی گفت؟",
    "en": "Who said anything about you?"
  },
  {
    "id": 1552,
    "fa": "آیا چیزی وجود دارد ما باید در موردش صحبت کنیم؟",
    "en": "Is there something we should talk about?"
  },
  {
    "id": 1553,
    "fa": "ما اخیراً خیلی چیزها را پشت سر گذاشتیم",
    "en": "We've been through a lot lately"
  },
  {
    "id": 1554,
    "fa": "چیزها را شخصی نکن",
    "en": "Don't make things personally"
  },
  {
    "id": 1555,
    "fa": "گریه کردن (مودبانه) رو بس میکنی؟",
    "en": "Would you stop crying?"
  },
  {
    "id": 1556,
    "fa": "من هیچ اشتباهی نکردم",
    "en": "I haven't done anything wrong"
  },
  {
    "id": 1557,
    "fa": "اجتناب ناپذیر است",
    "en": "It's inevitable"
  },
  {
    "id": 1558,
    "fa": "داری خونریزی میکنی",
    "en": "You're bleeding"
  },
  {
    "id": 1559,
    "fa": "من می خواهم همه چیز را بشنوم",
    "en": "I wanna hear everything"
  },
  {
    "id": 1560,
    "fa": "چطور می توانی اینقدر مطمئن باشی؟",
    "en": "How can you be so sure?"
  },
  {
    "id": 1561,
    "fa": "هیچ بازگشتی وجود ندارد",
    "en": "There's no coming back"
  },
  {
    "id": 1562,
    "fa": "متاسفم برای منتظر نگه داشتنت",
    "en": "I'm sorry to keep you waiting"
  },
  {
    "id": 1563,
    "fa": "من چاره ای نداشتم",
    "en": "I didn't have a choice"
  },
  {
    "id": 1564,
    "fa": "شما نمی دانی با کی داری صحبت می کنی",
    "en": "You don't know who you're talking to"
  },
  {
    "id": 1565,
    "fa": "دقیقا همان چیزی که انتظار داشتم",
    "en": "Exactly what I expected"
  },
  {
    "id": 1566,
    "fa": "ارزشش را داشت؟",
    "en": "Was it worth it?"
  },
  {
    "id": 1567,
    "fa": "كاری نیست بتوانم در مورد این انجام دهم",
    "en": "There's nothing I can do about this"
  },
  {
    "id": 1568,
    "fa": "نگهش دار برای روز مبادا",
    "en": "Save it for a rainy day"
  },
  {
    "id": 1569,
    "fa": "آن را دور از چشم نگه دار",
    "en": "Keep it out of sight"
  },
  {
    "id": 1570,
    "fa": "حقیقت این است ...",
    "en": "The truth is ..."
  },
  {
    "id": 1571,
    "fa": "کار از کار گذشته",
    "en": "What's done is done"
  },
  {
    "id": 1572,
    "fa": "چه کسی اهمیت می ده چه احساسی داری؟",
    "en": "Who cares how you feel?"
  },
  {
    "id": 1573,
    "fa": "فقط نرمال عمل کن",
    "en": "Just act normal"
  },
  {
    "id": 1574,
    "fa": "اونطوری کار نمیکنه",
    "en": "It doesn't work like that"
  },
  {
    "id": 1575,
    "fa": "کی همه اینها را بهت گفت؟",
    "en": "Who told you all of this?"
  },
  {
    "id": 1576,
    "fa": "برای آن است چیزى نگفتم",
    "en": "That's why I didn't say anything"
  },
  {
    "id": 1577,
    "fa": "جرات انجامش را نداری",
    "en": "You don't have the guts to do it"
  },
  {
    "id": 1578,
    "fa": "هر جا که راحت هستید، بفرمایید بنشینید",
    "en": "Have a seat wherever you're comfortable",
    "desc": "\"Take a seat\" and \"Have a seat\" are used in a similar context and are generally interchangeable"
  },
  {
    "id": 1579,
    "fa": "فکر میکنی کی هستی؟",
    "en": "Who do you think you are?"
  },
  {
    "id": 1580,
    "fa": "کاری رو که میگم را انجام بده",
    "en": "Do what I say"
  },
  {
    "id": 1581,
    "fa": "تولدت چطور بود؟",
    "en": "How was your birthday?"
  },
  {
    "id": 1582,
    "fa": "کمی استراحت کن",
    "en": "Get some rest"
  },
  {
    "id": 1583,
    "fa": "من را از اینجا بیرون ببر",
    "en": "Get me out of here",
    "desc": "\"Get me out of here\" is a direct and urgent request to leave a place.\n\"Take me out of here\" is a request to leave but may imply someone assisting or accompanying you."
  },
  {
    "id": 1584,
    "fa": "به محض اینکه بتونم",
    "en": "As soon as I can"
  },
  {
    "id": 1585,
    "fa": "باعث افتخار منه",
    "en": "It's my pleasure"
  },
  {
    "id": 1586,
    "fa": "تو خودت گفتیش",
    "en": "You said it yourself"
  },
  {
    "id": 1587,
    "fa": "از ناکجاآباد آمد",
    "en": "It came out of nowhere"
  },
  {
    "id": 1588,
    "fa": "دارم التماست می کنم, در را قفل کن",
    "en": "I'm begging you, Lock the door"
  },
  {
    "id": 1589,
    "fa": "اگه حق با من باشد چی؟",
    "en": "What if I'm right"
  },
  {
    "id": 1590,
    "fa": "تا زمانی که طول بکشد",
    "en": "As long as it takes"
  },
  {
    "id": 1591,
    "fa": "چی بهش (مرد) گفتی؟ من هیچ چیزی نگفتم",
    "en": "What did you tell him? I didn't say anything"
  },
  {
    "id": 1592,
    "fa": "حتی فکرش هم نکن",
    "en": "Don't even think about it"
  },
  {
    "id": 1593,
    "fa": "اونطوری به من نگاه نکن",
    "en": "Don't look at me like that"
  },
  {
    "id": 1594,
    "fa": "بریم سر کار",
    "en": "Let's get to work"
  },
  {
    "id": 1595,
    "fa": "مثل یک بچه رفتار نکن",
    "en": "Don't behave like a child"
  },
  {
    "id": 1596,
    "fa": "درست روبروی من",
    "en": "Right in front of me"
  },
  {
    "id": 1597,
    "fa": "به جای من با مامان خداحافظی کن",
    "en": "Say bye to mom for me"
  },
  {
    "id": 1598,
    "fa": "ایمان داشته باش",
    "en": "Have faith"
  },
  {
    "id": 1599,
    "fa": "آیا رای بگیریم؟",
    "en": "Do we take a vote?"
  },
  {
    "id": 1600,
    "fa": "تو خیلی شجاع بودی",
    "en": "You were very brave"
  },
  {
    "id": 1601,
    "fa": "می خوام تو حدس بزنی",
    "en": "I want you to guess"
  },
  {
    "id": 1602,
    "fa": "زیاد بهش فکر نکن",
    "en": "Don't think too much about it"
  },
  {
    "id": 1603,
    "fa": "آن را به سلامتی خرج کنی",
    "en": "Spend it in good health"
  },
  {
    "id": 1604,
    "fa": "سهم خود را پرداخت خواهم کرد",
    "en": "I'll pay my share"
  },
  {
    "id": 1605,
    "fa": "بیا واقع بین باشیم",
    "en": "Let's be realistic"
  },
  {
    "id": 1606,
    "fa": "میتونی (مودبانه) یک لحظه به ما وقت بدی؟",
    "en": "Could you give us a moment?"
  },
  {
    "id": 1607,
    "fa": "چه تصادفی",
    "en": "What a coincidence"
  },
  {
    "id": 1608,
    "fa": "او (زن) سعی کرد در مورد نگرانی هایش با او (مرد) صحبت کند، اما او (مرد) فقط او (زن) را نادیده گرفت و رفت",
    "en": "She tried to talk to him about her concerns, but he just brushed her off and walked away"
  },
  {
    "id": 1609,
    "fa": "به خدا قسم میخورم",
    "en": "I swear to god"
  },
  {
    "id": 1610,
    "fa": "چرا امروز تمومش نکنیم؟",
    "en": "Why don't we call it a day?"
  },
  {
    "id": 1611,
    "fa": "به آنچه می خواستی رسیدی",
    "en": "You got what you wanted"
  },
  {
    "id": 1612,
    "fa": "تا اینجا خیلی خوبه",
    "en": "So far so good"
  },
  {
    "id": 1613,
    "fa": "تنها راه بود",
    "en": "It was the only way"
  },
  {
    "id": 1614,
    "fa": "چطور میتونی اینقدر بی مسئولیت باشی؟",
    "en": "How can you be so irresponsible?"
  },
  {
    "id": 1615,
    "fa": "من نمی خوام وارد جزئیات شوم",
    "en": "I don't want to go into the details"
  },
  {
    "id": 1616,
    "fa": "هیچکس اینجا نیست",
    "en": "Nobody's here"
  },
  {
    "id": 1617,
    "fa": "نذار شروع کنم",
    "en": "Don't get me started"
  },
  {
    "id": 1618,
    "fa": "میدونم چقدر ناراحتی",
    "en": "I know how upset you are"
  },
  {
    "id": 1619,
    "fa": "باید انجام می شد",
    "en": "It had to be done"
  },
  {
    "id": 1620,
    "fa": "او (مرد) دوست و همچنین رهبر ما است",
    "en": "He is our friend and likewise our leader"
  },
  {
    "id": 1621,
    "fa": "می تواند خیلی كمك كننده باشد",
    "en": "It can be very helpful"
  },
  {
    "id": 1622,
    "fa": "نمیدونستم دیگه چیکار کنم",
    "en": "I didn't know what else to do"
  },
  {
    "id": 1623,
    "fa": "بحث رو عوض كن",
    "en": "Change the subject"
  },
  {
    "id": 1624,
    "fa": "اگر دوباره اتفاق بیفتد چی؟",
    "en": "What if it happens again?"
  },
  {
    "id": 1625,
    "fa": "نمی دانم و نمی خواهم بدانم",
    "en": "I don't know and I don't want to know"
  },
  {
    "id": 1626,
    "fa": "شکی درش نیست",
    "en": "There's no doubt about it"
  },
  {
    "id": 1627,
    "fa": "بهش (مرد) بگو ضروریه",
    "en": "Tell him it's urgent"
  },
  {
    "id": 1628,
    "fa": "میتونی با من راحت باشی",
    "en": "You can be open with me"
  },
  {
    "id": 1629,
    "fa": "نمی تواند درست باشه",
    "en": "It can't be true"
  },
  {
    "id": 1630,
    "fa": "چند وقته میدونی؟",
    "en": "How long have you known?"
  },
  {
    "id": 1631,
    "fa": "داری من رو می ترسونی",
    "en": "You're scaring me"
  },
  {
    "id": 1632,
    "fa": "گفتم بهت نگران نباش, من دارم جایی نمی رم",
    "en": "I told you not to worry, I'm not going anywhere"
  },
  {
    "id": 1633,
    "fa": "داری دیوونم میکنی",
    "en": "You're driving me crazy"
  },
  {
    "id": 1634,
    "fa": "تو کاملاً عقلت رو از دست دادی",
    "en": "You're completely out of your mind"
  },
  {
    "id": 1635,
    "fa": "بعداً همه چیز را توضیح خواهم داد",
    "en": "I will explain everything later"
  },
  {
    "id": 1636,
    "fa": "چه كسی پردرآمدترین كارمند آمازون است؟",
    "en": "Who is Amazon's highest paid employee?"
  },
  {
    "id": 1637,
    "fa": "وقت زیادی نداریم",
    "en": "We don't have so much time"
  },
  {
    "id": 1638,
    "fa": "خیلی خسته ام",
    "en": "I'm exhausted"
  },
  {
    "id": 1639,
    "fa": "شماره های ناشناس رو پاسخ نده",
    "en": "Don't answer unknown number"
  },
  {
    "id": 1640,
    "fa": "بهترین تلاشت رو کردی",
    "en": "You did your best"
  },
  {
    "id": 1641,
    "fa": "بسیاری از تصادفات به دلیل بی احتیاطی رانندگی باعث می شوند",
    "en": "Many accidents are caused by careless driving"
  },
  {
    "id": 1642,
    "fa": "این کلمه چگونه تلفظ می شود؟",
    "en": "How is this word pronounced?"
  },
  {
    "id": 1643,
    "fa": "یک نفر هست پشت سر ما داره راه می ره. من فکر می کنم ما داریم دنبال می شیم",
    "en": "There's somebody walking behind us. I think we are being followed"
  },
  {
    "id": 1644,
    "fa": "کیک در حال درست شدن است",
    "en": "Cake has been being made"
  },
  {
    "id": 1645,
    "fa": "در طول شب با نویز بلندی از خواب بیدار شدیم",
    "en": "We were woken up by a loud noise during the night"
  },
  {
    "id": 1646,
    "fa": "اتاق داشت تمیز میشد زمانیكه رسیدم",
    "en": "The room was being cleaned when I arrived"
  },
  {
    "id": 1647,
    "fa": "سبزیجات طعم خوبی نمی دادند. آنها مدت زیادی پخته شده بودند",
    "en": "The vegetables didn't taste good. They had been cooked too long"
  },
  {
    "id": 1648,
    "fa": "کیک در حال درست شدن بود",
    "en": "Cake had been being made"
  },
  {
    "id": 1649,
    "fa": "من خیلی اوقات به مهمانی ها دعوت نمی شوم",
    "en": "I'm not invited to parties very often"
  },
  {
    "id": 1650,
    "fa": "او (مرد) کاملا مست (چت) بود",
    "en": "He was completely intoxicated"
  },
  {
    "id": 1651,
    "fa": "جویدن آدامس در جلسه توهین آمیز است",
    "en": "It's offensive to chew gum in a meeting",
    "desc": "In this sentence, \"a meeting\" is referring to a specific instance of a meeting, so the article \"a\" is needed before \"meeting\" to make it grammatically accurate."
  },
  {
    "id": 1652,
    "fa": "همگی به چخ رفتیم",
    "en": "We're all fucked up"
  },
  {
    "id": 1653,
    "fa": "چگونه یک اسب وحشی را رام می کنید؟",
    "en": "How do you tame a wild horse?"
  },
  {
    "id": 1654,
    "fa": "وقتم را تلف نکن",
    "en": "Don't waste my time"
  },
  {
    "id": 1655,
    "fa": "من یک بار به شدت آسیب دیدم",
    "en": "I got hurt one time pretty badly"
  },
  {
    "id": 1656,
    "fa": "من باید جیش کنم",
    "en": "I got to take a leak"
  },
  {
    "id": 1657,
    "fa": "من وقت دندانپزشکی دارم",
    "en": "I have a dental appointment"
  },
  {
    "id": 1658,
    "fa": "کی میای دنبال من؟",
    "en": "When do you come for me?"
  },
  {
    "id": 1659,
    "fa": "یک فصل بد به این معنی نیست که داستان شما تمام است، فقط ورق بزنید",
    "en": "One bad chapter doesn't mean your story is over, just turn the page"
  },
  {
    "id": 1660,
    "fa": "دندانم افتاد",
    "en": "My tooth fell out"
  },
  {
    "id": 1661,
    "fa": "اون لبخند را از روی صورتت پاک کن",
    "en": "Wipe that smile off your face"
  },
  {
    "id": 1662,
    "fa": "تا بیرون همراهیت می کنم",
    "en": "I'll walk you out"
  },
  {
    "id": 1663,
    "fa": "هرگز یک فرد وفادار را به حدی نرسانید جایی که دیگر برایش مهم نباشد",
    "en": "Never push a loyal person to the point where they no longer care"
  },
  {
    "id": 1664,
    "fa": "من هوس شکلات دارم",
    "en": "I have a craving for chocolate"
  },
  {
    "id": 1665,
    "fa": "چقدر قهوه تان را قوی دوست دارید؟",
    "en": "How strong do you like your coffee?"
  },
  {
    "id": 1666,
    "fa": "من او (مرد) را نیشگون می گیرم",
    "en": "I pinch him"
  },
  {
    "id": 1667,
    "fa": "قوانین سختگیرانه تر رشد اقتصادی را محدود خواهد کرد",
    "en": "Tighter rules will cramp economic growth"
  },
  {
    "id": 1668,
    "fa": "یک خیار هستش، انتخاب شده تا خرد شود برای سالاد",
    "en": "It is a cucumber, It has been chosen to be chopped for salad"
  },
  {
    "id": 1669,
    "fa": "رئیس جمهور سوگند یاد کرد که از قانون اساسی حمایت کند",
    "en": "The President swore to uphold the constitution"
  },
  {
    "id": 1670,
    "fa": "با پله برقی به طبقه دوم مرکز خرید رفتم",
    "en": "I rode the escalator to the second floor of the mall"
  },
  {
    "id": 1671,
    "fa": "نرده را نگه داشتم وقتی از راه پله پایین می آمدم",
    "en": "I held onto the railing as I descended the staircase"
  },
  {
    "id": 1672,
    "fa": "من وظیفه ای ندارم",
    "en": "I'm off duty"
  },
  {
    "id": 1673,
    "fa": "زبونش (مرد) مثل نیش مار میمونه",
    "en": "His bark is worse than his bite"
  },
  {
    "id": 1674,
    "fa": "چه آدم آشغالی",
    "en": "What a jerk"
  },
  {
    "id": 1675,
    "fa": "تو باید وابستگیت رو به جیب من بزاری کنار",
    "en": "You have to wean yourself off my pocket"
  },
  {
    "id": 1676,
    "fa": "پدرم تو پنجاه سالگیشه",
    "en": "My father is in his fifties"
  },
  {
    "id": 1677,
    "fa": "عموم یه آدم خود ساخته ای",
    "en": "My uncle is a self-made person"
  },
  {
    "id": 1678,
    "fa": "برادرت خیلی صمیمی است",
    "en": "Your brother is very friendly"
  },
  {
    "id": 1679,
    "fa": "چرا دیگه به ملاقات دوستت نمیری",
    "en": "Why don't you visit your friend anymore"
  },
  {
    "id": 1680,
    "fa": "آیا نمی خواهی او (زن) را به جشن تولدت دعوت کنی؟",
    "en": "Don't you want to invite her to your birthday party"
  },
  {
    "id": 1681,
    "fa": "من سبدی از گوجه سبزی های و خرمالو های رسیده را از درخت کندم",
    "en": "I picked a basket of ripe greengages (ˈɡrēnˌɡāj) and persimmon (pərˈsimən) from the tree"
  },
  {
    "id": 1682,
    "fa": "من از نارنگی های و شلیل آبدار در یک بعد از ظهر گرم تابستان لذت بردم",
    "en": "I enjoyed juicy tangerines (ˌtanjəˈrēn) and nectarines (ˌnektəˈrēn) on a hot summer afternoon"
  },
  {
    "id": 1683,
    "fa": "احساس جمعی بیش از اندازه مثبت بود",
    "en": "The collective sentiment was extremely positive"
  },
  {
    "id": 1684,
    "fa": "همانطور که برای آخرین مرحله آماده می شویم، مایلم از تمام مشارکت های شما قدردانی صمیمانه خود را اعلام کنم",
    "en": "As we gear up for the last stretch, I wish to convey my heartfelt appreciation of all of your contributions"
  },
  {
    "id": 1685,
    "fa": "به نظر شما او (زن) می تواند دوست خوبی برای من باشد؟",
    "en": "Do you think she can be a good friend for me?"
  },
  {
    "id": 1686,
    "fa": "اگر من بودم با او (مرد) دوست نمی شدم",
    "en": "If I were you I wouldn't make friends with him",
    "desc": "In this sentence, \"friends\" is the plural form of the noun because it refers to the idea of forming a relationship with someone."
  },
  {
    "id": 1687,
    "fa": "گیج شدم. نمی دانم چه کنم",
    "en": "I'm confused. I don't know what to do"
  },
  {
    "id": 1688,
    "fa": "او (زن) پشت سر همه حرف میزنه",
    "en": "She talks behind everybody's back"
  },
  {
    "id": 1689,
    "fa": "برادر منم دقیقا همینطوره",
    "en": "My brother is exactly the same"
  },
  {
    "id": 1690,
    "fa": "چرا علی اینجاست؟",
    "en": "Why is Ali here?"
  },
  {
    "id": 1691,
    "fa": "او (زن) دعوت نشده بود",
    "en": "She wasn't invited"
  },
  {
    "id": 1692,
    "fa": "فایده ای نداشت",
    "en": "It was no use"
  },
  {
    "id": 1693,
    "fa": "او (مرد) هرگز اشتباهش را اذعان نمی کند",
    "en": "He never admits his mistake"
  },
  {
    "id": 1694,
    "fa": "شما برای تدریس کردن ساخته شدی",
    "en": "You are cut out for teaching"
  },
  {
    "id": 1695,
    "fa": "تصادف وحشتناکی داشتم اما آسیبی ندیدم",
    "en": "I had a terrible accident but I wasn't hurt"
  },
  {
    "id": 1696,
    "fa": "من واقعا خوشحالم که شما را سالم و سلامت می بینم",
    "en": "I'm really glad to see you safe and sound"
  },
  {
    "id": 1697,
    "fa": "به خاطر تو اخراج شدم",
    "en": "I got fired because of you"
  },
  {
    "id": 1698,
    "fa": "من در مورد او (زن) وجدان راحت دارم",
    "en": "I have a clear conscience about her"
  },
  {
    "id": 1699,
    "fa": "به چه حقی همچین کاری رو می کنی؟",
    "en": "What gives you the right to do so?"
  },
  {
    "id": 1700,
    "fa": "آیا فرصت کردی با دخترت صحبت کنی؟",
    "en": "Did you get a chance to talk to your daughter?"
  },
  {
    "id": 1701,
    "fa": "دلخور نشو",
    "en": "Don't get offended"
  },
  {
    "id": 1702,
    "fa": "این نشانگر (مارکر) متعلق به کیست؟",
    "en": "Whose marker is this?"
  },
  {
    "id": 1703,
    "fa": "او (مرد) کارمند دولت هستم",
    "en": "He's a government employee"
  },
  {
    "id": 1704,
    "fa": "رویای من بالاخره محقق شد",
    "en": "My dream has finally come to fruition (/fro͞oˈiSH(ə)n/)"
  },
  {
    "id": 1705,
    "fa": "سیستم تخلیه جدید ما امروز راه اندازی خواهد شد",
    "en": "Our new evacuation system will be put into operation today"
  },
  {
    "id": 1706,
    "fa": "آیا تا به حال فکر کرده اید بالاترین ارتفاعی که هر جت جنگنده می تواند به آن برسد چیست؟",
    "en": "Have you ever wondered what is the highest altitude any fighter jet can reach?"
  },
  {
    "id": 1707,
    "fa": "او (زن) اجازه داد به (او) مخ دوستش را بزند برای بیش از 5 دقیقه",
    "en": "She let him hitting on her friend for over 5 minutes"
  },
  {
    "id": 1708,
    "fa": "به عنوان رئیس، من اجازه نداشتم باشم",
    "en": "As chairman, I wasn't allowed to be"
  },
  {
    "id": 1709,
    "fa": "اینجا جایی نبود؟",
    "en": "Was there nowhere here?"
  },
  {
    "id": 1710,
    "fa": "فکر کنم رفته",
    "en": "I think it's gone"
  },
  {
    "id": 1711,
    "fa": "من سعی کردم بدون اینکه آماده باشم یک غذای پیچیده بپزم, منجر به یک فاجعه آشپزی شد",
    "en": "I attempted to cook a complex dish without being ready, resulting in a culinary disaster"
  },
  {
    "id": 1712,
    "fa": "من مصمم بودم که او را وادار کنم تا مؤسسه را اداره کند",
    "en": "I was determined to get him to run the institute"
  },
  {
    "id": 1713,
    "fa": "من یک تحسین کننده بزرگ کار شما هستم",
    "en": "I'm a great admirer of your work"
  },
  {
    "id": 1714,
    "fa": "او (مرد) بعد از این بیشتر آنجاست",
    "en": "He's there most after this"
  },
  {
    "id": 1715,
    "fa": "خدا تاس بازی نمی کند",
    "en": "God doesn't play dice"
  },
  {
    "id": 1716,
    "fa": "چرا  نگران باشم بعد از تمام کارهایی که شما برای کشورتان انجام داده اید؟",
    "en": "Why would I be worried after everything you've done for your country?"
  },
  {
    "id": 1717,
    "fa": "من نمی خواستم با دادن اطلاعات نادرست او را از خودم بیازارم",
    "en": "I didn't want to sour him on me by giving him false information"
  },
  {
    "id": 1718,
    "fa": "ممنون از سوار کردنتان",
    "en": "Thanks for the lift"
  },
  {
    "id": 1719,
    "fa": "چگونه می تونم کفشم را کوچکتر کنم؟",
    "en": "How can I make my shoe smaller?"
  },
  {
    "id": 1720,
    "fa": "تو اصلا به پدرت نرفتی",
    "en": "You don't take after your father at all"
  },
  {
    "id": 1721,
    "fa": "تو با پدرت خیلی فرق داری",
    "en": "You're very different from your father"
  },
  {
    "id": 1722,
    "fa": "تو جنبه شوخی نداری",
    "en": "You can't take a joke"
  },
  {
    "id": 1723,
    "fa": "آیا مادرشوهرت در زندگی خصوصی شما دخالت می کند؟",
    "en": "Does your mother-in-law interfere in your private life?"
  },
  {
    "id": 1724,
    "fa": "کل کلاس از خندیدن منفجر شد",
    "en": "The whole class burst out laughing"
  },
  {
    "id": 1725,
    "fa": "امروز رو مود نیستم برای بیرون رفتن",
    "en": "I'm not in the mood for going out today"
  },
  {
    "id": 1726,
    "fa": "از کجا فهمیدی او (مرد) داشت دروغ میگفت؟",
    "en": "How did you know he was lying?"
  },
  {
    "id": 1727,
    "fa": "چرا می خوای شغلت را ترک کنی؟",
    "en": "Why do you want to quit your job?"
  },
  {
    "id": 1728,
    "fa": "در مورد حقوق نیست",
    "en": "It's not about the salary"
  },
  {
    "id": 1729,
    "fa": "تو جلوی همه سرم داد زدی",
    "en": "You shouted at me in front of everybody"
  },
  {
    "id": 1730,
    "fa": "چرا اینقدر از دست برادرت ناراحتی؟",
    "en": "Why are you so upset with your brother?"
  },
  {
    "id": 1731,
    "fa": "تمام آخر هفته مثل اسب کار کردم",
    "en": "I worked like a horse all weekend"
  },
  {
    "id": 1732,
    "fa": "با خانواده خوش گذشت؟",
    "en": "Did you have fun with your family?"
  },
  {
    "id": 1733,
    "fa": "وقتشه دست از حرف زدن برداریم و اقدام کنید",
    "en": "It's time to stop talking and take action"
  },
  {
    "id": 1734,
    "fa": "من باید به آمریکا برگردم",
    "en": "I have to get back to America"
  },
  {
    "id": 1735,
    "fa": "هیچ کس آنجا او را جدی نمی گیرد",
    "en": "There's no one there taking him seriously"
  },
  {
    "id": 1736,
    "fa": "بهتر است به خانه برگردی",
    "en": "It's best you get home"
  },
  {
    "id": 1737,
    "fa": "فکر میکردم که من به شما آزمایش گرا نزدیک خواهم بود",
    "en": "I thought I'd be close to you experimentalists"
  },
  {
    "id": 1738,
    "fa": "تئوری فقط تا اینجا شما را می رساند",
    "en": "Theory will get you only so far"
  },
  {
    "id": 1739,
    "fa": "من دارم چیزی را آموزش می دهم که هیچ کس در اینجا علاقه ندارد",
    "en": "I'm teaching something no one here is interested of"
  },
  {
    "id": 1740,
    "fa": "چطور می تواند هر دو باشد؟",
    "en": "How could it be both?"
  },
  {
    "id": 1741,
    "fa": "چرا آنها بدون برنامه ریزی مناسب پروژه را شروع کرده بودند؟",
    "en": "Why would they have started the project without proper planning?"
  },
  {
    "id": 1742,
    "fa": "چه اتفاقی برای ستاره ها می افتد وقتی أنها می میرند؟",
    "en": "What happens to stars when they die?"
  },
  {
    "id": 1743,
    "fa": "مطمئن شوید که او (مرد) درک می کند که با خلاص شدن از دست شما چیزی لعنتی را از دست نمی دهد",
    "en": "Make sure he understands that he's not losing a damn thing by getting rid of you"
  },
  {
    "id": 1744,
    "fa": "این همه در مورد چیست؟",
    "en": "What's that all about?"
  },
  {
    "id": 1745,
    "fa": "پنیر کپک زده است",
    "en": "The cheese is mouldy"
  },
  {
    "id": 1746,
    "fa": "نان کهنه است",
    "en": "The bread is stale"
  },
  {
    "id": 1747,
    "fa": "شیر فاسد شده است",
    "en": "The milk is spoiled"
  },
  {
    "id": 1748,
    "fa": "شیر منقضی شده است",
    "en": "The milk has expired"
  },
  {
    "id": 1749,
    "fa": "هلوها پوسیده هستند",
    "en": "The peaches are rotten"
  },
  {
    "id": 1750,
    "fa": "یخچال ما بو می دهد",
    "en": "Our fridge stinks"
  },
  {
    "id": 1751,
    "fa": "چیز مهمی نیست",
    "en": "It's not a big deal"
  },
  {
    "id": 1752,
    "fa": "سقوط بازار سهام پس انداز او (مرد) را از بین برد (پاک کرد)",
    "en": "The stock market crash wiped out his savings"
  },
  {
    "id": 1753,
    "fa": "او (زن) قهوه را روی میز ریخت و مجبور شد آن را پاک کند",
    "en": "She spilled coffee on the table and had to wipe it up"
  },
  {
    "id": 1754,
    "fa": "دستمال را بگیر و آب را جذب کن",
    "en": "Take the towel and sop (/ˈsɑːp/) water up"
  },
  {
    "id": 1755,
    "fa": "کارمندم شروع به تنظیم تلفنش (مرد) در حالت شخصی در طول استراحت ناهارش کرده است",
    "en": "My employee has begun setting his phone on personal mode during his lunch break"
  },
  {
    "id": 1756,
    "fa": "(نمی یابم) من این را قابل قبول نمی دانم",
    "en": "I don't find this acceptable"
  },
  {
    "id": 1757,
    "fa": "داشتی چیکار میکردی وقتی بهت زنگ زدم؟",
    "en": "What were you doing when I called you?"
  },
  {
    "id": 1758,
    "fa": "از پیشرفت من راضی هستی؟",
    "en": "Are you satisfied with my progress?"
  },
  {
    "id": 1759,
    "fa": "باید به پسرت افتخار کنی",
    "en": "You must be proud of your son"
  },
  {
    "id": 1760,
    "fa": "چرا مربی شما استعفا داد؟",
    "en": "Why did your coach resign?"
  },
  {
    "id": 1761,
    "fa": "چگونه می توانم به آنچه می خواهم برسم؟",
    "en": "How can I get what I want?"
  },
  {
    "id": 1762,
    "fa": "منم اولش مثل تو بودم",
    "en": "I was like you at first"
  },
  {
    "id": 1763,
    "fa": "او (مرد) داره ازت سو استفاده میکنه",
    "en": "He's taking advantage of you"
  },
  {
    "id": 1764,
    "fa": "لطفا عجولانه نتیجه گیری نکن",
    "en": "Please don't jump to conclusion"
  },
  {
    "id": 1765,
    "fa": "آیا روز خوبی سر کار داشتی؟",
    "en": "Did you have a good day at work?"
  },
  {
    "id": 1766,
    "fa": "مهم نیست، این چیزها می افتد",
    "en": "It doesn't matter, these things happen"
  },
  {
    "id": 1767,
    "fa": "فکر نمی کنم تصادفی بوده باشد",
    "en": "I don't think it was an accident"
  },
  {
    "id": 1768,
    "fa": "او (مرد) به همه ما توهین کرد",
    "en": "He insulted all of us"
  },
  {
    "id": 1769,
    "fa": "آیا در اوقات فراغت خود ورزش می کنید؟",
    "en": "Do you play any sports in your free time?"
  },
  {
    "id": 1770,
    "fa": "دوستان باید بدون هیچ انتظاری به یکدیگر کمک کنند",
    "en": "Friends must help each other without expectation"
  },
  {
    "id": 1771,
    "fa": "من متعهد هستم که آزادانه در مورد چگونگی بهبود دنیای خود فکر کنم",
    "en": "I'm committed to thinking freely about how to improve our world"
  },
  {
    "id": 1772,
    "fa": "نصف اعضای هیئت علمی رفته اند",
    "en": "Half of the faculty is gone",
    "desc": "The choice between \"is\" and \"has\" often depends on regional preferences and the style guide you are following. In American English, for instance, you might hear \"is gone\" more frequently, while in British English, \"has gone\" might be more common. Ultimately, both are grammatically acceptable."
  },
  {
    "id": 1773,
    "fa": "از شما می خواهم که محتاط باشید",
    "en": "I want you to be cautious"
  },
  {
    "id": 1774,
    "fa": "وقتی بچه بودم فکر می کردم اگر بتونم راهی برای ترکیب پول و علم پیدا کنم، زندگی ام عالی میشه",
    "en": "When I was a kid, I thought, if I could find a way to combine money and science, my life would be perfect"
  },
  {
    "id": 1775,
    "fa": "تئوری فقط شما را تا اینجا پیش خواهد برد",
    "en": "Theory will take you only so far"
  },
  {
    "id": 1776,
    "fa": "او (مرد) خودش را کشت, اولین باری که سرش را از سنگر بیرون آورد",
    "en": "He got himself killed the first time he popped his head out of the trench"
  },
  {
    "id": 1777,
    "fa": "درک زنان هم سن و سال من بسیار رو به کاهش است",
    "en": "The perception of women of my age is so reductive"
  },
  {
    "id": 1778,
    "fa": "دارن طلاق میگیرن",
    "en": "They're getting a divorce"
  },
  {
    "id": 1779,
    "fa": "بیگانه نکنید, تنها افرادی را در جهان که می دانند شما چه کار میکنید",
    "en": "Don't alienate (/ˈeɪliəneɪt/) the only people in the world that understand what you do"
  },
  {
    "id": 1780,
    "fa": "ماهانه چه حقوقی می گیرید؟",
    "en": "What do you get paid a month?"
  },
  {
    "id": 1781,
    "fa": "بس کن اینقدر ساده لوح لعنتی",
    "en": "Stop being so goddamn naive"
  },
  {
    "id": 1782,
    "fa": "من اولین پرسشنامه امنیتی خود را پر کردم",
    "en": "I filled out my first security questionnaire"
  },
  {
    "id": 1783,
    "fa": "خجالت میکشم بپرسم",
    "en": "I'm ashamed to ask"
  },
  {
    "id": 1784,
    "fa": "برای آن هزینه ای باید پرداخت شود",
    "en": "There is a price to be paid for that"
  },
  {
    "id": 1785,
    "fa": "جهان در مسیر جدیدی در حال چرخش است",
    "en": "The world is pivoting (/ˈpɪvət/) in some new direction"
  },
  {
    "id": 1786,
    "fa": "آیا می توانم روی کمک شما حساب کنم؟",
    "en": "Can I count on your help?"
  },
  {
    "id": 1787,
    "fa": "من همیشه در خدمت شما هستم",
    "en": "I'm always at your service"
  },
  {
    "id": 1788,
    "fa": "نگران نباش, من ناامیدت نمی کنم",
    "en": "Don't worry, I won't let you down"
  },
  {
    "id": 1789,
    "fa": "باز هم تویی؟",
    "en": "Is that you again?"
  },
  {
    "id": 1790,
    "fa": "آیا او (مرد) هنوز از دستت عصبانیه؟",
    "en": "Is he still angry with you?"
  },
  {
    "id": 1791,
    "fa": "ما اشتراکات زیادی داریم",
    "en": "We have a lot in common"
  },
  {
    "id": 1792,
    "fa": "مدت زیادی است که از او (مرد) خبری ندارم",
    "en": "I haven't heard from him for a long time"
  },
  {
    "id": 1793,
    "fa": "یه چیزی هست که میخوام باهات صحبت کنم",
    "en": "There's something that I want to talk you about"
  },
  {
    "id": 1794,
    "fa": "من چیز زیادی در موردش نمی دانم",
    "en": "I don't know much about it"
  },
  {
    "id": 1795,
    "fa": "ممکن است شغلم را از دست بدهم",
    "en": "I might lose my job"
  },
  {
    "id": 1796,
    "fa": "کاش خانه ات را نفروخته بودی",
    "en": "I wish you hadn't sold your house"
  },
  {
    "id": 1797,
    "fa": "با پولی که پس انداز کرده بودی چه کردی؟",
    "en": "What did you do with the money you had saved?"
  },
  {
    "id": 1798,
    "fa": "او (مرد) هرگز کار خود را به درستی انجام نمی دهد",
    "en": "He never does his job properly"
  },
  {
    "id": 1799,
    "fa": "من دیگر به تو نیازی ندارم",
    "en": "I don't need you anymore"
  },
  {
    "id": 1800,
    "fa": "تلافی این را سرت درمیارم",
    "en": "I'll get even with you for this"
  },
  {
    "id": 1801,
    "fa": "چطور با شوهرت آشنا شدی؟",
    "en": "How did you meet your husband?"
  },
  {
    "id": 1802,
    "fa": "من به عشق در نگاه اول اعتقادی ندارم",
    "en": "I don't believe in love at first sight"
  },
  {
    "id": 1803,
    "fa": "من شما را مسئول این مشکل می دانم",
    "en": "I hold your responsible for this problem"
  },
  {
    "id": 1804,
    "fa": "امیدوارم مدت زیادی ادامه خواهد داشت",
    "en": "It will last long hopefully"
  },
  {
    "id": 1805,
    "fa": "آیا چیزی در مورد آن روابط نامناسب یا غیراخلاقی بود؟",
    "en": "Was anything about those relationships inappropriate or unethical?"
  },
  {
    "id": 1806,
    "fa": "من کارم را بی عیب و نقص انجام دادم, حتی یک چیز تنهایی خارج از خط نبود",
    "en": "I did my job impeccably, not one single solitary thing was out of line"
  },
  {
    "id": 1807,
    "fa": "راه موفقیت بالا و پایین دارد، هرگز تسلیم نشوید",
    "en": "The road to success has its ups and downs, never give up"
  },
  {
    "id": 1807,
    "fa": "راه موفقیت بالا و پایین دارد، هرگز تسلیم نشوید",
    "en": "The road to success has its ups and downs, never give up"
  },
  {
    "id": 1808,
    "fa": "دارم فکر میکنم آیا کسی از ایران تو این گروه هست؟",
    "en": "I'm wondering if there is anyone from Iran in this group?"
  }
]
