[

  {
    "id": 10901,
    "en": "I would like to pay now, where is the cash desk?",
    "de": "Ich möchte jetzt zahlen, wo ist die Kasse?",
    "groupCode": 1
  },
  {
    "id": 10902,
    "en": "How many liters of water does the elephant drink?",
    "de": "Wie viele liter Wasser trinkt der Elefant?",
    "desc": "Wie viel: For uncountable nouns. (Wie viel Geld?)\nWie viele: For countable nouns. (Wie viele Bücher?)",
    "groupCode": 1
  },
  {
    "id": 10903,
    "en": "Your father comes home soon. I have to clean the apartment now",
    "de": "Dein Vater kommt bald nach Hause. Ich muss jetzt die Wohnung putzen",
    "groupCode": 1
  },
  {
    "id": 10904,
    "en": "I can do the dishes. Correct. That here is my apartment. I often clean the apartment, I am messy",
    "de": "Ich kann abwaschen. Richtig. Das hier ist meine Wohnung. Ich putze oft die Wohnung, ich bin unordentlich",
    "groupCode": 1
  },
  {
    "id": 10905,
    "en": "Ali goes into the kitchen and washes off (does the dishes)",
    "de": "Ali geht in die Küche und wäscht ab",
    "groupCode": 1
  },
  {
    "id": 10906,
    "en": "I believe, you are really an adult (male)",
    "de": "Ich glaube, du bist wirklich ein Erwachsener",
    "groupCode": 1
  },
  {
    "id": 10907,
    "en": "The flower shop is closed. We still need flowers for your mother. Are there flowers in the garden",
    "de": "Der Blumenladen ist geschlossen. Wir brauchen noch Blumen für deine Mutter. Gibt es Blumen im Garten",
    "groupCode": 1
  },
  {
    "id": 10908,
    "en": "I want flowers, I have to go into the flower shop",
    "de": "Ich will Blumen, ich muss in den Blumenladen gehen",
    "groupCode": 1
  },
  {
    "id": 10909,
    "en": "I often play piano and I often play with my cat",
    "de": "Ich spiele oft Klavier und Ich spiele oft mit meiner Katze",
    "groupCode": 1
  },
  {
    "id": 10910,
    "en": "Ali is definitely (in any case) coming. Ali takes a taxi",
    "de": "Ali kommt auf jeden Fall. Ali nimmt ein Taxi",
    "groupCode": 1
  },
  {
    "id": 10911,
    "en": "Please introduce yourself (formal)",
    "de": "Bitte stellen Sie sich vor",
    "groupCode": 1
  },
  {
    "id": 10912,
    "en": "Please spell (formal) kuchen. There's a zoo in the neighborhood. My children want to visit the elephant every day. He's very big and sweet (love)",
    "de": "Bitte buchstabieren Sie kuchen. Es gibt einen Zoo in dem Stadtviertal. Meine Kinder möchten den Elefanten jeden Tag besuchen. Er ist sehr groß und lieb",
    "groupCode": 1
  },
  {
    "id": 10913,
    "en": "We learn German, but German is a bit difficult",
    "de": "Wir lernen Deutsch, aber Deutsch ist ein bisschen schwer",
    "groupCode": 1
  },
  {
    "id": 10914,
    "en": "What is healthier, coffee or tea?",
    "de": "Was ist gesünder, Kaffee oder Tee?",
    "groupCode": 1
  },
  {
    "id": 10915,
    "en": "I speak three languages: My mother tongue is Persian. I speak English well and a little German. I am currently learning German",
    "de": "Ich spreche drei Sprachen: Meine Muttersprache ist Persisch. Ich spreche gut Englisch und ein bisschen Deutsch. Zurzeit lerne ich Deutsch",
    "groupCode": 1
  },
  {
    "id": 10916,
    "en": "I am a software engineer by profession. My hobbies are swimming and playing with my child",
    "de": "Ich bin Software-Ingenieur von Beruf. Meine Hobbys sind Schwimmen und mit meinem Kind spielen",
    "groupCode": 1
  },
  {
    "id": 10917,
    "en": "Please place a question (formal). I know your elephant, he is my friend",
    "de": "Bitte Stellen Sie eine Frage. Ich kenne deinen Elefanten, er ist mein Freund",
    "groupCode": 1
  },
  {
    "id": 10918,
    "en": "What do you usually eat for breakfast? Is there a bank in the neighborhood",
    "de": "Was isst du meistens zum (toward) frühstück? Gibt es eine Bank in dem Stadtviertel",
    "groupCode": 1
  },
  {
    "id": 10919,
    "en": "This is not a good idea. The student (male) is not married. Do you like the student?",
    "de": "Das ist keine gute Idee. Der Student ist nicht verheiratet, Magst du den Studenten?",
    "desc": "In German, nouns change based on their case (subject, object, etc.). When the noun is in the accusative case (i.e., it's the direct object of the sentence), the article and the noun itself may change.",
    "groupCode": 1
  },
  {
    "id": 10920,
    "en": "Buy only cucumbers and rice. Does the student live downstairs?",
    "de": "Kauft nur Gurken und Reis. Wohnt der Student unten?",
    "groupCode": 1
  },
  {
    "id": 10921,
    "en": "We have only one cucumber in the fridge. The building is very old and really high",
    "de": "Wir haben nur eine Gurke im Kühlschrank. Das Gebäude ist sehr alt und wirklich hoch",
    "groupCode": 1
  },
  {
    "id": 10922,
    "en": "Are you going to the supermarket right soon (in a moment)? I'm going into the supermarket right soon (in a moment)",
    "de": "Gehst du gleich in den Supermarkt? Ich gehe gleich in den Supermarkt",
    "groupCode": 1
  },
  {
    "id": 10923,
    "en": "The supermarket and the bakery are in the city center. I go into the bakery and into supermarket and I buy cakes",
    "de": "Der supermarkt und die bäckerei sind im stadtzentrum. ich gehe in die bäckerei und in den Supermarkt und ich kaufe Kuchen",
    "groupCode": 1
  },
  {
    "id": 10924,
    "en": "Does a pack of tomatoes cost only sixty cents?",
    "de": "Kostet eine Packung Tomaten nur sechzig Cent?",
    "groupCode": 1
  },
  {
    "id": 10925,
    "en": "I want to pay now. Where is the cash register?",
    "de": "Ich will jetzt zahlen. Wo ist die Kasse?",
    "groupCode": 1
  },
  {
    "id": 10926,
    "en": "A bag costs sixty cents and you (formal) can pack your food here. Are two bags enough?",
    "de": "Eine Tüte kostet sechzig Cent und Sie können ihr Essen hier einpacken. Sind zwei Tuten genung?",
    "groupCode": 1
  },
  {
    "id": 10927,
    "en": "Yes, I would like the receipt. I know the boy because he is my brother",
    "de": "Ja, ich möchte den kassenzettel. Ich kenne den jungen, denn er ist mein Bruder",
    "groupCode": 1
  },
  {
    "id": 10928,
    "en": "Do we really have hundred cucumbers in the garden?",
    "de": "Haben wir wirklich hundert Gurken im Garten?",
    "groupCode": 1
  },
  {
    "id": 10929,
    "en": "Do you want to invite your parents to lunch?",
    "de": "Willst du deine Eltern zum (toward) Mittagessen einladen?",
    "groupCode": 1
  },
  {
    "id": 10930,
    "en": "Which sport do you want to do? I know the student student (male). He's my neighbor. The university is nearby, and there are many students in the neighborhood.",
    "de": "Welchen Sport willst du machen? Ich kenne den Studenten. Er ist mein Nachbar. Die Universität ist in der Nahe und es gibt in dem Stadtviertel viele Studenten",
    "desc": "In German, nouns change based on their case (subject, object, etc.). When the noun is in the accusative case (i.e., it's the direct object of the sentence), the article and the noun itself may change.",
    "groupCode": 1
  },
  {
    "id": 10931,
    "en": "It is often cloudy in spring",
    "de": "Es ist oft bewölkt im frühling",
    "groupCode": 1
  },
  {
    "id": 10932,
    "en": "It is already quarter to eleven",
    "de": "Es ist schon Viertel vor elf",
    "groupCode": 1
  },
  {
    "id": 10933,
    "en": "I eat chicken with pasta on Sundays",
    "de": "Ich esse sonntags Hähnchen mit Nudeln",
    "groupCode": 1
  },
  {
    "id": 10934,
    "en": "What are you doing on March 1st?",
    "de": "Was machst du am ersten März?",
    "groupCode": 1
  },
  {
    "id": 10935,
    "en": "Exactly, the departure is at half past nine",
    "de": "Genau, die Abfahrt ist um halb zehn",
    "groupCode": 1
  },
  {
    "id": 10936,
    "en": "Ali saves the number",
    "de": "Ali speichert die Nummer",
    "groupCode": 1
  },
  {
    "id": 10937,
    "en": "Which of these banks do you know?",
    "de": "Welche dieser Banken kennst du?",
    "desc": "In \"Welche dieser Banken kennst du?\", \"dieser\" is in the genitive case because it means \"of these banks\" (a subset of banks). The genitive is needed to show this relationship.",
    "groupCode": 1
  },
  {
    "id": 10938,
    "en": "Do you speak Portuguese? No, I don't speak Portuguese so well. I speak spanish. I am spanish",
    "de": "Sprichst du Portugiesisch? Nein, Ich spreche nicht so gut Portugiesisch. Ich spreche Spanisch. Ich bin Spanier",
    "groupCode": 1
  },
  {
    "id": 10939,
    "en": "The violin is very inexpensive",
    "de": "Die Geige ist sehr günstig/billig",
    "groupCode": 1
  },
  {
    "id": 10940,
    "en": "Munich is a city in Germany",
    "de": "München ist eine Stadt in Deutschland",
    "groupCode": 1
  },
  {
    "id": 10941,
    "en": "He is Chinese and speaks Chinese and a little German",
    "de": "Er ist Chinese und spricht Chinesisch und ein bisschen Deutsch",
    "groupCode": 1
  },
  {
    "id": 10942,
    "en": "That is my German course",
    "de": "Das ist mein Deutschkurs",
    "groupCode": 1
  },
  {
    "id": 10943,
    "en": "We are 14 people and together we are 420 years old",
    "de": "Wir sind 14 Leute und zusammen sind wir 420 Jahre alt",
    "groupCode": 1
  },
  {
    "id": 10944,
    "en": "Who has a chair? The basketball game begins soon (in a moment), do you want to come along?",
    "de": "Wer hat einen Stuhl? Das Basketballspiel beginnt gleich, willst du mitkommen?",
    "groupCode": 1
  },
  {
    "id": 10945,
    "en": "She is 24 years old and saleswoman",
    "de": "Sie ist 24 Jahre alt und Verkäuferin",
    "groupCode": 1
  },
  {
    "id": 10946,
    "en": "(The) Most of time I spent with my family",
    "de": "Die meiste Zeit verbringe ich mit meiner Familie",
    "groupCode": 1
  },
  {
    "id": 10947,
    "en": "(The) Most people like pizza",
    "de": "Die meisten Leute mögen Pizza",
    "groupCode": 1
  },
  {
    "id": 10948,
    "en": "I eat usually bread for breakfast",
    "de": "Ich esse meistens Brot zum (toward) Frühstück",
    "groupCode": 1
  },
  {
    "id": 10949,
    "en": "She meets her mother in an hour in the cafe shop",
    "de": "Sie trifft ihre Mutter in einer Stunde im Café",
    "groupCode": 1
  },
  {
    "id": 10950,
    "en": "How many cucumbers do you need for the salad?",
    "de": "Wie viele Gurken brauchst du für den Salat?",
    "groupCode": 1
  },
  {
    "id": 10951,
    "en": "My husband goes to the pastry shop once a week",
    "de": "Mein Mann geht einmal pro Woche in die Konditorei",
    "groupCode": 1
  },
  {
    "id": 10952,
    "en": "I can't see the bags. I don't need a receipt",
    "de": "Ich kann die Tüten nicht sehen. Ich brauche keinen Kassenzettel",
    "groupCode": 1
  },
  {
    "id": 10953,
    "en": "Where is your turtle going so fast?",
    "de": "Wohin geht deine Schildkröte so schnell?",
    "groupCode": 1
  },
  {
    "id": 10954,
    "en": "Which seat would you (formal) like in the cinema?",
    "de": "Welchen Sitz möchten Sie im Kino?",
    "groupCode": 1
  },
  {
    "id": 10955,
    "en": "The cash register is not at the back",
    "de": "Die Kasse ist nicht hinten",
    "groupCode": 1
  },
  {
    "id": 10956,
    "en": "We need three things for my party",
    "de": "Wir brauchen drei Dinge für meine Party",
    "groupCode": 1
  },
  {
    "id": 10957,
    "en": "Can you bake a cake for me?",
    "de": "Kannst du einen Kuchen für mich backen?",
    "groupCode": 1
  },
  {
    "id": 10958,
    "en": "Mr. Zandi, thank you for your (formal) help. Ali, thank you for your help.",
    "de": "Herr Zandi, danke für ihre hilfe. Ali, danke für deine Hilfe",
    "groupCode": 1
  },
  {
    "id": 10959,
    "en": "I would definitely (in any case) like to come. Can we eat breakfast a little later? We're also going to the club tonight and want to sleep in tomorrow",
    "de": "Ich möchte Auf jeden fall kommen. Können wir ein bisschen später frühstücken? Wir gehen heute Abend noch in den Club und wollen morgen aussclafen",
    "groupCode": 1
  },
  {
    "id": 10960,
    "en": "Today is an important day, we are having (making) a party",
    "de": "Heute ist ein wichtiger Tag, wir machen eine Party",
    "groupCode": 1
  },
  {
    "id": 10961,
    "en": "She is excited, her partner's (male) birthday is soon",
    "de": "Sie ist aufgeregt, ihr Partner hat bald Geburtstag",
    "groupCode": 1
  },
  {
    "id": 10962,
    "en": "He hopes his wife likes the party. My bear is not dangerous. He is very sweet (love)",
    "de": "Er hofft seine Frau mag die Party. Mein Bär ist nicht gefährlich. Er ist sehr lieb",
    "groupCode": 1
  },
  {
    "id": 10963,
    "en": "Can you please buy carrots this afternoon? My pets love carrots",
    "de": "Kannst du bitte heute Nachmittag Karotten kaufen? Meine Haustiere lieben Karotten",
    "groupCode": 1
  },
  {
    "id": 10964,
    "en": "Are you bringing along a cake? There is a bear in the neighborhood",
    "de": "Bringst du einen Kuchen mit? Es gibt einen Bären in dem Stadtviertel",
    "desc": "In German, when you use \"Es gibt\" (there is/are), it's a special case that requires the accusative for the object, not the nominative. So, even though you might expect nominative (because you're saying something exists), the correct case is accusative.",
    "groupCode": 1
  },
  {
    "id": 10965,
    "en": "I'm bringing along chocolate to (toward) the party. I bring along a gift for you",
    "de": "Ich bringe Schokolade zur Party mit. Ich bringe ein Geschenk für dich mit",
    "groupCode": 1
  },
  {
    "id": 10966,
    "en": "You don't have to bring along gifts to (toward) the party",
    "de": "Du musst keine Geschenke zur Party mitbringen",
    "groupCode": 1
  },
  {
    "id": 10967,
    "en": "How many presents does Ali get? Who's coming later? With whom do you want to watch TV?",
    "de": "Wie viele Geschenke bekommt Ali? Wer kommt später? Mit wem willst du fernsehen?",
    "groupCode": 1
  },
  {
    "id": 10968,
    "en": "I have to pick up my parents earlier. This woman knows you, do you know her?",
    "de": "Ich muss meine Eltern früher abholen. Diese Frau kennt dich, kennst du sie?",
    "groupCode": 1
  },
  {
    "id": 10969,
    "en": "Are you picking up your parents ? No, this woman is not my neighbor (female). We are married and live together. That is my wife",
    "de": "Holst du deine Eltern ab? Nein, diese Frau ist nicht meine Nachbarin. Wir sind verheiratet und wohnen zusammen. Das ist meine Frau",
    "groupCode": 1
  },
  {
    "id": 10970,
    "en": "Whom do I pick up? I'm not paying any bills this month, you pay everything",
    "de": "Wen hole ich ab? Ich zahle diesen monat keine Rechnungen, du zahlst alles",
    "groupCode": 1
  },
  {
    "id": 10971,
    "en": "For Whom are you buying the gifts? We want to fly to Turkey for a few days",
    "de": "Für wen kaufst du die Geschenke? Wir wollen für ein paar tage in die Türkei fliegen",
    "desc": "The preposition \"in\" is used when referring to entering or traveling to a country \n\n\n The preposition \"zu\" is generally used when referring to going to a specific place, person, or event (e.g., \"zur Schule\" = to school, \"zum Arzt\" = to the doctor). It is not used for countries",
    "groupCode": 1
  },
  {
    "id": 10972,
    "en": "The food is bland",
    "de": "Das Essen ist fade",
    "groupCode": 1
  },
  {
    "id": 10973,
    "en": "My mother picks up eight bottles of wine. My girlfriend and I are eating breakfast with my mom",
    "de": "Meine Mutter holt acht Flaschen wein ab. Meine Freundin und ich frühstücken mit meiner Mama",
    "groupCode": 1
  },
  {
    "id": 10974,
    "en": "The house is dirty, we have to clean it. Who is that? Who are you going to the movies to see?",
    "de": "Das Haus ist schmutzig, wir müssen es putzen. Wer ist das? Wem gehst du inst Kino?",
    "groupCode": 1
  },
  {
    "id": 10975,
    "en": "The train arrives in forty-five minutes. My brother pick Ali up from the train station, then they come to (toward) the party together",
    "de": "Der Zug kommt in fünfundvierzig Minuten. Mein Bruder holt Ali vom Bahnhof ab, dann kommen sie zusammen zur Party",
    "groupCode": 1
  },
  {
    "id": 10976,
    "en": "I have a request, can you find a band?",
    "de": "Ich habe eine Bitte, kannst du eine Band finden?",
    "groupCode": 1
  },
  {
    "id": 10977,
    "en": "The gift is boring. I don't like it \n Who can continue?",
    "de": "Das Geschenk ist langweilig. Ich mag es nicht \n Wer kann weiter machen?",
    "groupCode": 1
  },
  {
    "id": 10978,
    "en": "I have to speak to you (formal), do you (formal) have a moment?",
    "de": "Ich muss mit ihnen sprechen, haben Sie einen Moment?",
    "groupCode": 1
  },
  {
    "id": 10979,
    "en": "I'm sorry, I'm nervous because I don't understand the question",
    "de": "Es tut mir leid, ich bin nervös, denn ich verstehe die Frage nicht",
    "groupCode": 1
  },
  {
    "id": 10980,
    "en": "We have to give the forms to the boss (female). I was distracted and didn’t listen",
    "de": "Wir müssen die Formulare der Chefin geben. Ich war abgelenkt und habe nicht zugehört",
    "groupCode": 1
  },
  {
    "id": 10981,
    "en": "I don't understand this word, what does it mean? I was so absent-minded. I forgot my key",
    "de": "Ich verstehe dieses Wort nicht, was bedeutet es? Ich war so geistesabwesend. Ich habe meinen Schlüssel vergessen",
    "groupCode": 1
  },
  {
    "id": 10982,
    "en": "I don't understand the question, do you understand it? I am doing training as a mechanic",
    "de": "Ich verstehe die Frage nicht, verstehst du sie? Ich mache eine Ausbildung als Mechanike",
    "groupCode": 1
  },
  {
    "id": 10983,
    "en": "We drive almost always by the street car. The traffic in the city is very slow",
    "de": "Wir fahren fast immer mit der Straßenbahn. Der Verkehr in der Stadt ist sehr langsam",
    "groupCode": 1
  },
  {
    "id": 10984,
    "en": "I ride with the bike to (toward) the embassy and of course I wear my bike helmet",
    "de": "Ich fahre mit dem Fahrrad zur Botschaft und natürlich trage ich meinen Fahrradhelm",
    "groupCode": 1
  },
  {
    "id": 10985,
    "en": "I usually drive with the bus to the bank. I am single and have no children",
    "de": "Ich fahre meistens mit dem Bus zur Bank. Ich bin ledig und habe keine Kinder",
    "groupCode": 1
  },
  {
    "id": 10986,
    "en": "I'm staying home because I'm sick",
    "de": "\n 1.Ich bleibe zu Hause, weil ich krank bin \n 2.Ich bleibe zu Hause, denn ich bin krank",
    "desc": "weil → verb at end\n\ndenn → verb in normal spot",
    "groupCode": 1
  },
  {
    "id": 10987,
    "en": "I'm paying these bills this month, but can you pay the rent? I'm looking for a new job and pay again next time",
    "de": "Ich zahle diesen Monat die Rechnungen. aber kannst du die Miete zahlen? Ich suche einen neuen Job und zahle nächstes Mal wieder",
    "groupCode": 1
  },
  {
    "id": 10988,
    "en": "I go hiking in the Black Forest with my brother this summer. I'm pleased because we're also camping there",
    "de": "Ich gehe diesen Sommer mit meinem Bruder im Schwarzwald wandern. Ich frue mich, denn wir campen dort auch",
    "groupCode": 1
  },
  {
    "id": 10989,
    "en": "We always read in the morning. My parents read the newspaper, and I read a children's book with my niece. She cannot read alone yet",
    "de": "Wir lesen morgens immer. Meine Eltern lesen die Zeitung und ich lese mit meiner Nichte ein Kinderbuch. Sie kann noch nicht allein lesen",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "Are you coming? The class starts soon (in a moment)",
    "de": "Kommt ihr? Der Unterricht fängt gleich an",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "Sometimes we watch movies in German course",
    "de": "Manchmal sehen wir im Deutschkurs Filme an",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "We want to learn German together. Are you joining in (Do you participate)?",
    "de": "Wir wollen zusammen Deutsch lernen. Machst du mit?",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "Is there no class today? Oh, I did not receive the information",
    "de": "Heute ist kein Unterricht? Oh, ich habe die Information nicht bekommen",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "In our German class, we took photos of food and made a photo dictionary.\nAt home, I looked at the dictionary repeatedly and learned the words.\nIt worked well!",
    "de": "Im Deutschkurs haben wir Essen fotografiert und ein Foto-Wörterbuch gemacht.\nZu Hause habe ich das Wörterbuch immer wieder angesehen und die Wörter gelernt.\nDas hat gut funktioniert!",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "Last Tuesday, we played a chain game in class.\nAli started, and then everyone joined in. It was great",
    "de": "Letzten Dienstag haben wir im Kurs ein Kettenspiel gespielt.\nAli hat angefangen, dann haben alle mitgemacht. Das war toll",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "Yesterday I called my friend Ali.\nWe were studying together in Zagreb.\nWe talked on the phone for three hours – and only spoke German!",
    "de": "Gestern habe ich meinen Freund Ali angerufen.\nWir haben zusammen in Zagreb studiert.\nDrei Stunden haben wir telefoniert – und nur Deutsch gesprochen!",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Ich habe mit meinem Sohn gespielt, gelernt und meine Hausaufgaben gemacht",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Ich bin im Museum. bist du dort? (positiopn) Ich gehe ins Museum. Gehst du dorthin?",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Was hast du letztes Wochenende gemacht?",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Ich habe Freunde getroffen",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Seid ihr in einen Club gegangen?",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Ja, und wir haben den ganzen Abend getanzt",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Hat das Spaß gemacht?",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Gestern bin ich um 7 Uhr aufgestanden und habe das Frühstück gemacht.",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Dann sind die Kinder in den Kindergarten gegangen und ich bin mit dem Bus zum Büro gefahren",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Dort habe ich bis 16 Uhr gearbeitet",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Danach habe ich die Kinder abgeholt.",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Zu Hause habe ich die Wohnung geputzt und Abendessen gekocht.",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Am Abend hat Emir aus Rom angerufen und wir haben lange telefoniert",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "",
    "groupCode": 1
  }




  140

  gefallen
  das essen gefallt dem kind

  143-7









]
