[


  {
    "id": ,
    "en": "Sometimes we watch movies in German course",
    "de": "Manchmal sehen wir im Deutschkurs Filme an",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "We want to learn German together. Are you joining in (Do you participate)?",
    "de": "Wir wollen zusammen Deutsch lernen. Machst du mit?",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "Is there no class today? Oh, I did not receive the information",
    "de": "Heute ist kein Unterricht? Oh, ich habe die Information nicht bekommen",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "In our German class, we took photos of food and made a photo dictionary.\nAt home, I looked at the dictionary repeatedly and learned the words.\nIt worked well!",
    "de": "Im Deutschkurs haben wir Essen fotografiert und ein Foto-Wörterbuch gemacht.\nZu Hause habe ich das Wörterbuch immer wieder angesehen und die Wörter gelernt.\nDas hat gut funktioniert!",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "Last Tuesday, we played a chain game in class.\nAli started, and then everyone joined in. It was great",
    "de": "Letzten Dienstag haben wir im Kurs ein Kettenspiel gespielt.\nAli hat angefangen, dann haben alle mitgemacht. Das war toll",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "Yesterday I called my friend Ali.\nWe were studying together in Zagreb.\nWe talked on the phone for three hours – and only spoke German!",
    "de": "Gestern habe ich meinen Freund Ali angerufen.\nWir haben zusammen in Zagreb studiert.\nDrei Stunden haben wir telefoniert – und nur Deutsch gesprochen!",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Ich habe mit meinem Sohn gespielt, gelernt und meine Hausaufgaben gemacht",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Ich bin im Museum. bist du dort? (positiopn) Ich gehe ins Museum. Gehst du dorthin?",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Was hast du letztes Wochenende gemacht?",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Ich habe Freunde getroffen",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Seid ihr in einen Club gegangen?",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Ja, und wir haben den ganzen Abend getanzt",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Hat das Spaß gemacht?",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Gestern bin ich um 7 Uhr aufgestanden und habe das Frühstück gemacht.",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Dann sind die Kinder in den Kindergarten gegangen und ich bin mit dem Bus zum Büro gefahren",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Dort habe ich bis 16 Uhr gearbeitet",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Danach habe ich die Kinder abgeholt.",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Zu Hause habe ich die Wohnung geputzt und Abendessen gekocht.",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "Am Abend hat Emir aus Rom angerufen und wir haben lange telefoniert",
    "groupCode": 1
  },
  {
    "id": ,
    "en": "",
    "de": "",
    "groupCode": 1
  }




  140

  gefallen
  das essen gefallt dem kind

  143-7









]
