[
  {
    "id": 3001,
    "fa": "از غذای آن رستوران مسمومیت غذایی گرفتم. من دیگر هرگز آنجا نمی روم",
    "en": "I got food poisoning from the food at that restaurant. I'm never going there again",
    "desc": "\"I'm never going there again.\"\n\nPresent continuous; suggests a strong, immediate decision.\n\"I will never go there again.\"\n\nSimple future; emphasizes a definite decision about the future.",
    "groupCode": 0
  },
  {
    "id": 3002,
    "fa": "تو باید کمی بخوابی (کمی خواب بگیری) چون دیر شده",
    "en": "You should get some sleep because it's getting late",
    "groupCode": 0
  },
  {
    "id": 3003,
    "fa": "بیرون داره سرد میشه",
    "en": "\n 1.It's getting cold outside \n 2.It's becoming cold outside",
    "groupCode": 0
  },
  {
    "id": 3004,
    "fa": "او (مرد) خیلی راحت عصبانی می شود",
    "en": "\n 1.He gets angry very easily \n 2.He becomes angry very easily",
    "groupCode": 0
  },
  {
    "id": 3005,
    "fa": "فکر می کنید خواننده های معروف هنوز روی صحنه عصبی می شوند؟",
    "en": "Do you think famous singers still get nervous on stage?",
    "groupCode": 0
  },
  {
    "id": 3006,
    "fa": "من هنوز آماده نیستم اما من باید آماده شوم",
    "en": "I'm not ready yet but I have to get ready",
    "desc": "",
    "groupCode": 0
  },
  {
    "id": 3007,
    "fa": "Be یک حالت را توصیف می کند و Get یک عمل را توصیف می کند",
    "en": "Be describes a state and Get describes an action",
    "groupCode": 0
  },
  {
    "id": 3008,
    "fa": "در سال ۱۹۴۷, والدینم ازدواج نکرده بودند. آنها مجرد بودند. والدینم در سال ۱۹۴۸ ازدواج کردند",
    "en": "In 1947, my parents weren't married. They were single. My parents got married in 1948",
    "groupCode": 0
  },
  {
    "id": 3009,
    "fa": "هیچ چیز بیشتر از میهن پرستی به انسان قدرت نمی دهد",
    "en": "Nothing empowers man more than patriotism",
    "groupCode": 0
  },
  {
    "id": 3010,
    "fa": "آن مکان چند تا سرسره دارد؟",
    "en": "How many slides does that place have?",
    "groupCode": 0
  },
  {
    "id": 3011,
    "fa": "نه یعنی نه",
    "en": "No means no",
    "groupCode": 0
  },
  {
    "id": 3012,
    "fa": "چگونه قرار است به آن پاسخ دهم؟",
    "en": "How am I supposed to respond to that?",
    "groupCode": 0
  },
  {
    "id": 3013,
    "fa": "باتری گوشیم تموم شده",
    "en": "My phone battery is dead",
    "groupCode": 0
  },
  {
    "id": 3014,
    "fa": "من کابل دارم. من فقط به یک سر شارژر نیاز دارم",
    "en": "I have the cable. I just need a charger brick",
    "groupCode": 0
  },
  {
    "id": 3015,
    "fa": "پریز برق کجاست؟",
    "en": "Where is the outlet?",
    "groupCode": 0
  },
  {
    "id": 3016,
    "fa": "من این مشکل را از زمانی که یادم می آید داشتم",
    "en": "I have had this problem as long as I remember",
    "groupCode": 0
  },
  {
    "id": 3017,
    "fa": "آیا می توانم فردا با شلوارک به آفیس بیام؟",
    "en": "Can I come to office wearing shorts tomorrow?",
    "groupCode": 0
  },
  {
    "id": 3018,
    "fa": "ورق ها را بُر بزن و به هر بازیکن هفت تا بده",
    "en": "Shuffle the cards and deal out seven to each player",
    "groupCode": 0
  },
  {
    "id": 3019,
    "fa": "به احتمال زیاد است که فردا باران خواهد بارید",
    "en": "\n 1.It's highly likely that it will rain tomorrow \n 2.It's most likely that it will rain tomorrow",
    "groupCode": 0
  },
  {
    "id": 3020,
    "fa": "آنها می توانند آنالیز کنند چگونه مردم کار را انجام می دهند",
    "en": "They can analyze how people get work done",
    "groupCode": 0
  },
  {
    "id": 3021,
    "fa": "ما نیاز داریم این پروژه را تا پایان هفته انجام بدیم (به پایان برسانیم)",
    "en": "We need to get this project done by the end of the week",
    "groupCode": 0
  },
  {
    "id": 3022,
    "fa": "ما اجازه نداریم از مردمی که نمی شناسیم چک بگیریم",
    "en": "We are not allowed to take checks from people we don't know",
    "groupCode": 0
  },
  {
    "id": 3023,
    "fa": "من مقداری شک دارم در مورد کاری که برای شما انجام می دهند",
    "en": "I have some doubts about what they do for you",
    "groupCode": 0
  },
  {
    "id": 3024,
    "fa": "کدامیک صحیح است؟ مختصر توضیح دهید",
    "en": "Which one is correct? Explain briefly",
    "groupCode": 0
  },
  {
    "id": 3025,
    "fa": "دی وی دی مال کیا هستند؟",
    "en": "Whose DVDs are they?",
    "groupCode": 0
  },
  {
    "id": 3026,
    "fa": "من دیشب زود رسیدم خونه",
    "en": "\n 1.I arrived home early last night \n 2.I got home early last night",
    "desc": "You use \"at\" with \"home\" in certain contexts, particularly when emphasizing location or presence rather than movement",
    "groupCode": 0
  },
  {
    "id": 3027,
    "fa": "کی علی معمولاً خریدش را انجام می دهد؟",
    "en": "When does Ali usually do his shopping?",
    "groupCode": 0
  },
  {
    "id": 3028,
    "fa": "اون یک عکس قدیمی از پدرم است زمانیکه موهای بلند داشت",
    "en": "That's an old photo of my father when he had long hair",
    "groupCode": 0
  },
  {
    "id": 3029,
    "fa": "من قصد دارم برای تولدش (زن) به او یک کتاب بدهم",
    "en": "I'm gonna give her a book for her birthday",
    "groupCode": 0
  },
  {
    "id": 3030,
    "fa": "ویسکی از چه چیزی ساخته شده است؟",
    "en": "What is whiskey made of?",
    "groupCode": 0
  },
  {
    "id": 3031,
    "fa": "وقتی جلسه تمام شد، این یادداشت را به او (زن) بدهید",
    "en": "\n 1.When the meeting is over, give her this note \n 2.When the meeting finishes, give her this note",
    "groupCode": 0
  },
  {
    "id": 3032,
    "fa": "اون یکی است مثل این یکیه",
    "en": "That one is the same as this one",
    "groupCode": 0
  },
  {
    "id": 3033,
    "fa": "\n 1.& \n 2.' \n 3.* \n 4.{} \n 5._ \n 6.|",
    "en": "\n 1.Ampersand (And) \n 2.Apostrophe (Single Quotation Mark) \n 3.Asterisk (Star) \n 4.Braces \n 5.Underscore \n 6.Pipe",
    "groupCode": 0
  },
  {
    "id": 3034,
    "fa": "من یک احساسی دارم او (زن) من را خیلی دوست ندارد",
    "en": "\n 1.I gotta feeling she doesn't like me very much \n 2.I have a feeling she doesn't like me very much",
    "desc": "Gotta = Got a = Have a",
    "groupCode": 0
  },
  {
    "id": 3035,
    "fa": "من کم خونی دارم و به آهن بیشتری نیاز دارم",
    "en": "I have anemia (/əˈnēmēə/ انیمیا) and need more iron",
    "groupCode": 0
  },
  {
    "id": 3036,
    "fa": "یه یاد نمیارم پرسیده باشم",
    "en": "I don't recall asking",
    "groupCode": 0
  },
  {
    "id": 3037,
    "fa": "دیشب ماشین لباسشویی ما خراب شد",
    "en": "Last night our washing machine broke down",
    "groupCode": 0
  },
  {
    "id": 3038,
    "fa": "کلاه سوزان به اندازه مال تو گران است",
    "en": "Susan's hat is as expensive as yours",
    "groupCode": 0
  },
  {
    "id": 3039,
    "fa": "او (مرد) نه شراب می نوشد و نه آبجو",
    "en": "He doesn't drink neither wine nor beer",
    "groupCode": 0
  },
  {
    "id": 3040,
    "fa": "از آنجایی که در این لحظه داره باران نمی بارد، من برای قدم زدن بیرون خواهم رفت",
    "en": "As it isn't raining at the moment, I'll go out for a walk",
    "groupCode": 0
  },
  {
    "id": 3041,
    "fa": "من قول دادم او (زن) را ببرم دفعه بعد (که) آنها در شهر اجرا می کنند",
    "en": "I promised to take her the next time they perform in town",
    "groupCode": 0
  },
  {
    "id": 3042,
    "fa": "خواهرانش به او (مرد) گفتند او خیلی پیر شده است برای تماشای کارتون ها",
    "en": "Her sisters told him he was getting too old to watch cartoons",
    "groupCode": 0
  },
  {
    "id": 3043,
    "fa": "مادرم معمولاً چیز خوبی می پزد برای ناهار یکشنبه",
    "en": "My mother usually cooks something nice for Sunday lunch",
    "groupCode": 0
  },
  {
    "id": 3044,
    "fa": "من قهوه نمیخورم (نمی نوشم) و خواهرم نمی خوره (نمی نوشه)",
    "en": "I don't drink coffee and neither does my sister",
    "groupCode": 0
  },
  {
    "id": 3045,
    "fa": "من فکر می کنم او (مرد) را می شناسم. من شاید سال گذشته در یک پارتی با او ملاقات کرده باشم",
    "en": "I think I know him. I may have met him last year at a party",
    "groupCode": 0
  },
  {
    "id": 3046,
    "fa": "من بهت ایمیل خواهم زد وقتی رسیدم آنجا",
    "en": "I'll email you when I get there",
    "groupCode": 0
  },
  {
    "id": 3047,
    "fa": "من مایلم شما را به جایی که مادرتان را ملاقات کردم ببرم",
    "en": "I would like to take you to the place where I met your mother",
    "groupCode": 0
  },
  {
    "id": 3048,
    "fa": "اگر او (زن) را دیده بودم, من از او پرسیده بودم",
    "en": "If I had seen her, I would have asked her",
    "groupCode": 0
  },
  {
    "id": 3049,
    "fa": "علی خوشحال به نظر می رسد",
    "en": "Ali looks happy",
    "groupCode": 0
  },
  {
    "id": 3050,
    "fa": "او (زن) حتی به ما نگاه نکرد! اون چیزی است که من دوست نداشتم",
    "en": "She didn't even look at us! That's what I didn't like",
    "groupCode": 0
  },
  {
    "id": 3051,
    "fa": "اگه از من میخوای بیام, فقط بپرس",
    "en": "If you want me to come, just ask",
    "groupCode": 0
  },
  {
    "id": 3052,
    "fa": "من نمی دانستم آیا ادامه دهم یا توقف کنم",
    "en": "I didn't know whether to go on or stop",
    "groupCode": 0
  },
  {
    "id": 3053,
    "fa": "من نتونستم او (زن) را پیدا کنم. او می بایستی خرید رفته باشه",
    "en": "I couldn't find her. She must have gone shopping",
    "groupCode": 0
  },
  {
    "id": 3054,
    "fa": "او (زن) هرگز مرا قبلاً ندیده است. او (زن) داره منو با یکی دیگه اشتباه میگیره",
    "en": "She has never seen me before. She's confusing me with someone else",
    "groupCode": 0
  },
  {
    "id": 3055,
    "fa": "ارائه آنها یک موفقیت بود، اگرچه آنها آن را به خیلی خوب آماده نکرده بودند",
    "en": "Their presentation was a success, though they hadn't prepared it very well",
    "desc": "\"Although\": Used at the beginning of a sentence or clause to contrast.\n\nE.g., \"Although they hadn't prepared it well, the presentation was a success.\"\n\"Though\": Can be used at the end of a sentence for contrast, or at the beginning.\n\nE.g., \"Their presentation was a success, though they hadn't prepared it well.\"\n\n\n\n\n\n",
    "groupCode": 0
  },
  {
    "id": 3056,
    "fa": "من همیشه دستکش ظرفشویی می پوشم تا از دستانم در برابر آب داغ و مواد شوینده محافظت کنم",
    "en": "I always wear dishwashing gloves to protect my hands from hot water and detergent",
    "groupCode": 0
  },
  {
    "id": 3057,
    "fa": "من (مودبانه) از شما می خواهم یک بار دیگر آن را چک کنید",
    "en": "I would like you to check it once again",
    "groupCode": 0
  },
  {
    "id": 3058,
    "fa": "آنها در اوایل روز شروع کردند، بنابراین آنها مدیریت کردن به موقع تمام کنند",
    "en": "They started early in the day, so they managed to finish on time",
    "groupCode": 0
  },
  {
    "id": 3059,
    "fa": "فکر می کنی ما تا ساعت هفت تمام خواهیم کرد؟ من می ترسم که نه",
    "en": "Do you think we'll finish by seven o'clock? I'm afraid not",
    "groupCode": 0
  },
  {
    "id": 3060,
    "fa": "قطار چقدر طول می کشد تا به لندن برسد؟",
    "en": "\n 1.How long does the train take to reach London? \n 2.How long does the train take to get to London?",
    "groupCode": 0
  },
  {
    "id": 3061,
    "fa": "علی تنها در باغ با خودش نشسته بود (داشت)",
    "en": "Ali was sitting by himself in the garden",
    "groupCode": 0
  },
  {
    "id": 3062,
    "fa": "شام به زودی آماده خواهد شد، اما ما هنوز وقت داریم برای یک نوشیدنی",
    "en": "\n 1.Dinner will be ready soon, but we still have time for a drink \n 2.Dinner will be ready presently, but we still have time for a drink",
    "desc": "Dinner will be ready soon:\nMeaning: Dinner will be ready in a short amount of time.\nTone: Informal and common in everyday speech.\nDinner will be ready presently:\nMeaning: Dinner will be ready very shortly.\nTone: Slightly more formal and can sound old-fashioned.\nKey Difference:\n\"Soon\" is more casual and flexible.\n\"Presently\" is more formal and suggests it will happen very soon.",
    "groupCode": 0
  },
  {
    "id": 3063,
    "fa": "بچه های زیادی از مدرسه ما در مسابقه شرکت کردند",
    "en": "A lot of kids from our school participated in the race",
    "groupCode": 0
  },
  {
    "id": 3064,
    "fa": "من مطمئنم او (زن) بدش نمی آید که به من لطفی کند",
    "en": "I'm sure she wouldn't mind doing me a favor",
    "desc": "\"To do\": The infinitive form \"to do\" is not used after \"wouldn't mind.\"",
    "groupCode": 0
  },
  {
    "id": 3065,
    "fa": "من از خواب بیدار شدم و دیگر نتوانستم بخوابم",
    "en": "I woke up and couldn't get back to sleep",
    "groupCode": 0
  },
  {
    "id": 3066,
    "fa": "او (زن) به من خیانت کرده است. من فکر کنم نامزدیمون رو قطع خواهم کرد",
    "en": "She has been cheating on me. I think I'll break off our engagement",
    "desc": "\"Break up\" is mostly used for romantic relationships.\n\"Break off\" can be used more broadly, including engagements, negotiations, or other formal agreements.",
    "groupCode": 0
  },
  {
    "id": 3067,
    "fa": "ما فکر می کنیم این عکس خیلی شبیه عکس دیگری است",
    "en": "We think this picture is very much like another",
    "groupCode": 0
  },
  {
    "id": 3068,
    "fa": "آنها مطمئناً انتظار نداشتند همه برای جلسه حاضر شوند",
    "en": "They certainly didn't expect everyone to turn up for the meeting",
    "groupCode": 0
  },
  {
    "id": 3069,
    "fa": "من نگاهی کوتاه به ساعتم انداختم تا زمان را چک کنم",
    "en": "I glanced at my watch to check the time",
    "desc": "Glance: A quick, deliberate look. For example, \"She glanced at her phone.\"",
    "groupCode": 0
  },
  {
    "id": 3070,
    "fa": "او (مرد) نگاهی تصادفی به سلبریتی انداخت که او (زن) با عجله از کنارش گذشت",
    "en": "He caught a glimpse of the celebrity as she quickly passed",
    "desc": "A brief, often accidental view. For example, \"He caught a glimpse of the deer in the forest.",
    "groupCode": 0
  },
  {
    "id": 3071,
    "fa": "یک نفر کلاهی مثل کلاه من در اتاق جا گذاشت",
    "en": "Somebody left a hat like mine in the room",
    "groupCode": 0
  },
  {
    "id": 3072,
    "fa": "از همون خیلی اول دروغ گفتی",
    "en": "From the very beginning you lied",
    "groupCode": 0
  },
  {
    "id": 3073,
    "fa": "اگر ایده ای به من میدهید، احتمالاً بدترین چیزی (که) میتوانید بگویید (این) است (که) 'تصور کنی اگر بخواهی'",
    "en": "If you're pitching me an idea, probably the worst thing you can say is 'Imagine if you will'",
    "groupCode": 0
  },
  {
    "id": 3074,
    "fa": "صداقت برای من مهم است",
    "en": "Honesty is important to me",
    "desc": "to me: Opinion",
    "groupCode": 0
  },
  {
    "id": 3075,
    "fa": "برای من مهم است که ادامه بدی ورزش منظم",
    "en": "It's important for me to keep up regular exercise",
    "desc": "For me: Benefit",
    "groupCode": 0
  },
  {
    "id": 3076,
    "fa": "در زیر سه سهم سمی است برای فروش در اسرع وقت قبل از شیرجه اجتناب ناپذیر آنها به پایینتر",
    "en": "Below are three toxic stocks to sell ASAP before they inevitably plunge lower",
    "groupCode": 0
  },
  {
    "id": 3077,
    "fa": "ما نیاز داریم نسخه را بالا (بامپ) ببریم",
    "en": "We need to bump the version",
    "groupCode": 0
  },
  {
    "id": 3078,
    "fa": "بزاق من می سازد پلاک بیشتر از (مال) یک شخص معمولی",
    "en": "My saliva /səˈlaɪvə/ makes more plaque /ˈplæk/ than a normal person's.",
    "groupCode": 0
  },
  {
    "id": 3079,
    "fa": "این احتمال وجود دارد که جلسه مجدداً زمانبندی خواهد شد",
    "en": "It's likely that the meeting will be rescheduled",
    "groupCode": 0
  },
  {
    "id": 3080,
    "fa": "شما نیاز خواهید داشت یک صلاحیت در مددکاری (کار) اجتماعی کسب کنید",
    "en": "You'll need to acquire a qualification in social work",
    "groupCode": 0
  },
  {
    "id": 3081,
    "fa": "لباس ها خشک شدند هنوز؟",
    "en": "Are the clothes dry yet?",
    "groupCode": 0
  },
  {
    "id": 3082,
    "fa": "یک شانس کمی (باریک) است برای گرفتن یک جای پارک در مرکز شهر",
    "en": "It's a slim chance of getting a parking spot downtown",
    "groupCode": 0
  },
  {
    "id": 3083,
    "fa": "انواع کفش ها برای مناسبت های مختلف: کفش های کتانی بند دار برای دویدن، چکمه های کش دار برای روزهای بارانی، کفش های راحتی برای بیرون رفتن های معمولی، و چکمه های زیپ دار برای یک ظاهر شیک",
    "en": "Types of shoes for various occasions: lace-up sneakers for running, pull-on boots for rainy days, slip-on loafers for casual outings, and zip-up boots for a stylish touch",
    "groupCode": 0
  },
  {
    "id": 3084,
    "fa": "شما می توانید تا دیروقت بیرون بمانید به شرطی که (تا زمانی که) تو به من اطلاع بدی کجا هستی",
    "en": "You can stay out late so long as you let me know where you are",
    "groupCode": 0
  },
  {
    "id": 3085,
    "fa": "چه می بره (چه چیزی لازم است) اگر می تونستی آن را در یک کلمه خلاصه کنی؟",
    "en": "What does it take if you could summarize it in one word?",
    "groupCode": 0
  },
  {
    "id": 3086,
    "fa": "دو ثروتمندترین مرد روی زمین نتونستند همسرشان را خوشحال نگه دارند، چه امیدی دارید؟",
    "en": "The two richest men on Earth couldn't keep their wives happy, what hope do you have?",
    "groupCode": 0
  },
  {
    "id": 3087,
    "fa": "قرار بده یک گلدان از گل های تازه را روی میز برای یک ظاهر شیک",
    "en": "Place a vase of fresh flowers on the table for a stylish touch",
    "groupCode": 0
  },
  {
    "id": 3088,
    "fa": "اضافه کن یک روسری به لباس (ست کامل) خودت برای یک ظاهر شیک",
    "en": "Add a scarf to your outfit for a stylish touch",
    "groupCode": 0
  },
  {
    "id": 3089,
    "fa": "بپیچ هدیه را با یک روبان برای یک ظاهر شیک",
    "en": "Wrap the present with a ribbon for a stylish touch",
    "groupCode": 0
  },
  {
    "id": 3090,
    "fa": "داری شلوار می پوشی؟",
    "en": "Are you wearing pants?",
    "groupCode": 0
  },
  {
    "id": 3091,
    "fa": "اگر به من بود، دیگر پول خرج (فرضی) نمی کردم",
    "en": "If it were up to me, I wouldn't spend any more money",
    "groupCode": 0
  },
  {
    "id": 3092,
    "fa": "به عقب نگاه نکن هیچ چیز برای تو نیست",
    "en": "Don't look back there is nothing for you",
    "groupCode": 0
  },
  {
    "id": 3093,
    "fa": "بخشی از من که تو هستی هرگز نخواهد مرد",
    "en": "The part of me that is you will never die",
    "groupCode": 0
  },
  {
    "id": 3094,
    "fa": "آنها می تونستند (توانسته بودن) با کار بیشتر پروژه را به موقع تمام کنند",
    "en": "They could have finished the project on time with more work",
    "groupCode": 0
  },
  {
    "id": 3095,
    "fa": "کاش تمام پنجره ها را چک کرده بودم قبل از ترک کردن",
    "en": "I wish I had checked all the windows before leaving",
    "groupCode": 0
  },
  {
    "id": 3096,
    "fa": "ترش کردم",
    "en": "I have heartburn",
    "groupCode": 0
  },
  {
    "id": 3097,
    "fa": "دلیلی برای متاسف بودن وجود ندارد",
    "en": "There's no reason to be sorry",
    "groupCode": 0
  },
  {
    "id": 3098,
    "fa": "دلیلی برای ترس وجود ندارد",
    "en": "There's no reason to be afraid",
    "groupCode": 0
  },
  {
    "id": 3099,
    "fa": "ترجیح می دم خوش شانس باشم تا باهوش",
    "en": "I'd rather be lucky than smart",
    "groupCode": 0
  },
  {
    "id": 3100,
    "fa": "ترجیح می دم بمیرم تا نامیدت کنم",
    "en": "I'd rather die than disappoint you",
    "groupCode": 0
  },
  {
    "id": 3101,
    "fa": "ترجیح می دم در موردش صحبت نکنم",
    "en": "I'd rather not talk about it",
    "groupCode": 0
  },
  {
    "id": 3102,
    "fa": "پشیمانم از خوردن (داشتن) این غذا",
    "en": "I regret having this food",
    "groupCode": 0
  },
  {
    "id": 3103,
    "fa": "بازگشت دلالت دارد به یک مکانی بعد از (مدتی) دور بودن",
    "en": "Get back implies returning to a place after having been away",
    "groupCode": 0
  },
  {
    "id": 3104,
    "fa": "این خیلی بعید است، اما من فکر می کنم ما ممکنه برنده شیم",
    "en": "It's a long shot, but I think we might win",
    "groupCode": 0
  },
  {
    "id": 3105,
    "fa": "من نمی توانم راحت برم بخواب به خاطر بی خوابیم",
    "en": "I can't get to sleep well because of my insomnia",
    "groupCode": 0
  },
  {
    "id": 3106,
    "fa": "او (مرد) پس از ایستادن برای مدت طولانی احساس ضعف کرد",
    "en": "He felt faint after standing for too long",
    "groupCode": 0
  },
  {
    "id": 3107,
    "fa": "من احساس سوزن و سوزن (سنجاق) در دستم حس می کنم",
    "en": "I feel pins and needles in my hand",
    "groupCode": 0
  },
  {
    "id": 3108,
    "fa": "من احساس بی حالی می کنم",
    "en": "I feel lethargic /ləˈTHärjik/",
    "groupCode": 0
  },
  {
    "id": 3109,
    "fa": "او (زن) با یک پزشک ازدواج کرده است.",
    "en": "She is married to a doctor",
    "groupCode": 0
  },
  {
    "id": 3110,
    "fa": "میتونی این عکس رو برای من قاب کنی؟",
    "en": "Can you frame this photo for me?",
    "groupCode": 0
  },
  {
    "id": 3111,
    "fa": "مواظب (محتاط باش) پیشنهادات سرمایه گذاری آنلاین باش تا اجتناب کنید از قربانی شدن یک کلاهبرداری (قصابی خوک)",
    "en": "Be cautious of online investment offers to avoid falling victim to a pig butchering scam",
    "groupCode": 0
  },
  {
    "id": 3112,
    "fa": "من عاشق خوردن خیار شورها هستم با ساندویچم",
    "en": "I love eating pickles with my sandwich",
    "desc": "\"pickle\" often refers specifically to pickled cucumber. When talking about pickled versions of other vegetables or fruits, it's more precise to use their specific names, like \"pickled carrot\" or \"pickled pepper,\" to avoid confusio",
    "groupCode": 0
  },
  {
    "id": 3113,
    "fa": "آنها باید کاری بکنند فقط برای آرام کردن جمعیت خود",
    "en": "They have to do something just to appease their own population",
    "groupCode": 0
  },
  {
    "id": 3114,
    "fa": "اگر یک بازار آزاد را از بین ببرید، شما یک بازار سیاه ایجاد می کنید",
    "en": "If you destroy a free market you create a black market",
    "groupCode": 0
  },
  {
    "id": 3115,
    "fa": "دور (پیاده) نشو وقتی دارم باهات حرف میزنم",
    "en": "Don't walk away when I'm talking to you",
    "groupCode": 0
  },
  {
    "id": 3116,
    "fa": "شرکت های سهامی خاص شرکت ها را خریداری و بهبود می بخشند برای افزایش بها",
    "en": "Private equity firms buy and improve companies to increase their value",
    "desc": "Private equity refers to investment in private companies (not publicly traded on stock exchanges) through the purchase of shares or stakes. Investors provide capital with the expectation of high returns, often by improving the company's performance and eventually selling it at a profit",
    "groupCode": 0
  },
  {
    "id": 3117,
    "fa": "شرکت ما داره تمرکز می کنه روی M&A برای رشد حضور مارکتش",
    "en": "Our company is focusing on M&A (Mergers and acquisitions) to grow its market presence",
    "desc": "Mergers and acquisitions (M&A) refer to the processes of combining companies (mergers) or purchasing one company by another (acquisitions).\n\nMergers occur when two companies join to form a new entity.\nAcquisitions happen when one company buys another, which then becomes part of the buying company.\nM&A activities are often used to expand market reach, enhance capabilities, or increase efficiencies",
    "groupCode": 0
  },
  {
    "id": 3118,
    "fa": "شرکت ما داره کاوش می کنه هم فرصتهای VC برای استارت آپ ها و معاملات PE برای به دست آوردن شرکت های تاسیس شده",
    "en": "Our firm is exploring both VC (Venture Capital) opportunities for startups and PE (Private Equity) deals to acquire established companies",
    "desc": "VC stands for venture capital. It refers to funding provided to early-stage, high-growth potential startups or small businesses in exchange for equity. Venture capital is typically used to help these companies grow and scale before they become profitable or go public.",
    "groupCode": 0
  },
  {
    "id": 3119,
    "fa": "اندازه بلیط برای این دور از سرمایه گذاری خطرپذیر متغیر است از 500000 دلار تا 2 میلیون دلار",
    "en": "The ticket size for this round of venture capital funding ranges from $500,000 to $2 million",
    "desc": "Ticket size refers to the amount of money invested in a single deal or transaction. In finance and investment, it indicates the scale of individual investments, such as the size of a venture capital investment or a private equity buyout",
    "groupCode": 0
  },
  {
    "id": 3120,
    "fa": "مصاحبه زمانبندی شده شما فعلا لغو خواهد شد",
    "en": "Your scheduled interview will be cancelled for the time being",
    "groupCode": 0
  },
  {
    "id": 3121,
    "fa": "من در واقع (حقوقی دریافت نمی کنم) پرداخت نمیشه",
    "en": "\n 1.I don't actually get paid \n 2.I don't actually receive pay",
    "groupCode": 0
  },
  {
    "id": 3122,
    "fa": "اینها برای چه استفاده می شدند؟",
    "en": "What were these used for?",
    "groupCode": 0
  },
  {
    "id": 3123,
    "fa": "چگونه کیسه جاروبرقی را عوض کنیم و فیلترها را تمیز کنیم؟",
    "en": "How to change the vacuum bag and clean the filters?",
    "groupCode": 0
  },
  {
    "id": 3124,
    "fa": "من خوش عکس نیستم",
    "en": "I'm not photogenic",
    "groupCode": 0
  },
  {
    "id": 3125,
    "fa": "این عکس شما را شیک نشان نمی ده",
    "en": "This picture doesn't flatter you",
    "groupCode": 0
  },
  {
    "id": 3126,
    "fa": "شرکت مشاوره کسب شد (خریداری شد) توسط یک شرکت فناوری بزرگتر",
    "en": "The consulting firm was acquired by a larger technology company",
    "desc": "Use \"company\" when referring to any type of business, especially larger or more diverse businesses, like technology companies, manufacturing companies, or retail companies.\n\nUse \"firm\" when referring to businesses that provide professional services, such as law firms, accounting firms, or consulting firms, typically smaller or partnership-based businesses.",
    "groupCode": 0
  },
  {
    "id": 3127,
    "fa": "تو حق نداشتی به من بگویی که نسبت به من حس داشتی",
    "en": "You had no right to tell me you had feelings for me",
    "groupCode": 0
  },
  {
    "id": 3128,
    "fa": "من (حالم) عالی بودم قبل از اینکه من پی بردم در مورد شما",
    "en": "I was doing great before I found out about you",
    "groupCode": 0
  },
  {
    "id": 3129,
    "fa": "چطور هیچوقت به من چیزی نگفتی؟",
    "en": "\n 1.How come you never told me anything? \n 2.How come you never said anything to me?",
    "groupCode": 0
  },
  {
    "id": 3130,
    "fa": "کم سخت بگیر بهش (مرد). او جونیور است",
    "en": "Cut him some slack. He is a junior",
    "groupCode": 0
  },
  {
    "id": 3131,
    "fa": "من امید می داشتم که (فرضی) پیش بیاد",
    "en": "I was hoping that would come up",
    "groupCode": 0
  },
  {
    "id": 3132,
    "fa": "بیا در اینجا بعضی نظرات را بگیریم. این چیزها به یک دلیلی اتفاق می افتند",
    "en": "Let's get some perspective here. These things happen for a reason",
    "groupCode": 0
  },
  {
    "id": 3133,
    "fa": "او (مرد) همیشه ایده های عالی را (می یاید) مطرح می کند",
    "en": "He always comes up with great ideas",
    "groupCode": 0
  },
  {
    "id": 3134,
    "fa": "کسی هنوز از علی شنیده؟",
    "en": "Has anyone heard from Ali yet?",
    "groupCode": 0
  },
  {
    "id": 3135,
    "fa": "من می دانم دقیقاً که او (زن) داره برش چی می گذره (حالش چطوره)",
    "en": "I know exactly what she's going through",
    "groupCode": 0
  },
  {
    "id": 3136,
    "fa": "تو خیلی نگران هستی در مورد اومدن مامانت",
    "en": "You're so uptight about your mom coming",
    "groupCode": 0
  },
  {
    "id": 3137,
    "fa": "در مورد امتحانات نگران نباش، آنها به زودی تمام خواهد شد",
    "en": "Don't get uptight about the exams, they will be over soon",
    "groupCode": 0
  },
  {
    "id": 3138,
    "fa": "من فقط نمی خواهم مامانم فکر کند که چون من با فهیم ازدواج نکردم، زندگی من چرند است",
    "en": "I just don't want my mom to think that because I didn't marry Fahim, my life is crap",
    "groupCode": 0
  },
  {
    "id": 3139,
    "fa": "اون یک باری از مزخرف بود",
    "en": "That was a load of crap",
    "groupCode": 0
  },
  {
    "id": 3140,
    "fa": "او (مرد) داره خفه میشه",
    "en": "He's choking",
    "groupCode": 0
  },
  {
    "id": 3141,
    "fa": "کسی اینجا دکتره؟",
    "en": "Is anyone here a doctor?",
    "groupCode": 0
  },
  {
    "id": 3142,
    "fa": "او (مرد) به دلیل استرس (صداش درنمی آید) خفه شد",
    "en": "He choked up due to the stress",
    "groupCode": 0
  },
  {
    "id": 3143,
    "fa": "اون مسخره ترین چیزی است که من تا به حال (تاکید) شنیده ام",
    "en": "That's the most ridiculous thing I've ever heard",
    "groupCode": 0
  },
  {
    "id": 3144,
    "fa": "تو مرا فروختی",
    "en": "You sold me out",
    "groupCode": 0
  },
  {
    "id": 3145,
    "fa": "تو الان به من ضربه زدی؟",
    "en": "Did you just flick me?",
    "groupCode": 0
  },
  {
    "id": 3146,
    "fa": "هر بار که سرت را می چرخانی، موهایت به صورتم ضربه می زنه",
    "en": "Every time you turn your head, your hair flick my face",
    "groupCode": 0
  },
  {
    "id": 3147,
    "fa": "او (زن) گرد غبار را از روی کتش تکان داد",
    "en": "She flicked the dust off her coat",
    "groupCode": 0
  },
  {
    "id": 3148,
    "fa": "تو نمیذاری (مودبانه) تموم کنم",
    "en": "You wouldn't let me finish",
    "groupCode": 0
  },
  {
    "id": 3149,
    "fa": "یک فاجعه در حمل و نقل بود و من باید این را سفارش بدم",
    "en": "There was a disaster in shipping and I've gotta get this order in",
    "groupCode": 0
  },
  {
    "id": 3150,
    "fa": "من باید این را به انجام برسانم",
    "en": "I have got to get this done",
    "desc": "The phrase \"I have got to get\" is an informal way of saying \"I need to get\" or \"I must get.\" It's used to express a strong need or obligation to obtain or do something",
    "groupCode": 0
  },
  {
    "id": 3151,
    "fa": "من (الان چیزهای) زیادی برای سروکله زدن دارم",
    "en": "I just have too much to deal with",
    "groupCode": 0
  },
  {
    "id": 3152,
    "fa": "من ترکیب (رمزی) این را حدود یک سال پیش فراموش کردم",
    "en": "I forgot the combination to this about a year ago",
    "groupCode": 0
  },
  {
    "id": 3153,
    "fa": "آیا چوب استیک دیگری (چوب ژاپنی) دارید؟",
    "en": "\n 1.You got any Chopsticks? \n 2.Do you have any Chopsticks?",
    "desc": "The phrase \"You got any ChapStick?\" is an informal way of saying \"Have you got any ChapStick?\"",
    "groupCode": 0
  },
  {
    "id": 3154,
    "fa": "اون یک بلوز خیره کننده است",
    "en": "That is a stunning blouse",
    "groupCode": 0
  },
  {
    "id": 3155,
    "fa": "من مقداری از ادکلن شما را قرض گرفتم و امیدوارم او (زن) دوستش داشته باشد",
    "en": "I borrowed some of your cologne /kuh·lown/ and I hope she likes it",
    "groupCode": 0
  },
  {
    "id": 3156,
    "fa": "او (مرد) آنقدر در درد بود که آنها مجبور شدند او را به بیمارستان ببرند",
    "en": "He was in such pain that they had to take him to the hospital",
    "groupCode": 0
  },
  {
    "id": 3157,
    "fa": "او (زن) مرا به یاد کسی می اندازد که سال ها پیش ملاقات کردم",
    "en": "She reminds me of somebody I met years ago",
    "groupCode": 0
  },
  {
    "id": 3158,
    "fa": "من تصمیم گرفتم انجامش بدم فقط برای خاطر خودم",
    "en": "I've decided to do it just for my sake",
    "groupCode": 0
  },
  {
    "id": 3159,
    "fa": "درست (فقط) زمانی که فکر می کنید تمام شده؛ یک مشکل جدید پیش می آید",
    "en": "Just when you think it's over; a new problem comes up",
    "groupCode": 0
  },
  {
    "id": 3160,
    "fa": "هرج و مرج کامل به وجود آمد، وقتی زلزله شروع شد",
    "en": "Total chaos broke out when the earthquake started",
    "groupCode": 0
  },
  {
    "id": 3161,
    "fa": "آیا تو می توانی به من اطمینان دهی به کار بیشتر دیگه ای نیاز نخواهد بود؟",
    "en": "Can you assure me it won't need any more work?",
    "groupCode": 0
  },
  {
    "id": 3162,
    "fa": "من (مرد) نگاهی تصادفی به حیوان انداختم قبل از اینکه ناپدید بشه",
    "en": "I caught a glimpse of the animal before it disappeared",
    "groupCode": 0
  },
  {
    "id": 3163,
    "fa": "او (مرد) همیشه داره از دولت انتقاد می کند، اما هرگز رای نمی دهد",
    "en": "He's always running down the government, but never votes",
    "groupCode": 0
  },
  {
    "id": 3164,
    "fa": "مردم نیاز دارند به یک زندگی خانوادگی پایدار برای اجتناب از استرس",
    "en": "People need a stable family life to avoid stress",
    "groupCode": 0
  },
  {
    "id": 3165,
    "fa": "آن در جیرجیر می کند وقتی که باز می شود. میتونی روغنش بزنی؟",
    "en": "That door creaks when opened. Can you oil it?",
    "desc": "\"opened\" is used correctly as a past participle that functions similarly to an adjective. You don't need to include \"it is\" in the sentence.\n\nHere's why:\n\n\"When opened\" means \"when the door is opened.\"",
    "groupCode": 0
  },
  {
    "id": 3166,
    "fa": "دستگاهی (ماشینی) که تو می توانی ببینی از قطعات ریز زیادی تشکیل شده است",
    "en": "The machine that you can see consists of many tiny parts",
    "groupCode": 0
  },
  {
    "id": 3167,
    "fa": "من می دانم که چه چیزی را (روی) میز می آورم و عاشق احساس توانایی داشتن کمک کردن به یک تنوعی از مشتریان هستم",
    "en": "I know what I bring to the table and love the feeling of being able to help a variety of clients",
    "groupCode": 0
  },
  {
    "id": 3168,
    "fa": "من هفته‌ها صرف کردم (برای) انجام تحقیق پرزحمت تا مطمئن شوم همه جزئیات کامل باشند",
    "en": "I spent weeks doing painstaking research to ensure every details was perfect",
    "groupCode": 0
  },
  {
    "id": 3169,
    "fa": "من باید یک عالمه بشاشم",
    "en": "I gotta take a massive piss",
    "groupCode": 0
  },
  {
    "id": 3170,
    "fa": "من نقشه ترک کردن نمی کشیدم، اما من در نهایت جابجا شدم چون من یک شغل جدید گرفتم",
    "en": "I wasn't planning to leave, but I ended up moving because I got a new job",
    "groupCode": 0
  },
  {
    "id": 3171,
    "fa": "می توانم عطرت را تا مایل ها استشمام کنم",
    "en": "I can smell your scent for miles",
    "groupCode": 0
  },
  {
    "id": 3172,
    "fa": "تو یک شکست خورده نیستی. تو فقط در خاک اشتباهی برای شکوفا شدن هستی",
    "en": "You're not a failure. You're just in the wrong soil to bloom",
    "groupCode": 0
  },
  {
    "id": 3173,
    "fa": "من اینطور بیانش می کنم: سخت کوشی در نهایت نتیجه می دهد",
    "en": "I put it this way: hard work pays off in the end",
    "groupCode": 0
  },
  {
    "id": 3174,
    "fa": "مواظب باش با کی سر و کله میزنی",
    "en": "Be careful who you mess with",
    "groupCode": 0
  },
  {
    "id": 3175,
    "fa": "من فقط به خالقم تعظیم می کنم",
    "en": "I bow only to my creator",
    "groupCode": 0
  },
  {
    "id": 3176,
    "fa": "من دیگه از شکست خوردن نمی ترسم",
    "en": "\n 1.I'm no longer afraid of failing \n 2.I'm not afraid of failing anymore",
    "groupCode": 0
  },
  {
    "id": 3177,
    "fa": "من فقط می خواهم عذرخواهی کنم از مردمی که من نامیدم پیر در 30 (سالگی) وقتیکه من 18 (سالم) بودم",
    "en": "I just want to apologize to the people I called old at 30 when I was 18",
    "groupCode": 0
  },
  {
    "id": 3178,
    "fa": "اگر من در این دام گرفتار نمی شدم، تو را می کشتم",
    "en": "If I wasn't caught in this snare, I'd kill you",
    "groupCode": 0
  },
  {
    "id": 3179,
    "fa": "اگر تو در آن دام بمانی، خواهی مرد",
    "en": "If you stay in that snare, You'll die",
    "groupCode": 0
  },
  {
    "id": 3180,
    "fa": "خیلی خوب انجام دادی",
    "en": "You did so well",
    "groupCode": 0
  },
  {
    "id": 3181,
    "fa": "اگر شما می خواهید گریه کنید، ببرید مقداری پیاز را تا هیچ کسی (فرضی) متوجه نشود که شما دارید گریه می کنید",
    "en": "If you wanna cry, cut some onions so nobody would notice that you're crying",
    "groupCode": 0
  },
  {
    "id": 3182,
    "fa": "من قصد ندارم بدنام کنم آنها را",
    "en": "I don't mean to denigrate them",
    "groupCode": 0
  },
  {
    "id": 3183,
    "fa": "اونها رو بدنام نکن ارزشش را ندارد",
    "en": "Don't denigrate them it's not worth it",
    "groupCode": 0
  },
  {
    "id": 3184,
    "fa": "آیا من می توانم پرداخت کنم اجاره آپارتمانم را برای کل سال جلوتر؟",
    "en": "Can I pay my apartment lease for the entire year upfront?",
    "groupCode": 0
  },
  {
    "id": 3185,
    "fa": "در این لحظه بود (که) علی دانست او دیگه نمی‌خواست تاکو بخورد",
    "en": "It was at this moment Ali knew he didn't want to eat taco anymore",
    "groupCode": 0
  },
  {
    "id": 3186,
    "fa": "من اعتقاد داشتم به خودم زمانی که هیچ کس دیگری نداشت",
    "en": "I believed in me when no one else did",
    "groupCode": 0
  },
  {
    "id": 3187,
    "fa": "سیاستمداران در حال حاضر به شنیدن شکایات افراد مشهور نازپرورده عادت دارند",
    "en": "Politicians are by now used to hearing the complaints of pampered celebrities",
    "groupCode": 0
  },
  {
    "id": 3188,
    "fa": "تو به اندازه کافی بزرگ هستی که پدر من باشی",
    "en": "You're old enough to be my father",
    "groupCode": 0
  },
  {
    "id": 3189,
    "fa": "من نمی تونم شما را ببینم، لطفاً شما می تونی دوربین خود را روشن کنید؟",
    "en": "I can't see you, can you please turn your camera on?",
    "groupCode": 0
  },
  {
    "id": 3190,
    "fa": "تو داری یخ میزنی",
    "en": "You're freezing",
    "groupCode": 0
  },
  {
    "id": 3191,
    "fa": "منزجر کننده ترین چیزی که تو دیدی کسی بدون شرم انجام دهد چیست؟",
    "en": "What is the most disgusting thing you've seen someone do with no shame?",
    "desc": "In your sentence, \"What is the most disgusting thing you've seen someone do with no shame?\", the structure involves:\n\n\"You've seen\": This part uses the present perfect tense and refers to a past action (seeing something happen).\n\n\"Someone do\": After verbs like \"seen,\" \"heard,\" or \"watched,\" we use the base form of the verb (do) rather than its past tense (did).\n\nBreakdown:\n\"Seen\" (past participle) is already in the past tense.\nAfter \"seen,\" you use the base form of the verb \"do,\" not \"did,\" because \"seen\" is followed by the base form of the verb.\nExample Comparisons:\nCorrect: \"I've seen someone do something\" (Base form \"do\" after \"seen\").\nIncorrect: \"I've seen someone did something\" (Using \"did\" here is incorrect because it's the past tense form, which doesn't fit the structure after \"seen\").",
    "groupCode": 0
  },
  {
    "id": 3192,
    "fa": "نیاز نیست اینقدر به روم بیاری",
    "en": "No need to rub it in",
    "groupCode": 0
  },
  {
    "id": 3193,
    "fa": "من همیشه انجام می دهم تحقیقات بازار قبل از عرضه یک محصول جدید",
    "en": "I always conduct market research before launching a new product",
    "groupCode": 0
  },
  {
    "id": 3194,
    "fa": "جدی هستی؟ (در حال حاضر)",
    "en": "Are you being serious?",
    "groupCode": 0
  },
  {
    "id": 3195,
    "fa": "لاستیک هام (ماشین) کاملا پاره شده و من نیاز دارم پنچری رو درست کنم",
    "en": "My tires are completely torn apart, and I need to fix the puncture",
    "groupCode": 0
  },
  {
    "id": 3196,
    "fa": "من فکر کردم اون پمپ بنزین کمتر شلوغ است",
    "en": "I thought that gas station was less crowded",
    "groupCode": 0
  },
  {
    "id": 3197,
    "fa": "پارک در اوایل صبح بسیار ساکت تر است",
    "en": "The park is much quieter in the early morning",
    "groupCode": 0
  },
  {
    "id": 3198,
    "fa": "او (مرد) در اطراف مردم جدید کمی ترسو است",
    "en": "He's a bit timid around new people",
    "groupCode": 0
  },
  {
    "id": 3199,
    "fa": "اونا دارن پول چاپ (ضرب) می کنند",
    "en": "They are minting money",
    "groupCode": 0
  },
  {
    "id": 3200,
    "fa": "شما خیلی مناسب (گزینه عالی) خواهید بود (فرضی) برای سمت مهندس نرم افزار",
    "en": "You'd be a great fit for Software Engineer position",
    "groupCode": 0
  },
  {
    "id": 3201,
    "fa": "ما می خواهیم مطمئن شویم که همه سالم به خانه می رسند",
    "en": "We want to make sure everyone gets home safely",
    "groupCode": 0
  },
  {
    "id": 3202,
    "fa": "ما مایلیم به شما یادآوری کنیم که تعطیلات سالانه خود را تا 31 دسامبر نقشه بریزید",
    "en": "We would like to remind you to plan your annual /ˈænjuːəl/ (اَنیواِل) vacation by December 31",
    "groupCode": 0
  },
  {
    "id": 3203,
    "fa": "من پاسپورت همسر و پسرم را به روز کرده ام و مایلم تقاضا بدم برای نو کردن مجوزهای اقامت آنها برای منعکس کردن جزئیات جدید پاسپورت و تاریخ های انقضا",
    "en": "I have updated my wife and son's passports, and I would like to request the renewal of their residence permits to reflect the new passport details and expiration dates",
    "groupCode": 0
  },
  {
    "id": 3204,
    "fa": "تنها قسمتی از توضیحات که باقی می ماند قسمت آخر است",
    "en": "The only part of the description that remains is the last one",
    "desc": "A restrictive clause gives essential information needed to understand the sentence. It tells you which specific person or thing you're talking about.\n\nUse \"that\" for restrictive clauses. Example: \"The car that is red is mine.\" (The clause \"that is red\" tells you which car.)\nA non-restrictive clause adds extra information that isn't essential to understand the sentence.\n\nUse \"which\" for non-restrictive clauses. Example: \"The car, which is red, is mine.\" (The color is just extra info here.)\nIn your sentence, \"that remains\" is essential, so we use \"that\" instead of \"which.\"",
    "groupCode": 0
  },
  {
    "id": 3205,
    "fa": "من بیخیالش نیستم",
    "en": "I am not over it",
    "groupCode": 0
  },
  {
    "id": 3206,
    "fa": "این بزرگش رو داری؟",
    "en": "Do you have this in large?",
    "groupCode": 0
  },
  {
    "id": 3207,
    "fa": "اندازه منه",
    "en": "It fits me",
    "groupCode": 0
  },
  {
    "id": 3208,
    "fa": "بهت میاد",
    "en": "It suits you",
    "groupCode": 0
  },
  {
    "id": 3209,
    "fa": "سر به سرم نذار",
    "en": "Don't tease me",
    "groupCode": 0
  },
  {
    "id": 3210,
    "fa": "اینجا کمبود مسکن مقرون به صرفه وجود دارد و من نمی خواهم وام مسکن بزرگی بر دارم",
    "en": "There is a shortage of affordable housing here and I don't want to take a big mortgage",
    "groupCode": 0
  },
  {
    "id": 3211,
    "fa": "اگر ما استثنا را چاپ کرده بودیم، ما در لاگ داشته بودیمش",
    "en": "If we had printed the exception, we would have had it in the log",
    "groupCode": 0
  },
  {
    "id": 3212,
    "fa": "می توانی نخود را به من (پاس) بدی؟",
    "en": "Can you pass me the chickpeas?",
    "groupCode": 0
  },
  {
    "id": 3213,
    "fa": "تابلو می گوید: جای خالی نیست",
    "en": "The sign says: No Vacancy",
    "groupCode": 0
  },
  {
    "id": 3214,
    "fa": "رفیق, بیشتر اوقات, من اینجوریم",
    "en": "Dude, most of the time, I am like this",
    "groupCode": 0
  },
  {
    "id": 3215,
    "fa": "من احساس بی طرفی می کنم کاملا در مورد شیرینی های",
    "en": "I feel quite neutral about sweets",
    "groupCode": 0
  },
  {
    "id": 3216,
    "fa": "رابطه جنسی معمولی چقدر طول می کشد؟",
    "en": "How long normal sex lasts?",
    "groupCode": 0
  },
  {
    "id": 3217,
    "fa": "\n 1.@ \n 2.- \n 3.$ \n 4.! \n 5.¡ \n 6.# \n 7.,",
    "en": "\n 1.At Sign \n 2.Dash (Hyphen) \n 3.Dollar Sign $ \n 4.Exclamation \n 5.Inverted Exclamation \n 6.Number Sign (Hash) \n 7.Comma",
    "groupCode": 0
  },
  {
    "id": 3218,
    "fa": "\n 1.\" \n 2./ \n 3.\\ \n 4.[] \n 5.() ",
    "en": "\n 1.Double Quotation Marks \n 2.Slash (Forward Slash) \n 3.Backward Slash \n 4.Brackets \n 5.Parentheses",
    "groupCode": 0
  },
  {
    "id": 3219,
    "fa": "برام یک ساندویچ درست کن، اما گوجه فرنگی نذار (را نگه دار)",
    "en": "Make me a sandwich, but hold the tomato",
    "desc": "This means you are asking someone to make a sandwich for you, but you don't want tomato in it. \"Hold the tomato\" is an idiomatic way of saying \"leave out the tomato.",
    "groupCode": 0
  },
  {
    "id": 3220,
    "fa": "من خیلی از صحبت های معلم را درک نکردم",
    "en": "I didn't take in much of the teacher said",
    "groupCode": 0
  },
  {
    "id": 3221,
    "fa": "چیز زیادی باقی نمانده است",
    "en": "There is not too much left",
    "groupCode": 0
  },
  {
    "id": 3222,
    "fa": "خوب خواهد بود اگر ما بتوانیم از علی اطلاعات (خلاصه کلام) بگیریم",
    "en": "It will be good if we can get a heads-up from Ali",
    "desc": "Heads-up: a short talk or statement about how a situation or plan is developing",
    "groupCode": 0
  },
  {
    "id": 3223,
    "fa": "رئیس یک جلسه تشکیل داد تا به ما یک اطلاعات سریع (خلاصه کلام) بدهد در مورد اینکه (روی) چگونه پروژه داره می ره",
    "en": "The boss called a meeting to give us a quick heads-up on how the project's going",
    "desc": "Heads-up: a short talk or statement about how a situation or plan is developing",
    "groupCode": 0
  },
  {
    "id": 3224,
    "fa": "من فکر می کنم شما باید کاملا از این فرصت استفاده کنی!",
    "en": "I think you should totally take advantage of this opportunity!",
    "groupCode": 0
  },
  {
    "id": 3225,
    "fa": "بالاخره بهار اینجا است, و زمان آن است بار دیگر تعویض کنید تایرهای زمستانی خود را با تابستانی هاش طراحی شدند برای چسبناکی بهتر در موقعیت های گرمتر",
    "en": "Spring is finally here, and it's time once again to swap your winter tires for summer ones designed for better grip in warmer conditions",
    "groupCode": 0
  },
  {
    "id": 3226,
    "fa": "وقتی شروع به بهتر کردن خود می کنید، تنهایی عوارضی (قیمتی) است که می پردازید",
    "en": "When you start improving yourself, loneliness is the toll you pay",
    "groupCode": 0
  },
  {
    "id": 3227,
    "fa": "اگر همسرت (زن) آنقدر زیباست, چرا شما اینجا با من هستی؟",
    "en": "If your wife's that beautiful, why are you here with me?",
    "groupCode": 0
  },
  {
    "id": 3228,
    "fa": "من بیش از حد به او (زن) احترام می گذارم که کاری که قصد دارم با او انجام بدهم را با تو انجام دهم",
    "en": "I respect her too much to do to her what I'm going to do to you",
    "groupCode": 0
  },
  {
    "id": 3229,
    "fa": "آیا تا به حال (تاکید) شاهد بوده ای یک زندگی ویران شده با یک اشتباه کوچک؟",
    "en": "Have you ever witnessed a life ruined by a small mistake?",
    "desc": "Let's break it down:\n\nFull version: \"Have you ever witnessed a life that was ruined from a small mistake?\"\nThis is a full passive sentence with \"was.\"\nReduced version: \"Have you ever witnessed a life ruined from a small mistake?\"\nHere, \"that was\" is omitted (which is common in English), and \"ruined\" works as part of a reduced clause.\nSo, even though it's passive, you don't need \"was\" because it's implied and reduced.",
    "groupCode": 0
  },
  {
    "id": 3230,
    "fa": "او (مرد) هرگز از شر لکه روی زندگیش خلاص نخواهد شد",
    "en": "He will never get rid of the stain on his life",
    "groupCode": 0
  },
  {
    "id": 3231,
    "fa": "آیا من شنیدنی هستم؟",
    "en": "Am I audible?",
    "groupCode": 0
  },
  {
    "id": 3232,
    "fa": "ویدیوی شما کمی تار است",
    "en": "Your video is a bit blurry",
    "groupCode": 0
  },
  {
    "id": 3233,
    "fa": "وجود دارد مقداری نویز پس زمینه در انتهای شما",
    "en": "There is some background noise at your end",
    "groupCode": 0
  },
  {
    "id": 3234,
    "fa": "بالانس نقدی موجود برای برداشت ممکن است تا هشت هفته کاهش یابد",
    "en": "The available cash balance for withdrawal may be reduced for up to eight weeks",
    "groupCode": 0
  },
  {
    "id": 3235,
    "fa": "او (زن) فیلم های ترسناک را دوست ندارد",
    "en": "She doesn't like horror films",
    "groupCode": 0
  },
  {
    "id": 3236,
    "fa": "بدهی های مستقیم می توان لغو شوند در هشت هفته اول",
    "en": "The direct debits can be revoked within the first eight weeks",
    "groupCode": 0
  },
  {
    "id": 3237,
    "fa": "لطفا از پرس و جوها اضافی توسط تلفن خودداری (اجتناب) کنید",
    "en": "Please refrain from additional inquiries by phone",
    "groupCode": 0
  },
  {
    "id": 3238,
    "fa": "او (مرد) هفته گذشته در دفتر نبود",
    "en": "He wasn't at the office last week",
    "groupCode": 0
  },
  {
    "id": 3239,
    "fa": "برای ما امکان پذیر نیست پردازش کردن درخواست شما در زمان مناسب (به موقع)",
    "en": "It's not possible for us to process your request in a timely manner",
    "groupCode": 0
  },
  {
    "id": 3240,
    "fa": "شما فقط داری 16 مسابقه باقی مانده",
    "en": "You only have 16 matches left",
    "groupCode": 0
  },
  {
    "id": 3241,
    "fa": "ادرارم کاملا کف کرده است. آیا بدان معنی است که کلیه هایم آسیب دیده؟",
    "en": "My urine has been quite foamy. Does it mean that my kidneys are damaged?",
    "groupCode": 0
  },
  {
    "id": 3242,
    "fa": "لطفا مرا به خاطر دیر آمدن سرزنش نکن",
    "en": "Please don't scold me for being late",
    "groupCode": 0
  },
  {
    "id": 3243,
    "fa": "بهم گیر نده",
    "en": "Don't pick on me",
    "groupCode": 0
  },
  {
    "id": 3244,
    "fa": "من تصادفاً آرنجم را روی میز کوبیدم",
    "en": "I accidentally bumped my elbow on the table",
    "groupCode": 0
  },
  {
    "id": 3245,
    "fa": "او عادت داشت (مرد) حلقه هایش را روی انگشت اشاره، انگشت وسط، انگشت حلقه و انگشت کوچیکه بپوشد",
    "en": "He used to wear his rings on his index finger, middle finger, ring finger, and pinky finger",
    "groupCode": 0
  },
  {
    "id": 3246,
    "fa": "مچ دستم داره مرا می کشد از تایپ کردن و کف دستم تمام عرق کرده",
    "en": "My wrist is killing me from typing, and my palm is all sweaty",
    "groupCode": 0
  },
  {
    "id": 3247,
    "fa": "او (مرد) روی کاناپه نشست و رشته هایش را با صدای بلند هورت کشید",
    "en": "He sat on the couch and slurped his noodles loudly",
    "groupCode": 0
  },
  {
    "id": 3248,
    "fa": "در هنگام تماشای تلویزیون, او (مرد) پاپ کورن ملچ ملوچ (خرچ و خرچ کردن) می کرد",
    "en": "While watching TV, he munched /mʌnt͡ʃ/ on popcorn",
    "groupCode": 0
  },
  {
    "id": 3249,
    "fa": "من از دکتر برگشتم و جراحی انجام دادم",
    "en": "I'm back from the doctor and got the operation done",
    "groupCode": 0
  },
  {
    "id": 3250,
    "fa": "شما نیاز داری برای مدتی استراحت کنی (دور شوی)",
    "en": "You need to get away for a while",
    "groupCode": 0
  },
  {
    "id": 3251,
    "fa": "تو میتونستی (توانسته بودی) کت رو بدی به من و من می گذاشتمش (گذاشته بودمش) روی چوب لباسی برات",
    "en": "You could have given me your coat, and I would have put it on the hanger for you",
    "groupCode": 0
  },
  {
    "id": 3252,
    "fa": "آیا آب لیمو برای کلیه ها خوب است؟",
    "en": "Is lemon water good for kidneys?",
    "groupCode": 0
  },
  {
    "id": 3253,
    "fa": "بنابراین، حیاتی است نگه داشتن بهینه سلامت کلیه برای رفاه کلی",
    "en": "Therefore, it's crucial to maintain optimal kidney health for overall well-being",
    "groupCode": 0
  },
  {
    "id": 3254,
    "fa": "اگر قصد داری به من اعتماد کنی، شما نیاز داری من را بشناسی",
    "en": "If you're gonna trust me, you need to know me",
    "desc": "\"You need to know me\": They should already understand you.\n\"You need to get to know me\": They need to take time to learn about you.",
    "groupCode": 0
  },
  {
    "id": 3255,
    "fa": "ما تازه ملاقات کردیم، اما شما نیاز داری اول من را بشناسی",
    "en": "We just met, but you need to get to know me first",
    "desc": "\"You need to know me\": They should already understand you.\n\"You need to get to know me\": They need to take time to learn about you.",
    "groupCode": 0
  },
  {
    "id": 3256,
    "fa": "من ازش مراقبت خواهم کرد و به شما پاسخ می دهم (بر می گردانم)",
    "en": "I'll take care of it and get back to you",
    "desc": "\"Get back to you\" = Respond to you after handling it.\n\"Get it back to you\" = Return the item to you after handling it.",
    "groupCode": 0
  },
  {
    "id": 3257,
    "fa": "کی ما تقریباً خواهیم دانست در مورد بودجه؟",
    "en": "When will we roughly know about the budget?",
    "groupCode": 0
  },
  {
    "id": 3258,
    "fa": "یک روز جوانی، روز بعد شما داری می نشینی اینگونه لبه تختت با کتف بد، زانوی بد و درد سیاتیک",
    "en": "One day you're young, the next day you're sitting like this at the edge of your bed with a bad shoulder, bad knee, and sciatica /saɪˈætɪkə/ pain",
    "groupCode": 0
  },
  {
    "id": 3259,
    "fa": "آنها برای سالگرد خود به یک استراحت عاشقانه رفتند",
    "en": "They went on a romantic getaway for their anniversary",
    "groupCode": 0
  },
  {
    "id": 3260,
    "fa": "کامنت گستاخانه او (مرد) واقعاً مرا تحریک کرد, و من نمی توانستم ساکت بمانم دیگر بیشتر",
    "en": "His rude comment really set me off, and I couldn't keep quiet any longer",
    "desc": "set off: to trigger a strong reaction",
    "groupCode": 0
  },
  {
    "id": 3261,
    "fa": "او (مرد) قادر بود بیان کند ایده هایش را به وضوح در طول ارائه (عرضه)",
    "en": "He was able to articulate his ideas clearly during the presentation",
    "groupCode": 0
  },
  {
    "id": 3262,
    "fa": "من لباسم (ست کامل) چک کردم",
    "en": "I check out my outfit",
    "groupCode": 0
  },
  {
    "id": 3263,
    "fa": "من یک کیف انتخاب کردم",
    "en": "I pick out a bag",
    "groupCode": 0
  },
  {
    "id": 3264,
    "fa": "فقط پای خود را داخل کفش خود کنید (بکشید)",
    "en": "Just slide your foot into your shoe",
    "groupCode": 0
  },
  {
    "id": 3265,
    "fa": "جوراب خود را بپوشید, لطفا",
    "en": "Put on your socks, please",
    "groupCode": 0
  },
  {
    "id": 3266,
    "fa": "من پیراهنم را با احتیاط (داخل شلوارم) فرو می کنم تا مطمئن شوم تمیز و حرفه ای به نظر می رسد",
    "en": "I carefully tuck in my shirt to ensure it looks clean and professional",
    "groupCode": 0
  },
  {
    "id": 3267,
    "fa": "من حوصله ام سر رفت، بنابراین شروع کردم پرتاب تصادفی کش های مو در کامیون همکارانم",
    "en": "I got bored, so I started tossing random hair ties into my coworkers' truck",
    "groupCode": 0
  },
  {
    "id": 3268,
    "fa": "یک سود تقسیمی بخشی از سودهای اشتراکی با سهامداران است",
    "en": "A dividend is the cut of profits shared with shareholders",
    "groupCode": 0
  },
  {
    "id": 3269,
    "fa": "در طول سال, ما سمینارهای بیشتری پیشنهاد خواهیم داد",
    "en": "In the course of the year, we will offer further seminars",
    "groupCode": 0
  },
  {
    "id": 3270,
    "fa": "شما بیشتر از همیشه خوش آمدید برای آمدن به آفیس در هر زمانی و استفاده کنی از هر ورودی",
    "en": "You are all more than welcome to come to the office at any time and use any of the entrances",
    "groupCode": 0
  },
  {
    "id": 3271,
    "fa": "آیا می تونی یک جلسه زوم را به زبان انگلیسی با اطمینان رهبری کنی؟",
    "en": "Can you confidently lead a Zoom meeting in English?",
    "groupCode": 0
  },
  {
    "id": 3272,
    "fa": "آیا می تونی یک درگیری بین همکاران را میانجیگری کنی؟",
    "en": "Can you mediate a conflict between co-workers?",
    "groupCode": 0
  },
  {
    "id": 3273,
    "fa": "در صورتیکه تو از دستش دادی",
    "en": "In case you missed it",
    "groupCode": 0
  },
  {
    "id": 3274,
    "fa": "اگر می خواهید انگلیسی تجاری مناسبی را یاد بگیرید، اجتناب کنید از بدام افتادن در چرخه یادگیری جالب اما حرفه ای بی ربط لغات",
    "en": "If you want to learn proper business English, avoid getting trapped in a cycle of learning interesting but professionally irrelevant vocabulary",
    "groupCode": 0
  },
  {
    "id": 3275,
    "fa": "او (مرد) تماس (برمی گرداند تماس) خواهد گرفت به محض اینکه (اسرع وقت) او سوار ماشین می شود",
    "en": "He' ll call back as soon as he gets in the car",
    "groupCode": 0
  },
  {
    "id": 3276,
    "fa": "من بطور ضروری نیاز دارم اطلاعات در مورد تاریخ تحویل برای پروژه ساخت فرودگاه فرانکفورت",
    "en": "I urgently need information regarding the delivery date for the Frankfurt Airport construction project",
    "desc": "\"Regarding,\" \"on,\" and \"about\" all mean concerning or related to but vary in formality:\n\n\"Regarding\": More formal.\n\"On\": Slightly less formal.\n\"About\": Most casual.",
    "groupCode": 0
  },
  {
    "id": 3277,
    "fa": "لطفا من رو ببخشید, من یک تماس روی خط دیگه زودتر داشتم",
    "en": "Please excuse me, I had a call on the other line earlier",
    "groupCode": 0
  },
  {
    "id": 3278,
    "fa": "من یک نگاهی داخل سیستم خواهم داشت",
    "en": "I'll have a look in the system",
    "groupCode": 0
  },
  {
    "id": 3279,
    "fa": " تحویل (کالای) شما خواهد رسید در سایت ساخت در ۲۴ ساعت بعدی",
    "en": "Your delivery will arrive at the construction site within the next 24 hours",
    "groupCode": 0,
    "desc": "The verb \"arrive\" doesn't always imply that something moves on its own. It's often used to describe when an object reaches a destination, regardless of who or what is physically transporting it.\n\nIn this case, \"Your delivery will arrive\" means that the delivery is expected to reach the site. The sentence focuses on the final result—the delivery being at the construction site—not on who or what actually brings it there.\n\nIf you prefer to emphasize the fact that it's being brought by someone, you could rephrase it:\n\n\"Your delivery will be delivered to the construction site.\""
  },
  {
    "id": 3280,
    "fa": "به لطف (تشکر) ادغام یکپارچه، کارمند قادر است بلافاصله اطلاعات تفصیلی (با جزییات) در مورد وضعیت سفارش فراهم کند",
    "en": "Thanks to the seamless integration, the employee is able to immediately provide detailed information on the order status",
    "groupCode": 0
  },
  {
    "id": 3281,
    "fa": "این بدان معنی است که دفعه بعد که من قرار می دهم یک سفارش با شما، من می توانم مستقیماً ببینم در پورتال جاییکه در حال حاضر تحویل در آن واقع شده و زمانیکه خواهد رسید",
    "en": "This means that the next time I place an order with you, I can see directly in the portal where the delivery is currently located and when it will arrive",
    "groupCode": 0
  },
  {
    "id": 3282,
    "fa": "به نظر می رسد شبیه یک رویا",
    "en": "Sounds like a dream",
    "groupCode": 0
  },
  {
    "id": 3283,
    "fa": "من دسترسی را از طریق ایمیل برات ارسال خواهم کرد",
    "en": "I will send you access by e-mail",
    "groupCode": 0
  },
  {
    "id": 3284,
    "fa": "من جدی هستم. آیا به نظر میرسم (شبیه) دارم شوخی می کنم؟",
    "en": "I'm dead serious. Do I look like I'm kidding?",
    "groupCode": 0
  },
  {
    "id": 3285,
    "fa": "مکان اشتباه زمان اشتباه. نه، من دقیقاً جایی هستم که باید باشم",
    "en": "Wrong place wrong time. No, I am exactly where I should be",
    "groupCode": 0
  },
  {
    "id": 3286,
    "fa": "نور داره سوسو می زنه",
    "en": "The light is flickering",
    "groupCode": 0
  },
  {
    "id": 3287,
    "fa": "میز لرزان است",
    "en": "The table is wobbly",
    "groupCode": 0
  },
  {
    "id": 3288,
    "fa": "در داره جیرجیر می کنه",
    "en": "The door is creaking",
    "groupCode": 0
  },
  {
    "id": 3289,
    "fa": "رنگ داره کنده میشه (پوست کندن)",
    "en": "The paint is peeling off",
    "groupCode": 0
  },
  {
    "id": 3290,
    "fa": "دوستم و من زیر بار مشکلات هستیم",
    "en": "My friend and I are under the burden of problems",
    "groupCode": 0
  },
  {
    "id": 3291,
    "fa": "علی, پیشرفت تو کاملا غیر قابل توقف است",
    "en": "Ali, your progress is totally unstoppable",
    "groupCode": 0
  },
  {
    "id": 3292,
    "fa": "غیرقابل انکار است که از یک لیموناد سرد در ماه جولای نمی توان پیشی گرفت",
    "en": "It is undeniable that a cold lemonade in July cannot be surpassed /sərˈpæs/",
    "groupCode": 0
  },
  {
    "id": 3293,
    "fa": "در طول زمان استراحتم، به بعضی مطالعات (خواندنی) رسیدگی کردم",
    "en": "During my downtime, I caught up on some reading",
    "groupCode": 0
  },
  {
    "id": 3294,
    "fa": "من یه مقدار کار دارم برای رسیدگی کردن",
    "en": "I have some work to catch up on",
    "groupCode": 0
  },
  {
    "id": 3295,
    "fa": "محموله شما در 20 سپتامبر 2024 در مرکز تدارکات ما پردازش شد و به مقصدش رسیده است",
    "en": "Your shipment was processed at our logistics center on September 20, 2024, and has reached its destination",
    "desc": "\"Logistics\" is the correct term when referring to the overall process of managing the movement of goods, and it is typically used in the plural form in this context",
    "groupCode": 0
  },
  {
    "id": 3296,
    "fa": "تو لایق آن افزایش (حقوق) هستی. الان جا نزن (تسلیم نشو)",
    "en": "You deserve that raise. Don't back down now",
    "groupCode": 0
  },
  {
    "id": 3297,
    "fa": "من یک فرصت (شوت) داشتم و ازش بهترین استفاده را کردم",
    "en": "I had one shot, and I made it count",
    "desc": "The phrase \"made it count\" emphasizes that the person took advantage of that time in a meaningful or useful way",
    "groupCode": 0
  },
  {
    "id": 3298,
    "fa": "مربع پنج برابر است با بیست و پنج",
    "en": "Five squared equals twenty-five",
    "groupCode": 0
  },
  {
    "id": 3299,
    "fa": "مکعب دو برابر با هشت است",
    "en": "Two cubed equals eight",
    "groupCode": 0
  },
  {
    "id": 3300,
    "fa": "سه به توان چهار برابر با هشتاد و یک است",
    "en": "Three to the power of four equals eighty-one",
    "groupCode": 0
  },
  {
    "id": 3301,
    "fa": "سه چهارم پیتزا تمام شده بود تا زمانیکه به خانه رسیدم",
    "en": "Three quarters of the pizza was gone by the time I got home",
    "groupCode": 0
  },
  {
    "id": 3302,
    "fa": "من یک و دو سوم از یک پیتزا را خوردم",
    "en": "I ate one and two-thirds of a pizza",
    "desc": "\"Two-thirds\" is plural because you are referring to two parts out of three.",
    "groupCode": 0
  },
  {
    "id": 3303,
    "fa": "شما باید صبر خود را افزایش دهید",
    "en": "You have to increase your patience",
    "groupCode": 0
  },
  {
    "id": 3304,
    "fa": "چقدر مکررا شما باید شلوار جین را بشویید؟",
    "en": "How frequently should you wash jeans?",
    "desc": "The word \"jeans\" is plural and always refers to a single pair of pants",
    "groupCode": 0
  },
  {
    "id": 3305,
    "fa": "بهترین راه ها برای ترقی دادن (سیستم) ایمنی تان چیست؟",
    "en": "What are the best ways to boost your immunity?",
    "groupCode": 0
  },
  {
    "id": 3306,
    "fa": "من احساس بیماری و (در) درد دارم. من احساس هر دو گرما و سرما را دارم",
    "en": "I feel sick and in pain. I feel both hot and cold",
    "groupCode": 0
  },
  {
    "id": 3307,
    "fa": "من برای دو هفته یک سرما خوردگی داشتم",
    "en": "I have had a cold for two weeks",
    "groupCode": 0
  },
  {
    "id": 3308,
    "fa": "من دیابتی هستم",
    "en": "I'm diabetic /ˌdaɪəˈbetɪk/",
    "groupCode": 0
  },
  {
    "id": 3309,
    "fa": "من (مدتی) سر درد (ها) دارم",
    "en": "I've been having headaches",
    "groupCode": 0
  },
  {
    "id": 3310,
    "fa": "پوستم میخاره و نمیتونم جلوی خاراندن رو بگیرم!",
    "en": "My skin is itchy, and I can't stop scratching!",
    "groupCode": 0
  },
  {
    "id": 3311,
    "fa": "من نیاز دارم به یک برگه بیماری از پزشکم تا غیبتم را بهانه کنم از کار به دلیل بیماریم",
    "en": "I need a sick note from my doctor to excuse my absence from work due to my illness",
    "groupCode": 0
  },
  {
    "id": 3312,
    "fa": "او (مرد) یک دروغگوی کثیف است",
    "en": "He is a filthy liar",
    "groupCode": 0
  },
  {
    "id": 3313,
    "fa": "هوشمندانه ترین مذاکره حقوقی که داشته اید چیست؟",
    "en": "What is the cleverest salary negotiation you've had?",
    "groupCode": 0
  },
  {
    "id": 3314,
    "fa": "چرا باید به لقمه های ناچیز قانع باشم؟",
    "en": "Why do I have to settle for crumbs?",
    "groupCode": 0
  },
  {
    "id": 3315,
    "fa": "چرا نمی توانیم ما عمیقتر از 12.2 کیلومتر زمین را حفاری کنیم؟",
    "en": "Why can't we dig deeper than 12.2 km into the Earth?",
    "groupCode": 0
  },
  {
    "id": 3316,
    "fa": "چگونه من سطوح تستوسترون را به طور سریع و به طور ایمن افزایش دهم؟",
    "en": "How do I increase testosterone levels quickly and safely?",
    "groupCode": 0
  },
  {
    "id": 3317,
    "fa": "قراره (قصد) خیلی سرگرم کننده باشه!",
    "en": "It's ganna be a lot of fun!",
    "groupCode": 0
  },
  {
    "id": 3318,
    "fa": "مطمئن شوید که ثبت نام شده اید و روی آیکون زنگ کلیک کنید تا مطلع شوید زمانیکه رویداد داره شروع میشه",
    "en": "Make sure you're enrolled and click the bell icon to be notified when the event is about to start",
    "groupCode": 0
  },
  {
    "id": 3319,
    "fa": "نگران نباشید اگر گفتید بله - این یک احساس بسیار مشترک است",
    "en": "Don't worry if you said yes - it's a very common feeling",
    "groupCode": 0
  },
  {
    "id": 3320,
    "fa": "بگذار به شما نشان دهم برخی از حقایق چشم باز کن باور نکردنی را که نقاشی کند یک تصویری از اینکه چقدر تحول آفرین می تواند باشد مهارت های انگلیسی قوی در محل کار",
    "en": "Let me show you some incredibly eye-opening facts that paint a picture of how transformative strong English skills at work can be",
    "groupCode": 0
  },
  {
    "id": 3321,
    "fa": "نزدیک به ۹ نفر از هر ۱۰ انگلیسی زبانان پیشرفته با شغل خودشان راضی هستند",
    "en": "Nearly 9 out of 10 advanced English speakers are satisfied with their jobs",
    "groupCode": 0
  },
  {
    "id": 3322,
    "fa": "آیا چیزی بود شما قرار بود امروز انجام بدی اما نکردی؟",
    "en": "Was there anything you were supposed to do today but didn't?",
    "groupCode": 0
  },
  {
    "id": 3323,
    "fa": "کی تو را دعوتت کرد؟ او (مرد) مرا دعوت کرد",
    "en": "Who invited you? He invited me",
    "groupCode": 0
  },
  {
    "id": 3324,
    "fa": "آیا می توانید (مودبانه) به او (مرد) یک اسپرسو بدید؟",
    "en": "Could you get him an espresso?",
    "groupCode": 0
  },
  {
    "id": 3325,
    "fa": "جریان ها می توانند متناهی یا بی نهایت باشند",
    "en": "Streams can be finite /ˈfaɪˌnaɪt/ or infinite /ˈɪnfənət/",
    "groupCode": 0
  },
  {
    "id": 3326,
    "fa": "او (مرد) شما را دوست می داشت همچنین (داشته بود) اگر او از شما خبر داشته بود",
    "en": "He would have loved you too if he had known about you",
    "groupCode": 0
  },
  {
    "id": 3327,
    "fa": "در حال حاضر، او (مرد) هیچ ایده ای ندارد شما کجا هستید. اگر او (مرد) می دانست تو کجا بودی، سوراخی در کیهان پاره می کرد (پاره کرده بود) تا تو را به خانه بیاورد",
    "en": "Right now, he has no idea where you are. If he knew where you were, he would have torn a hole in the universe to bring you home",
    "groupCode": 0
  },
  {
    "id": 3328,
    "fa": "پاهام (ران هام) احساس ضعف می کنند",
    "en": "My legs feel weak",
    "groupCode": 0
  },
  {
    "id": 3329,
    "fa": "گوش هایم درد میکنه (دردناک است)",
    "en": "My ears are sore",
    "groupCode": 0
  },
  {
    "id": 3330,
    "fa": "گلویم خشکه! من نمی توانم سرفه را متوقف کنم!",
    "en": "My throat is dry! I can't stop coughing!",
    "groupCode": 0
  },
  {
    "id": 3331,
    "fa": "من (مدتی) احساس افسردگی می کنم",
    "en": "I've been feeling depressed",
    "groupCode": 0
  },
  {
    "id": 3332,
    "fa": "سرم صدمه دیده! چم شده؟",
    "en": "My head hurts! What is wrong with me?",
    "groupCode": 0
  },
  {
    "id": 3333,
    "fa": "او (زن) فکر می کند او ممکن است باردار باشد",
    "en": "She thinks she might be pregnant",
    "groupCode": 0
  },
  {
    "id": 3334,
    "fa": " ۱.کلم \n ۲.کاهو \n ۳.کلم بروکلی \n ۴.اسفناج \n ۵.گل کلم",
    "en": "1.Cabbage /ˈkæbədʒ/ \n 2.Lettuce /ˈletəs/ \n 3.Broccoli /ˈbrɑːkəli/ \n 4.Spinach /ˈspɪnət͡ʃ/ \n 5.Cauliflower /ˈkɑːləˌflɑːwər/",
    "groupCode": 0
  },
  {
    "id": 3335,
    "fa": " ۱.کلم قرمز \n ۲.شلغم \n ۳.بادمجان \n ۴.چغندر \n ۵.فلفل",
    "en": "1.Red cabbage \n 2.Turnip /ˈtɜːrnəp/ \n 3.Eggplant \n 4.Beetroot \n 5.Pepper",
    "groupCode": 0
  },
  {
    "id": 3336,
    "fa": " ۱.پیاز \n ۲.سیب زمینی \n ۳.سیر \n ۴.قارچ \n ۵.ذرت ",
    "en": "1.Onion \n 2.Potato \n 3.Garlic \n 4.Mushroom \n 5.Corn",
    "groupCode": 0
  },
  {
    "id": 3337,
    "fa": " ۱.هویج \n ۲.گوجه فرنگی \n ۳.خیار \n ۴.نخود فرنگی \n ۵.مارچوبه ",
    "en": "1.Carrot \n 2.Tomato \n 3.Cucumber \n 4.Peas \n 5.Asparagus /əˈsperəɡəs/",
    "groupCode": 0
  },
  {
    "id": 3338,
    "fa": "بیا داخل",
    "en": "Come on in",
    "desc": "\"Come in\": A straightforward invitation to enter.\n\"Come on in\": A casual, friendly invitation, often more welcoming.",
    "groupCode": 0
  },
  {
    "id": 3339,
    "fa": "سن قبل از زیبایی اغلب به صورت طنز استفاده می شود زمانیکه اجازه داده می شود فرد جوانتر رهبری را بر عهده بگیرد",
    "en": "Age before beauty often used humorously when letting someone younger take the lead",
    "groupCode": 0
  },
  {
    "id": 3340,
    "fa": "لطفا عقب وایسا؛ تو خیلی به من نزدیکی",
    "en": "Please back off; you're too close to me",
    "groupCode": 0
  },
  {
    "id": 3341,
    "fa": "من تو آسمونام (آسمون نهم)",
    "en": "I'm on cloud nine",
    "groupCode": 0
  },
  {
    "id": 3342,
    "fa": "من تو پوست خودم نمی گنجم (من رو ماهم)",
    "en": "I'm over the moon",
    "groupCode": 0
  },
  {
    "id": 3343,
    "fa": "در چه حالی هستی؟ نمی توان شکایت کرد",
    "en": "How are you doing? Can't complain",
    "groupCode": 0
  },
  {
    "id": 3344,
    "fa": "آیا می توانید به من یک صندلی تو راهرو جلوی هواپیما بدید؟",
    "en": "Can you give me an aisle seat in the front of the plane?",
    "desc": "Give me something implies you have something that you can give to someone. Get me something implies you must go and get something before you can give it to someone",
    "groupCode": 0
  },
  {
    "id": 3345,
    "fa": "متأسفانه, بازه زمانی که شما ارائه کردید برای ما مناسب نیست. آیا می توانید (مودبانه) لطفا به من اطلاع دهید زمان های موجود در مؤسسه خود را در دوشنبه و جمعه؟",
    "en": "Unfortunately, the time slot you provided is not suitable for us. Could you please let me know the available time slots at your institute on Monday and Friday?",
    "groupCode": 0
  },
  {
    "id": 3346,
    "fa": "کفش های جدیدم انگشتان پایم داره میزنه (نیشگون می گیرند) و این واقعا ناراحت کننده است",
    "en": "My new shoes are pinching my toes, and it's really uncomfortable",
    "groupCode": 0
  },
  {
    "id": 3347,
    "fa": "در چه حالی هستی؟ بهتر از (این) نمی تونست بشه",
    "en": "How are you doing? Couldn't be better",
    "groupCode": 0
  },
  {
    "id": 3348,
    "fa": "آشنا بازی زیاده اینجا",
    "en": "There is a lot of nepotism here",
    "groupCode": 0
  },
  {
    "id": 3349,
    "fa": "من نفخ کردم",
    "en": "I'm bloated",
    "groupCode": 0
  },
  {
    "id": 3350,
    "fa": "پوشیدن یک کلاه ایمنی تصادف نیاز است طبق قانون",
    "en": "The wearing of a crash helmet is required by law",
    "groupCode": 0
  },
  {
    "id": 3351,
    "fa": "شروع یک کار جدید در یک کشور خارجی احساس دلهره آور بود، اما من مصمم به موفقیت بودم",
    "en": "Starting a new job in a foreign country felt daunting, but I was determined to succeed",
    "groupCode": 0
  },
  {
    "id": 3352,
    "fa": "وقتیکه من هفته گذشته گم شدم، او (مرد) نمی دانست که من به دردسر افتاده بودم. اگر او (مرد) دانسته بود من کجا بودم، سوراخی در کیهان پاره می کرد (پاره کرده بود) تا تو را به خانه بیاورد",
    "en": "When I got lost last week, he didn't know I was in trouble. If he had known where I had been, he would have torn a hole in the universe to bring me home",
    "groupCode": 0
  },
  {
    "id": 3353,
    "fa": "این بزرگترین جامعه از زبان آموزان در جهان است",
    "en": "It's the world's largest community of language learners",
    "desc": "You need the possessive form \"world's\" to indicate that the community belongs to or is associated with the world.",
    "groupCode": 0
  },
  {
    "id": 3354,
    "fa": "خیلی چیزای بیشتر هست که من میخوام بگم",
    "en": "There's so much more I want to tell",
    "groupCode": 0
  },
  {
    "id": 3355,
    "fa": "من نگاهی خواهم انداخت تا ببینم چقدر خوب با کار فیته (مناسب است)",
    "en": "I'll take a look to see how well it fits the job",
    "groupCode": 0
  },
  {
    "id": 3356,
    "fa": "اون یک عدد (غیرمنصفانه) ظالمانه و مضحک است",
    "en": "That's an outrageous and ludicrous /ˈluːdəkrəs/ number",
    "groupCode": 0
  },
  {
    "id": 3357,
    "fa": "آخر هفته خوبی داشته باشید",
    "en": "Have a great weekend",
    "groupCode": 0
  },
  {
    "id": 3358,
    "fa": "آیا شما شهروند خوبی نیستید؟",
    "en": "Aren't you a good citizen?",
    "groupCode": 0
  },
  {
    "id": 3359,
    "fa": "من همیشه این دو کلمه را با هم اشتباه می گیرم",
    "en": "I always confuse these two words",
    "groupCode": 0
  },
  {
    "id": 3360,
    "fa": "چند نفر (مردم) می خواهند به گردش (گشت و گذار) بروند؟",
    "en": "How many people want to go on the excursion?",
    "groupCode": 0
  },
  {
    "id": 3361,
    "fa": "تعریف شما رو زیاد شنیدم (شهرت شما بر شما مقدم است)",
    "en": "Your reputation precedes you",
    "groupCode": 0
  },
  {
    "id": 3362,
    "fa": "ما مایلیم این بعد از ظهر به یک گردش (گشت و گذار) برویم",
    "en": "We would like to go on an excursion this afternoon",
    "groupCode": 0
  },
  {
    "id": 3363,
    "fa": "آیا والدین شما ثروتمند هستند؟",
    "en": "Are your parents rich?",
    "groupCode": 0
  },
  {
    "id": 3364,
    "fa": "آیا می توانم یک نی بگیرم، لطفا؟",
    "en": "Can I get a straw, please?",
    "groupCode": 0
  },
  {
    "id": 3365,
    "fa": "ای کاش به اندازه این سینی محکم بودم زیر آن بار",
    "en": "I wish I'd be as sturdy as this tray under that load",
    "groupCode": 0
  },
  {
    "id": 3366,
    "fa": "پسرم رفتار خوبی داشت (خوب رفتار بود) در طول پرواز طولانی به آلمان",
    "en": "My son was well-behaved during the long flight to Germany",
    "groupCode": 0
  },
  {
    "id": 3367,
    "fa": "پدربزرگ شما کجا زندگی می کند؟",
    "en": "Where does your grandfather live?",
    "groupCode": 0
  },
  {
    "id": 3368,
    "fa": "چرا خواهر و برادر (تنی زادگان) شما اینقدر جوان و ثروتمند هستند؟",
    "en": "Why are your siblings so young and rich?",
    "groupCode": 0
  },
  {
    "id": 3369,
    "fa": "من یک خواهر و برادر (تنی زادگان) دارم",
    "en": "I have one sibling",
    "desc": "The difference between \"sibling\" and \"siblings\" is:\n\n\"Sibling\" (singular): Refers to one brother or sister.\n\nExample: I have one sibling.\n\"Siblings\" (plural): Refers to two or more brothers or sisters.\n\nExample: I have three siblings.\nSo, \"sibling\" is for one, while \"siblings\" is for more than one.",
    "groupCode": 0
  },
  {
    "id": 3370,
    "fa": "آیا فرزندان شما دارن در ژانویه کارآموزی می کنند؟",
    "en": "Are your children doing the internship in January?",
    "groupCode": 0
  },
  {
    "id": 3371,
    "fa": "آیا در حال حاضر برنامه هایی دارید؟",
    "en": "Do you already have plans?",
    "groupCode": 0
  },
  {
    "id": 3372,
    "fa": "نوه پسری و نوه دختری من خیلی باهوش هستند",
    "en": "My grandson and granddaughter are very smart",
    "groupCode": 0
  },
  {
    "id": 3373,
    "fa": "من با همسرم زمان های پیشنهادی را چک خواهیم کرد و اگر آنها با برنامه (زمانی) ما مطابقت داشته باشد، من به شما بر خواهم گرداند",
    "en": "I will check the offered time slots with my wife, and if they match our schedule, I will get back to you",
    "groupCode": 0
  },
  {
    "id": 3374,
    "fa": "آیا مادربزرگ شما یک کامپیوتر دارد؟",
    "en": "Does your grandmother have a computer?",
    "groupCode": 0
  },
  {
    "id": 3375,
    "fa": "هنگام کار با تراکنش ها در Spring، به طور کلی توصیه می شود به کار بگیرید قابلیت های مدیریت تراکنش Spring را به جای مدیریت تراکنش های دستی",
    "en": "When working with transactions in Spring, it's generally recommended to leverage Spring's transaction management capabilities instead of manually managing transactions",
    "groupCode": 0
  },
  {
    "id": 3376,
    "fa": "چرا همیشه این عادت را دارید که چیزی روی میز من بگذارید؟",
    "en": "Why do you always have this habit of putting something on my desk?",
    "desc": "\"Habit of\" is followed by a verb in the gerund form (putting), which is grammatically correct. The phrase \"habit to\" is incorrect in this context",
    "groupCode": 0
  },
  {
    "id": 3377,
    "fa": "شرم آورترین جنایاتی که سلبریتی ها به خاطر (آن) دستگیر شده اند چیستند؟",
    "en": "What are the most embarrassing crimes that celebrities have been arrested for?",
    "groupCode": 0
  },
  {
    "id": 3378,
    "fa": "من نیاز دارم به تو در کنارم",
    "en": "I need you by my side",
    "groupCode": 0
  },
  {
    "id": 3379,
    "fa": "من هرگز تو را رها نخواهم کرد",
    "en": "I will never abandon you",
    "groupCode": 0
  },
  {
    "id": 3380,
    "fa": "تو منو شرمنده (خجالت) میدی",
    "en": "You flatter me",
    "desc": "You flatter me: A polite way to downplay a compliment.\n\nYou make me blush: Shows shyness or bashfulness from a compliment.",
    "groupCode": 0
  },
  {
    "id": 3381,
    "fa": "من با شما تماس خواهم گرفت (یک تماس میدم) بعد از اصلاح",
    "en": "I will give you a call after the refinement",
    "groupCode": 0
  },
  {
    "id": 3382,
    "fa": "من یک ایمیل فرستادم و الان دارم انتظار می کشم برای یک پیگیری",
    "en": "I sent an email, and now I'm waiting for a follow-up",
    "groupCode": 0
  },
  {
    "id": 3383,
    "fa": "دختر کوچولو یک یتیم شد پس از (اینکه) والدینش فوت شدن",
    "en": "The little girl became an orphan after her parents passed away",
    "groupCode": 0
  },
  {
    "id": 3384,
    "fa": "آیا حق دفاع از خودش را دارد, و اگر چنین است, پاسخی متناسب چیست؟",
    "en": "Does it have the right to defend itself, and if so, what is a proportionate response?",
    "groupCode": 0
  },
  {
    "id": 3385,
    "fa": "من در مورد (مدتی) این موضوع یک معضل (سر گردانی) اخلاقی دارم",
    "en": "I've been having a moral quandary about the issue",
    "groupCode": 0
  },
  {
    "id": 3386,
    "fa": "او (مرد) خسته و ژولیده به نظر رسید",
    "en": "He looked tired and disheveled",
    "groupCode": 0
  },
  {
    "id": 3387,
    "fa": "ملت مستقل مورد حمله قرار گرفت",
    "en": "The sovereign nation was attacked",
    "groupCode": 0
  },
  {
    "id": 3388,
    "fa": "من واقعاً مخالفم با بسیاری از این سازمان ها برای دلایل خودم",
    "en": "I'm really opposed to a lot of these organizations for my own reasons",
    "groupCode": 0
  },
  {
    "id": 3389,
    "fa": "ما توانایی های آنها را تنزل داده ایم",
    "en": "We've degraded their capabilities",
    "groupCode": 0
  },
  {
    "id": 3390,
    "fa": "اجازه ندهید این تروریست ها آینده شما را دیگر بیش از (آنچه) در حال حاضر انجام دادند نابود کنند",
    "en": "Don't let these terrorists destroy your future any more than they've already done",
    "groupCode": 0
  },
  {
    "id": 3391,
    "fa": "شما یک فرصت دارید نجات دهید کشور خود را قبل از (اینکه) سقوط کند داخل پرتگاه یک جنگ طولانی که منجر خواهد شد به نابودی",
    "en": "You have an opportunity to save your country before it falls into the abyss of a long war that will lead to destruction",
    "groupCode": 0
  },
  {
    "id": 3392,
    "fa": "اعتقادات او (زن) با ارزش های گروه متضاد است",
    "en": "Her beliefs are antithetical to the group's values",
    "groupCode": 0
  },
  {
    "id": 3393,
    "fa": "این برای همه مردمی است کسانیکه گرفتن مهربانیم (به عنوان) نقطه ضعف",
    "en": "This is for all the people who took my kindness as weakness",
    "groupCode": 0
  },
  {
    "id": 3394,
    "fa": "من فقط هرگز واقعا احساس خودم را نداشتم و من کاملاً اعتمادم را از دست دادم",
    "en": "I just never really felt like myself, and I completely lost my confidence",
    "groupCode": 0
  },
  {
    "id": 3395,
    "fa": "من دارم صحبت نمی کنم در مورد افتادن برای کلاهبرداری های آنلاین یا هر چیز مبهمی مانند آن",
    "en": "I'm not talking about falling for online scams or anything dodgy like that",
    "groupCode": 0
  },
  {
    "id": 3396,
    "fa": "من می توانم مغزم را هک کنم در راه های مثبت تا وادارش کنم به کار کردن به طور موثرتر (بیشتر)",
    "en": "I can hack my brain in positive ways to make it work more efficiently",
    "desc": "To make sth happen: منجر شدن، موجب شدن",
    "groupCode": 0
  },
  {
    "id": 3397,
    "fa": "آیا اسلام تا حد زیادی بدترین دین است؟",
    "en": "Is Islam by far the worst religion?",
    "groupCode": 0
  },
  {
    "id": 3398,
    "fa": "من (مست نیست) هوشیارم از الکل برای 7 ماه است",
    "en": "I've been sober from alcohol for 7 months",
    "groupCode": 0
  },
  {
    "id": 3399,
    "fa": "من نمی توانستم بیشتر از (این) مغرور باشم",
    "en": "I could not be more proud",
    "groupCode": 0
  },
  {
    "id": 3400,
    "fa": "شما خواهید دید که چگونه این دوره راه حل کاملی است برای غلبه (شکستن از میان) کشمکش های زبان انگلیسیتان",
    "en": "You'll see how this course is the perfect solution to breaking through your english language struggles",
    "desc": "\"Breaking through\" means overcoming or pushing past an obstacle (in this case, english language struggles). In \"the solution to breaking through your struggles,\" the word \"to\" acts as a preposition, not an infinitive. This is why it’s followed by \"breaking\" (the gerund) rather than \"break.",
    "groupCode": 0
  },
  {
    "id": 3401,
    "fa": "من قرار گرفته ام در معرض ویروس خاصی طی دو ماه گذشته",
    "en": "I've been exposed to a specific virus over the past two months",
    "groupCode": 0
  },
  {
    "id": 3402,
    "fa": "بازوم هنوز دردناک است در جایی که من کبودش کردم",
    "en": "My arm is still tender where I bruised it",
    "groupCode": 0
  },
  {
    "id": 3403,
    "fa": "این یک عفونت پوستی از وان های داغ شلوغ و آلوده است",
    "en": "It's a skin infection from crowded and contaminated hot tubs",
    "groupCode": 0
  },
  {
    "id": 3404,
    "fa": "اگر من خودم امتحانش نکرده بودم، من باورش نمی کردم",
    "en": "If I hadn't tried it myself I wouldn't believe it",
    "groupCode": 0
  },
  {
    "id": 3405,
    "fa": "من نیاز دارم تا آروم شم بعد از آن بحث",
    "en": "I need to cool off after that argument",
    "groupCode": 0
  },
  {
    "id": 3406,
    "fa": "بسیار (وحشی) غافل گیر کننده خواهد بود (فرضی) اگر جیمی کارتر به اندازه کافی زندگی کند که ببیند بازگشت شاه باشد",
    "en": "It would be pretty wild if Jimmy Carter lived long enough to see the return of the Shah",
    "desc": "The sentence \"It would be pretty wild\" means that something is expected to be surprising, exciting, or unpredictable. It's often used informally to express that a situation or event would be extreme or unusual in some way.",
    "groupCode": 0
  },
  {
    "id": 3407,
    "fa": "شلیک نکن او (مرد) عقب مانده است",
    "en": "Don't shoot. He's retarded",
    "groupCode": 0
  },
  {
    "id": 3408,
    "fa": "من داشتم یک دوراهی انتخابی بین ماندن در شغل فعلیم یا پذیرش یک پیشنهاد جدید",
    "en": "I had a choice dilemma between staying at my current job or accepting a new offer",
    "groupCode": 0
  },
  {
    "id": 3409,
    "fa": "دایی من به طور غیرقانونی در ایالات متحده زندگی می کند برای تقریبا یکساله الان. چرا او دیپورت نشده است؟",
    "en": "My uncle has been illegally living in the U.S. for almost a year now. Why hasn't he been deported?",
    "groupCode": 0
  },
  {
    "id": 3410,
    "fa": "شما می خواهید باز کنید (فروپاشی) ساختار درختی خود را در روابط مستقیم بین بالاترین والد و آخرین فرزند",
    "en": "You want to collapse your tree structure into direct relationships between the topmost parent and the last child",
    "groupCode": 0
  },
  {
    "id": 3411,
    "fa": "فرزندم داره مورد زورگویی قرار می گیرد! چه می توانم انجام دهم؟",
    "en": "My child is being bullied! What can I do?",
    "groupCode": 0
  },
  {
    "id": 3412,
    "fa": "من تصمیم گرفتم بگذارم یک سکه در سطل هر بار که من عصبانی (اذیت) می شوم",
    "en": "I decided to put a coin in a bucket every time I got irritated",
    "groupCode": 0
  },
  {
    "id": 3413,
    "fa": "به شما پاداشی داده نخواهد شد پس از بستن پنجره",
    "en": "You will not be rewarded after closing the window",
    "groupCode": 0
  },
  {
    "id": 3414,
    "fa": "او (مرد) عکس خراب می کنه هر بار که من سعی می کنم یه عکس بگیرم",
    "en": "He photobombs every time I try to take a shot",
    "groupCode": 0
  },
  {
    "id": 3415,
    "fa": "چگونه متوقف کنیم چک کردن گوشی خود را هر 10 ثانیه؟",
    "en": "How to stop checking your phone every 10 seconds?",
    "groupCode": 0
  },
  {
    "id": 3416,
    "fa": "من همچنین قصد دارم نمایش بگذارم (رخ کشیدن) برخی از ویژگی های شگفت انگیز",
    "en": "I'm also going to be showing off some of the amazing features",
    "groupCode": 0
  },
  {
    "id": 3417,
    "fa": "به طور خلاصه، دریافت پاداش اغلب دارد یک احساس جبران برای اعمال، در حالی که جایزه دادن بیشتر در مورد به شناخت رسمی از شایستگی یا دستاورد است",
    "en": "In summary, being rewarded often has a sense of compensation for actions, while being awarded is more about formal recognition of merit or achievement",
    "groupCode": 0
  },
  {
    "id": 3418,
    "fa": "کوچکترین گونه پستاندار جهان چیست؟",
    "en": "What is the world's smallest species of mammal?",
    "desc": "\"Species\" is both the singular and plural form",
    "groupCode": 0
  },
  {
    "id": 3419,
    "fa": "یک دعوت تقویم به آدرس ایمیل شما ارسال شده است",
    "en": "A calendar invitation has been sent to your email address",
    "groupCode": 0
  },
  {
    "id": 3420,
    "fa": "پس از یک مبارزه طولانی با سرطان, پرفسور دیروز درگذشت",
    "en": "After a long battle with cancer, the professor passed away yesterday",
    "groupCode": 0
  },
  {
    "id": 3421,
    "fa": "سگ ناگهان به سمت او (مرد) آمد (حمله کرد)",
    "en": "The dog suddenly came at him",
    "desc": "come at = attack",
    "groupCode": 0
  },
  {
    "id": 3422,
    "fa": "او (زن) به تجارت خانوادگی دست یافت زمانی که والدینش بازنشسته شدند",
    "en": "She came into the family business when her parents retired",
    "desc": "come into = inherit",
    "groupCode": 0
  },
  {
    "id": 3423,
    "fa": "قبل از اینکه ما پروژه را شروع کنیم، بیایید فقط مرور کنیم (بررسی کنیم) چه کسی داره چه کاری را انجام میده",
    "en": "Before we start the project, let's just run over who is doing what",
    "desc": "run over = explain briefly",
    "groupCode": 0
  },
  {
    "id": 3424,
    "fa": "میتونی به من بگی چگونه تصادف اتفاق افتاد؟",
    "en": "Can you tell me how the accident came about?",
    "desc": "Come about = happen",
    "groupCode": 0
  },
  {
    "id": 3425,
    "fa": "مواظب باش او (مرد) به حلقت حمله خواهد کرد (برای حلقت میره)",
    "en": "Careful he'll go for your throat",
    "groupCode": 0
  },
  {
    "id": 3426,
    "fa": "کودکان ممکن است نقش بازی کنند در کلاس در یک تلاش تا توجه بگیرند",
    "en": "Children may act up in class in an effort to get attention",
    "groupCode": 0
  },
  {
    "id": 3427,
    "fa": "لطفاً مطمئن شوید که مزاحمتی نداری (بی مزاحم هستی) و به رایانه دسترسی دارید",
    "en": "Please make sure you are undisturbed and have access to a computer",
    "groupCode": 0
  },
  {
    "id": 3428,
    "fa": "ممنون برای کمک کردن دیروز به من",
    "en": "Thanks for helping me yesterday",
    "groupCode": 0
  },
  {
    "id": 3429,
    "fa": "آیا می توانید به من کمک کنید تا این سند را چاپ کنم؟",
    "en": "Can you help me print out this document?",
    "groupCode": 0
  },
  {
    "id": 3430,
    "fa": "بفرما این قهوه ای است که شما از من خواستی که امروز در راه سر کار برایتان بخرم",
    "en": "Here's the coffee you asked me to buy for you on the way to work today",
    "groupCode": 0
  },
  {
    "id": 3431,
    "fa": "من گزارش شما را دیدم و خیلی مفصل (داری جزییات) بود",
    "en": "I saw your report and it was very detailed",
    "groupCode": 0
  },
  {
    "id": 3432,
    "fa": "منم همینو میخواستم بپرسم",
    "en": "I was about to ask the same thing",
    "groupCode": 0
  },
  {
    "id": 3433,
    "fa": "او (مرد) همیشه (یک) کسی است که با ما (می گرده) معاشرت میکنه",
    "en": "He's always the one who runs around with us",
    "groupCode": 0
  },
  {
    "id": 3434,
    "fa": "او (مرد) می داند چگونه ما را شاد (سرحال آوردن) کند",
    "en": "He knows how to cheer us up",
    "groupCode": 0
  },
  {
    "id": 3435,
    "fa": "شاید دوست دخترش دیروز او (مرد) را رها کرده است (دورانداختن)",
    "en": "Maybe his girlfriend dumped him yesterday",
    "groupCode": 0
  },
  {
    "id": 3436,
    "fa": "چی؟ ازش (مرد) دزدی شده؟ من حدس می زنم اینطور باشد",
    "en": "What? He was robbed? I guess so",
    "groupCode": 0
  },
  {
    "id": 3437,
    "fa": "هر (تاکید) مشکلاتی که او (مرد) داشت، او باید خیلی ناراحت باشد و انگیزه کار کردن را از دست داده",
    "en": "Whatever problems he had, he must be very sad and lost motivation to work",
    "groupCode": 0
  },
  {
    "id": 3438,
    "fa": "من پیشنهاد می کنم ما می بایستی امروز به نوبت او (مرد) را شاد (سرحال آوردن) کنیم",
    "en": "I suggest that we should take turns cheering him up today",
    "desc": "Using \"cheering\" (the gerund) is more natural after \"take turns,\" as it implies the continuous action of cheering him up",
    "groupCode": 0
  },
  {
    "id": 3439,
    "fa": "هیچ چیز برای ناراحتی (در مورد) وجود ندارد",
    "en": "There's nothing to be sad about",
    "groupCode": 0
  },
  {
    "id": 3440,
    "fa": "میدونستم سورپرایز میشی",
    "en": "I knew you would be surprised",
    "groupCode": 0
  },
  {
    "id": 3441,
    "fa": "من آینده تو هستم",
    "en": "I'm your future",
    "groupCode": 0
  },
  {
    "id": 3442,
    "fa": "لطفاً توجه داشته باشید که ممکن است طول بکشد تا سه روز کاری  برای آدرس ایمیل شما حذف شود از لیست پستی ما",
    "en": "Please note that it may take up to three business days for your email address to be removed from our mailing list",
    "groupCode": 0
  },
  {
    "id": 3443,
    "fa": "هیچ تصمیمات عجولانه ای نگیر",
    "en": "Don't make any rash decisions",
    "groupCode": 0
  },
  {
    "id": 3444,
    "fa": "کلاهبرداری مدیر عامل شکلی از کلاهبرداری است جاییکه مجرمان ژست می گیرند به عنوان مدیران اجرایی در یک تلاش تا فریب دهند کارمندان را برای اجرای تراکنش های مالی",
    "en": "CEO fraud is a form of fraud where criminals pose as executives in an attempt to trick employees into performing financial transactions",
    "groupCode": 0
  },
  {
    "id": 3445,
    "fa": "من تا داشتم کار را ترک می کردم که (وقتی که) تو زنگ زدی",
    "en": "I was just about to leave work when you called",
    "desc": "I was just about to leave: Implies that you were on the verge of leaving at that exact moment but hadn't left yet. It suggests immediate intent or action that was about to happen.\n\n I wanted to leave: Expresses a desire or intention to leave, but doesn't necessarily imply that you were close to doing so. It reflects a wish or plan to leave, which may or may not have been acted upon.",
    "groupCode": 0
  },
  {
    "id": 3446,
    "fa": "رئیس من بود یا حداقل فکر کردم اینطور بود",
    "en": "It was my boss or at least I thought it was",
    "groupCode": 0
  },
  {
    "id": 3447,
    "fa": "او (زن) به تازگی یک خرید (کسب) بزرگ در آسیا امضا کرده بود",
    "en": "She had just signed off on a major acquisition in Asia",
    "desc": "In short, signed off means completing or ending something, while signed refers specifically to the act of putting a signature on something.",
    "groupCode": 0
  },
  {
    "id": 3448,
    "fa": "برای اینکه معامله نهایی شود، موعد یک پرداخت اولیه بلافاصله بود",
    "en": "In order for the deal to be finalized, an initial payment was due immediately",
    "groupCode": 0
  },
  {
    "id": 3449,
    "fa": "اگر از شما خواسته شد از استاندارد منحرف شوید، تأییدیه بگیر ابتدا",
    "en": "If you are asked to deviate from standard, get approval first",
    "groupCode": 0
  },
  {
    "id": 3450,
    "fa": "فرد ممکن است ظاهر شود خیلی مطمئن و فرمانبردار",
    "en": "The person may appear very assured and commanding",
    "groupCode": 0
  },
  {
    "id": 3451,
    "fa": "مجرمان سایبری می توانند اکنون ایجاد کنند ایمیل های واقعی فریبنده و حتی تقلید کنند سبکی از یک فرد خاص را در پیام",
    "en": "Cybercriminals can now create deceptively genuine emails and even imitate the style of a specific person in the message",
    "groupCode": 0
  },
  {
    "id": 3452,
    "fa": "اگر یافتی یک درخواست را مشکوک، همیشه مشورت کن با یک همکار و تایید کن درخواست قانونی است قبل از گرفتن هر عملی",
    "en": "If you find a request suspicious, always consult a colleague and verify the request is legitimate before taking any action",
    "groupCode": 0
  },
  {
    "id": 3453,
    "fa": "آیا یک پرداختی انجام دادی، اما شما اکنون مشکوکی ممکن است تقلبی بوده باشد؟",
    "en": "Did you make a payment, but you now suspect it might have been fraudulent?",
    "desc": "\"Suspect\" is verb and more about the act of doubting or identifying someone involved in wrongdoing.\n\"Suspicious\" describes the feeling or attitude of doubt.",
    "groupCode": 0
  },
  {
    "id": 3454,
    "fa": "این همیشه مشکوک است!",
    "en": "This is always suspicious!",
    "groupCode": 0
  },
  {
    "id": 3455,
    "fa": "آیا شما از مهاجرت به آلمان پشیمان هستی؟",
    "en": "Do you regret moving to Germany?",
    "groupCode": 0
  },
  {
    "id": 3456,
    "fa": "درمان فوری فشار خون بالا چیست؟",
    "en": "What is the instant remedy for high blood pressure?",
    "groupCode": 0
  },
  {
    "id": 3457,
    "fa": "من معتقدم هند هنوز چندین دهه از (پشت) چین عقب است",
    "en": "I believe India is still lagging decades behind China",
    "groupCode": 0
  },
  {
    "id": 3458,
    "fa": "من دوست ندارم که تعهد آنها فقط در طول ساعات کار طول بکشد",
    "en": "I don't like that their commitment only lasts during work hours",
    "groupCode": 0
  },
  {
    "id": 3459,
    "fa": "او (زن) در واقع یک ساعت زودتر آنجا بود",
    "en": "She was actually an hour early there",
    "groupCode": 0
  },
  {
    "id": 3460,
    "fa": "تیم یک جلسه موردی تشکیل داد برای بحث موضوع فوری",
    "en": "The team set up an ad hoc meeting to discuss the urgent issue",
    "desc": "Ad hoc means something created or done for a specific purpose or situation, often temporary or improvised",
    "groupCode": 0
  },
  {
    "id": 3461,
    "fa": "من نباید خودم را سرزنش (ضرب و شتم) کنم به خاطر اشتباه ",
    "en": "I shouldn't beat myself up over the mistake",
    "desc": "\"Beat yourself up over\" is the correct expression, meaning to criticize or blame yourself excessively for something",
    "groupCode": 0
  },
  {
    "id": 3462,
    "fa": "این دستاورد امکان پذیر نمی بود بدون تلاش های خستگی ناپذیر و فداکاری هر یک از شما",
    "en": "This achievement would not have been possible without the tireless efforts and dedication of each one of you",
    "groupCode": 0
  },
  {
    "id": 3463,
    "fa": "او (مرد) در سمت راست زیر دنده هایش درد دارد",
    "en": "He has pain on the right side below his ribs",
    "groupCode": 0
  },
  {
    "id": 3464,
    "fa": "چه چیزی باعث ادرار کف آلود میشود؟",
    "en": "What causes foamy urine?",
    "groupCode": 0
  },
  {
    "id": 3465,
    "fa": "این خط تنظیم میکند یک قانون دید پیشفرض را تا همه ویژگیها نامرئی بسازد به طور پیشفرض",
    "en": "This line sets a default visibility rule to make all properties invisible by default",
    "desc": "When \"to\" is a preposition (as in \"look forward to,\" \"used to,\" \"committed to\"), it’s followed by a verb in the -ing form.\n\nWhen \"to\" is part of an infinitive (like \"to go,\" \"to see\"), it's followed by the base form of the verb.",
    "groupCode": 0
  },
  {
    "id": 3466,
    "fa": "این خط لغو می کند دید پیش فرض را برای فیلدها فقط, میسازد همه فیلدها را واجد شرایط برای JSON سریال سازی و سریال زدایی",
    "en": "This line overrides the default visibility for fields only, making all fields eligible for JSON serialization and deserialization",
    "groupCode": 0
  },
  {
    "id": 3467,
    "fa": "روند استخدام ما بسیار رقابتی است و شما (ساختیش) خیلی جلو رفتی",
    "en": "Our hiring process is very competitive and you made it very far",
    "groupCode": 0
  },
  {
    "id": 3468,
    "fa": "کی او (زن) قراره (موعد اوست) بچه دار بشه؟",
    "en": "When is she due to have the baby?",
    "groupCode": 0
  },
  {
    "id": 3469,
    "fa": "او (مرد) هرگز خانواده خود را (فرضی) رها نمی کرد, صرف نظر از شرایط",
    "en": "He would never forsake/abandon his family, no matter the circumstances",
    "desc": "Forsake: Often implies a conscious decision to leave something once valued, with a sense of loyalty or commitment being broken. It's commonly used in more emotional or serious contexts. \n\nAbandon: Typically means leaving something or someone without intent to return, often suddenly or irresponsibly. It's used in both neutral and emotional contexts.\n\nExample: \"They had to abandon the project due to lack of funds.\"",
    "groupCode": 0
  },
  {
    "id": 3470,
    "fa": "رئیس (رئیس جلسه) مخالفت های کمیته را لغو کرد و توافق نامه را امضا کرد",
    "en": "The chairman overrode the committee's objections and signed the agreement",
    "groupCode": 0
  },
  {
    "id": 3471,
    "fa": "مسئولیت های روزمره در این نقش چی شکلی است؟",
    "en": "What do the day-to-day responsibilities look like in this role?",
    "groupCode": 0
  },
  {
    "id": 3472,
    "fa": "چه فرصت هایی وجود دارند برای رشد و پیشرفت؟",
    "en": "What opportunities are there for growth and advancement?",
    "groupCode": 0
  },
  {
    "id": 3473,
    "fa": "چگونه شما اندازه گیری می کنید موفقیت در این نقش را؟",
    "en": "How do you measure success in this role?",
    "groupCode": 0
  },
  {
    "id": 3474,
    "fa": "بدون فکر (بدون برنامه قبلی) رفتار نکنید یا چیزها را خیلی سریع فرض نکنید",
    "en": "Don't act impulsively or assume things too quickly",
    "groupCode": 0
  },
  {
    "id": 3475,
    "fa": "\"nicht\" به طور معمول برای نفی افعال، صفت ها یا عبارات خاص استفاده می شود، اما نه اسم های ساده (عریان) بدون یک آرتیکل",
    "en": "\"nicht\" is typically used to negate verbs, adjectives, or specific statements, but not bare nouns without an article",
    "groupCode": 0
  },
  {
    "id": 3476,
    "fa": "من خونه نخواهم بود وقتیکه از مدرسه امشب بیای (وارد بشی). در ضمن، کلیدهایت را فراموش نکنی",
    "en": "I won't be home when you get in from school tonight. Speaking of which, don't forget your keys",
    "groupCode": 0
  },
  {
    "id": 3477,
    "fa": "من خواب خواهم بود تا زمانیکه تو وارد بشی امشب",
    "en": "I'll be asleep by the time you get in tonight",
    "groupCode": 0
  },
  {
    "id": 3478,
    "fa": "دست کم نگیر چقدر تلاش این پروژه خواهد برد",
    "en": "Don't underestimate how much effort this project will take",
    "groupCode": 0
  },
  {
    "id": 3479,
    "fa": "خواهر و برادرها داشتن دعوا می کردند چه کسی خواهد گرفت (فرضی) آخرین تکه پیتزا را",
    "en": "The siblings were quarreling over who would get the last slice of pizza",
    "groupCode": 0
  },
  {
    "id": 3480,
    "fa": "این در مورد چیست؟",
    "en": "What's this about?",
    "groupCode": 0
  },
  {
    "id": 3481,
    "fa": "در زمان سپیده دم، خالق بخشنده و قدرتمند ما بود",
    "en": "At the dawn of time, there was our gracious and powerful creator",
    "desc": "Meaning they will let the other friend start running a few seconds earlier to make it a fairer race",
    "groupCode": 0
  },
  {
    "id": 3482,
    "fa": "من به تو برتری اولیه (شروع جلوتر) خواهم داد",
    "en": "I'll give you the head start",
    "groupCode": 0
  },
  {
    "id": 3483,
    "fa": "چرخ دنده درون ماشین شکسته بود, (داره) باعث بدعمل کردن شده",
    "en": "The cog in the machine was broken, causing it to malfunction",
    "groupCode": 0
  },
  {
    "id": 3484,
    "fa": "من داشتم ارجاع میدادم به شخصی که پشت سرت بود",
    "en": "I was referring to the person who was behind you",
    "groupCode": 0
  },
  {
    "id": 3485,
    "fa": "لوله های قدیمی خورده شده (زنگ زدن) و نیاز به جابجایی دارند",
    "en": "The old pipes were corroded and needed to be replaced",
    "groupCode": 0
  },
  {
    "id": 3486,
    "fa": "آزادی ارزش (برای) مردن داره",
    "en": "Freedom is worth dying for",
    "groupCode": 0
  },
  {
    "id": 3487,
    "fa": "باید چیز جالب تر بیشتری برای خواندن وجود داشته باشد",
    "en": "There has got to be something more interesting to read",
    "groupCode": 0
  },
  {
    "id": 3488,
    "fa": "چنگ نزن (سریع برندار), تو قصد داری چروکش میکنی",
    "en": "Don't grab, you are gonna crease it",
    "groupCode": 0
  },
  {
    "id": 3489,
    "fa": "آنها استخراج کردند این منطقه را برای طلا تابستان گذشته",
    "en": "They mined the area for gold last summer",
    "groupCode": 0
  },
  {
    "id": 3490,
    "fa": "من خوشحالم که امروز رهبری را بر عهده گرفتم",
    "en": "I am happy to take the lead today",
    "groupCode": 0
  },
  {
    "id": 3491,
    "fa": "من متاسفم که من به نوعی اون تصور را به شما دادم",
    "en": "I'm sorry that I somehow gave you that impression",
    "groupCode": 0
  },
  {
    "id": 3492,
    "fa": "اگه من بخاطر تو اخراج شم, خیلی ناراحت خواهم شد",
    "en": "If I get fired because of you, I'll be very upset.",
    "groupCode": 0
  },
  {
    "id": 3493,
    "fa": "من پروتکل ها را به دقت رعایت (کلمه به کلمه) کردم",
    "en": "I followed the protocols to the letter",
    "groupCode": 0
  },
  {
    "id": 3494,
    "fa": "من از طرف او (مرد) بابت اشتباه عذرخواهی می کنم",
    "en": "I apologize on his behalf for the mistake",
    "groupCode": 0
  },
  {
    "id": 3495,
    "fa": "این یک پس رفت است اما نه یک شکست",
    "en": "This is a setback but not a failure",
    "groupCode": 0
  },
  {
    "id": 3496,
    "fa": "ما به صورت عمومی تحقیر می شیم هر زمان که ما اشتباهات می کنیم",
    "en": "We get publicly humiliated whenever we make mistakes",
    "groupCode": 0
  },
  {
    "id": 3497,
    "fa": "امشب من درست وسط چیزی بودم زمانیکه من توسط مامانم گیر (در حال انجام دادن یک کار نادرست) افتادم",
    "en": "Tonight I was right in the middle of something when I got busted by my mom",
    "desc": "Get busted: It means to get caught doing something wrong",
    "groupCode": 0
  },
  {
    "id": 3498,
    "fa": "بیا (سریع باش)، ما (قصد) داره دیرمون می شه الان",
    "en": "Come on, We're gonna be late now",
    "groupCode": 0
  },
  {
    "id": 3499,
    "fa": "دست نگه دار، من نیاز دارم ژاکتم را (سریع) بردارم",
    "en": "Hold on, I need to grab my jacket",
    "groupCode": 0
  },
  {
    "id": 3500,
    "fa": "آیا می توانی علامت را برای من نگه دارید؟",
    "en": "Can you hold up the sign for me?",
    "groupCode": 0
  },
  {
    "id": 3501,
    "fa": "ترافیک نگه خواهد داشت ما را برای حداقل یک ساعت",
    "en": "The traffic jam will hold us up for at least an hour",
    "groupCode": 0
  },
  {
    "id": 3502,
    "fa": "یک مشکل ساز نباش",
    "en": "Don't be a glitch",
    "groupCode": 0
  },
  {
    "id": 3503,
    "fa": "تیم پیروزی خود را جشن می گیرد",
    "en": "The team celebrates their victory",
    "desc": "In English, it's common to use \"their\" as a gender-neutral singular pronoun to refer to a collective noun like \"team.\" While \"team\" is singular, it represents a group of individuals, so \"their\" is used to indicate possession collectively.",
    "groupCode": 0
  },
  {
    "id": 3504,
    "fa": "این تیم مصمم بود رقبای خود را شکست دهد (به پایین کشیدن) در بازی قهرمانی  ",
    "en": "The team was determined to take down their rivals in the championship game",
    "desc": "\nIn English, when referring to a group (like \"team\"), we often use \"their\" instead of \"its\" because the group consists of multiple people. So, \"their\" shows possession for the people in the team. In this case, \"their rivals\" means the rivals of the team.",
    "groupCode": 0
  },
  {
    "id": 3505,
    "fa": "آنها در کوتاه ترین زمان حریفان خود را شکست دادن (به پایین کشیدن)",
    "en": "They took down their opponents in no time",
    "groupCode": 0
  },
  {
    "id": 3506,
    "fa": "واقعیت این است که ما در نیمه راه تکمیل پروژه هستیم",
    "en": "The fact of the matter is that we are halfway to completing the project",
    "groupCode": 0
  },
  {
    "id": 3507,
    "fa": "خیلی ممنون که امروز مرا دعوت کردید (دارید)",
    "en": "Thank you so much for having me today",
    "groupCode": 0
  },
  {
    "id": 3508,
    "fa": "او (مرد) برای برنده شدن در مناظره از لفاظی متقاعدکننده استفاده کرد",
    "en": "He used persuasive rhetoric to win the debate",
    "groupCode": 0
  },
  {
    "id": 3509,
    "fa": "او (مرد) به خاطر مست راننده کردن دستگیر (غافلگیرانه بازرسی کردن) شد",
    "en": "He was busted for drunk driving",
    "groupCode": 0
  },
  {
    "id": 3510,
    "fa": "در واقع, من دیروز دیدمش (زن)",
    "en": "As a matter of fact, I did see her yesterday",
    "desc": "Correct: \"As a matter of fact, I do have experience in that field.\"\nIncorrect: \"As a matter of the fact, I do have experience in that field.\"",
    "groupCode": 0
  },
  {
    "id": 3511,
    "fa": "فردا چه زمانی باید عازم فرودگاه شویم؟",
    "en": "What time do we have to set off for the airport tomorrow?",
    "groupCode": 0
  },
  {
    "id": 3512,
    "fa": "آژیر به اشتباه زده شد",
    "en": "The alarm was set off by mistake",
    "groupCode": 0
  },
  {
    "id": 3513,
    "fa": "من رد کردم عقب نشینی کردن را در طول بحث",
    "en": "I refused to back down during the argument",
    "groupCode": 0
  },
  {
    "id": 3514,
    "fa": "زیباترین لحظه تاریخ است لحظه سقوط یک دیکتاتور",
    "en": "The most beautiful moment in history is the moment a dictator falls",
    "groupCode": 0
  },
  {
    "id": 3515,
    "fa": "یه نفر (الان) کیفش (زن) رو دزدید",
    "en": "Someone just stole her purse",
    "groupCode": 0
  },
  {
    "id": 3516,
    "fa": "دوست من در پنجاه سالگیش (مرد) است",
    "en": "My friend is in his fifties",
    "groupCode": 0
  },
  {
    "id": 3517,
    "fa": "آیا تا به حال احساس گم شدن کردی وقتی همکارانتان شروع به صحبت انگلیسی با یکدیگر؟",
    "en": "Do you ever feel lost when your colleagues start speaking English to each other?",
    "desc": "Did you ever feel – این جمله به یک زمان مشخص در گذشته اشاره دارد. مثل اینکه بپرسیم «آیا در دوران خاصی این حس رو داشتی؟»\n\nDo you ever feel – این حالت به چیزی اشاره دارد که ممکن است همیشه یا به صورت مرتب اتفاق بیفتد، به‌ویژه در زمان حال. یعنی «آیا الآن هم گاهی این حس رو داری؟»\n\nHave you ever felt – این جمله به تجربه‌ای کلی اشاره دارد که از گذشته تا حالا شاید یک بار اتفاق افتاده باشد. مثل اینکه بپرسیم «تا حالا هیچ وقت این حس رو داشتی؟»\n\nSo:\n\nDid = تجربه‌ای در گذشته مشخص\nDo = تجربه‌ای جاری و مرتب\nHave = تجربه‌ای کلی تا به حال",
    "groupCode": 0
  },
  {
    "id": 3518,
    "fa": "آیا یک شارژ اضافی برای تخت اضافه وجود دارد؟",
    "en": "Is there an additional charge for the extra bed?",
    "groupCode": 0
  },
  {
    "id": 3519,
    "fa": "سلام، من علاقه مند به رزرو یک اتاق در هتل شما هستم. من در آگهی دیدم که اتاق برای دو بزرگسال و یک کودک مناسب است",
    "en": "Hello, I'm interested in booking a room at your hotel. I saw in the advertisement that the room is suitable for two adults and one child",
    "groupCode": 0
  },
  {
    "id": 3520,
    "fa": "من متوجه شدم که فقط یک تخت دو نفره دارد. می توانید (فرضی) به من اطلاع دهید آیا این تخت راحت است (فرضی) برای دو بزرگسال و یک کودک یا آیا امکان دارد یک تخت اضافی برای کودک  ترتیب داد؟",
    "en": "I noticed that it only has one double bed. Could you let me know if this bed would be comfortable for two adults and a child, or if it's possible to arrange an extra bed for the child?",
    "groupCode": 0
  },
  {
    "id": 3521,
    "fa": "ول کن تمام امید را و متکی فقط به خودت باش",
    "en": "Let go of all hope and rely only on yourself",
    "groupCode": 0
  },
  {
    "id": 3522,
    "fa": "اگر من بزرگ شده بودم طوری که تو شدی، تو را زنده (فرضی) می خوردم, گوشت و استخوان",
    "en": "If I had grown up the way you did, I would eat you alive, flesh and bone",
    "groupCode": 0
  },
  {
    "id": 3523,
    "fa": "من برای دویدن می روم یک روز در میان نه دو روز در میان",
    "en": "I go for a run every other day not every third day",
    "groupCode": 0
  },
  {
    "id": 3524,
    "fa": "مراقب رفتارت باش",
    "en": "Mind your manners",
    "groupCode": 0
  },
  {
    "id": 3525,
    "fa": "وقتی من دیدم منظره را از قله کوه، کلمات مرا ناکام گذاشتند (زبونم بند اومد)",
    "en": "When I saw the view from the mountaintop, words failed me",
    "groupCode": 0
  },
  {
    "id": 3526,
    "fa": "نگران نباش، فقط ریلکس (باش) و استرس نداشته باش",
    "en": "Don't worry, just relax, and don't stress",
    "groupCode": 0
  },
  {
    "id": 3527,
    "fa": "او (مرد) دچار اختلال روانی شد و او (زن) اینگونه به دنیا آمد",
    "en": "He became mentally impaired, and she was born that way",
    "groupCode": 0
  },
  {
    "id": 3528,
    "fa": "میتونی لطفا اونو تکرار کنی؟",
    "en": "Can you please repeat that?",
    "groupCode": 0
  },
  {
    "id": 3529,
    "fa": "چگونه می توانم به آنجا برسم؟",
    "en": "How can I get there?",
    "groupCode": 0
  },
  {
    "id": 3530,
    "fa": "این سخت نیست, این آسان است",
    "en": "It's not rocket science; it's a piece of cake",
    "groupCode": 0
  },
  {
    "id": 3531,
    "fa": "من از یک قابلمه برای جوشاندن پاستا و از یک ماهی تابه برای درست کردن سس استفاده می کنم",
    "en": "I use a pot to boil the pasta and a saucepan to make the sauce",
    "groupCode": 0
  },
  {
    "id": 3532,
    "fa": "رتیل به آرامی روی زمین خزید",
    "en": "The tarantula /təˈrænt͡ʃuːlə/ crawled slowly on the ground",
    "groupCode": 0
  },
  {
    "id": 3533,
    "fa": "من یک بشقاب از پیراشکی ها سفارش دادم",
    "en": "I ordered a plate of dumplings",
    "groupCode": 0
  },
  {
    "id": 3534,
    "fa": "من کلم ترش را اضافه کردم به غذام برای طعم بیشتر",
    "en": "I added sauerkraut to my food for extra flavor",
    "groupCode": 0
  },
  {
    "id": 3535,
    "fa": "شما در نیمه راه رسیدن (نگه داشتن) هدف خود هستید",
    "en": "You are halfway to keeping your goal",
    "groupCode": 0
  },
  {
    "id": 3536,
    "fa": "تیم متحمل یک پس رفت عمده (بزرگ) شد وقتی بهترین بازیکن تیم مجروح شد",
    "en": "The team suffered a major setback when their best player was injured",
    "groupCode": 0
  },
  {
    "id": 3537,
    "fa": "من اجازه جواب دادن به آن را ندارم",
    "en": "I'm not allowed to answer that",
    "groupCode": 0
  },
  {
    "id": 3538,
    "fa": "من فکر می کنم من آماده ام",
    "en": "\n 1.I think I'm prepared \n 2.I think I'm prepared",
    "groupCode": 0
  },
  {
    "id": 3539,
    "fa": "من قادر نخواهم بود حضور داشته باشم در جلسه یکپارچه سازی (رترو) به خاطر یک جلسه داخلی اتفاق می افتد در همان زمان",
    "en": "I won't be able to attend the retro meeting due to an internal meeting happening at the same time",
    "groupCode": 0
  },
  {
    "id": 3540,
    "fa": "من می خواهم استعفا بدهم از شغل فعلی ام چون من پیشنهاد شغلی بهتری گرفتم",
    "en": "I want to resign from my current job because I got a better job offer",
    "groupCode": 0
  },
  {
    "id": 3541,
    "fa": "وقتی من در ژانویه شروع می کنم، بهتر است شما رفته باشی",
    "en": "When I start in January, you'd better be gone",
    "groupCode": 0
  },
  {
    "id": 3542,
    "fa": "او (مرد) باید به تنهایی عادت کند",
    "en": "He has got to be used to being alone",
    "groupCode": 0
  },
  {
    "id": 3543,
    "fa": "من میتونم محو شدنت رو حس کنم",
    "en": "I can feel you fade away",
    "groupCode": 0
  },
  {
    "id": 3544,
    "fa": "قدم هایت مرا بیدار نگه می دارد",
    "en": "Your steps keep me awake",
    "groupCode": 0
  },
  {
    "id": 3545,
    "fa": "با تشکر از شما برای فرصت شگفت انگیز؛ در حالی که من دارم نمی گردم برای ایجاد یک تغییر در حال حاضر، من مایلم در ارتباط بمانم برای همکاری های آینده احتمالی",
    "en": "Thank you for the amazing opportunity; while I'm not looking to make a change at the moment, I'd like to stay connected for potential future collaborations",
    "groupCode": 0
  },
  {
    "id": 3546,
    "fa": "یک سازمان مقاومت است",
    "en": "It is a resistance organization",
    "groupCode": 0
  },
  {
    "id": 3547,
    "fa": "خرابی (شکست) یک قسمت باعث ایجاد یک فرو ریختنی از مسائل در سراسر سیستم شد",
    "en": "The failure of one part caused a cascade of issues throughout the system",
    "groupCode": 0
  },
  {
    "id": 3548,
    "fa": "آب بر روی صخره ها فرو ریخت و آبشار زیبایی را داشت ایجاد می کرد",
    "en": "The water cascaded down the rocks, creating a beautiful waterfall",
    "desc": "In the sentence \"The water cascaded down the rocks, creating a beautiful waterfall,\" the word \"creating\" refers to an ongoing action that happens as a result of the cascading water.\n\n\"Creating\" is a present participle that describes the effect or result of the cascading action.\nThe main action is in the past tense (\"cascaded\"), while \"creating\" describes what was happening at the same time.",
    "groupCode": 0
  },
  {
    "id": 3549,
    "fa": "من نگرانی هایم را نادیده گرفتم و به کارم ادامه دادم",
    "en": "I brushed off my concerns and continued with my work",
    "desc": "You need \"with\" in this case to indicate the ongoing action related to \"work.\"",
    "groupCode": 0
  },
  {
    "id": 3550,
    "fa": "من اومدم دنبال خانواده ام. آیا آنها اینجا آمدند؟",
    "en": "I came looking for my family. Did they come here?",
    "groupCode": 0
  },
  {
    "id": 3551,
    "fa": "جایز نیست (سیگار) کشیدن در بیمارستان",
    "en": "It's not permissible to smoke at the hospital",
    "groupCode": 0
  },
  {
    "id": 3552,
    "fa": "خواهرم اونجا داره چه می کند و چرا پرده ها بسته است؟",
    "en": "What is my sister doing there and why are the drapes shut?",
    "groupCode": 0
  },
  {
    "id": 3553,
    "fa": "من فکر می کنم او (زن) داره سعی می کند چیزی اتفاق بیافتد ببن شما تا از من انتقام بگیرد (به من پاسخ دهد)",
    "en": "I think she's trying to make something happen with you to get back at me",
    "groupCode": 0
  },
  {
    "id": 3554,
    "fa": "نمی تونست داشته باشد هیچ ارتباطی به این موضوع که او (مرد) دیر کرد",
    "en": "It couldn't have anything to do with the fact that he was late",
    "groupCode": 0
  },
  {
    "id": 3555,
    "fa": "او (زن) داره از شما استفاده می کند تا از من انتقام بگیرد (به من پاسخ دهد)",
    "en": "\n 1.She's using you to get back at me \n 2.She's using you to take revenge on me",
    "groupCode": 0
  },
  {
    "id": 3556,
    "fa": "کدام کشور توسعه یافته تر است؟",
    "en": "Which country is more developed?",
    "groupCode": 0
  },
  {
    "id": 3557,
    "fa": "من انگار (به نظر رسیدن) یادم می آید او (زن) را در مهمانی هفته گذشته ملاقات کردم",
    "en": "I seem to remember meeting her at the party last week",
    "groupCode": 0
  },
  {
    "id": 3558,
    "fa": "چه تعداد امتیاز شما می توانید بگیرید؟",
    "en": "How many points can you get?",
    "groupCode": 0
  },
  {
    "id": 3559,
    "fa": "دست خطش (مرد) خیلی شلخته است من نمی توانم بخوانمش",
    "en": "His handwriting is so sloppy I can't read it",
    "groupCode": 0
  },
  {
    "id": 3560,
    "fa": "اعضای ممتاز 2.6 برابر بیشتر احتمال دارند استخدام شوند به طور متوسط",
    "en": "Premium members are 2.6x more likely to get hired on average",
    "groupCode": 0
  },
  {
    "id": 3561,
    "fa": "این جلسه لغو شد",
    "en": "This meeting got canceled",
    "groupCode": 0
  },
  {
    "id": 3562,
    "fa": "من یک بعدازظهر آزاد دارم و یک هزار چیزهایی (که) من نیاز دارم انجام دهم، پس روی چه باید کار کنم در این زمان؟",
    "en": "I have a free afternoon and a thousand things I need to get done, so what should I work on during this time?",
    "groupCode": 0
  },
  {
    "id": 3563,
    "fa": "چقدر من انتظار دارم اون وظیفه طول بکشد؟",
    "en": "How long do I expect that task to take?",
    "groupCode": 0
  },
  {
    "id": 3564,
    "fa": "اگر شما ضربه بزنید اینجا را همین الان، شما می توانید یک آزمایش رایگان 7 روزه را امتحان کنید",
    "en": "If you tap here right now you can try a 7-Day free trial",
    "groupCode": 0
  },
  {
    "id": 3565,
    "fa": "چرا ادامش نمیدی (بلندش نمی کنی) از جایی که او (زن) متوقف کرد (انداخت)؟",
    "en": "Why don't you pick it up (from) where she left off?",
    "desc": "Without \"from\": Casual and direct.\nWith \"from\": Slightly formal, emphasizes the starting point.",
    "groupCode": 0
  },
  {
    "id": 3566,
    "fa": "اگر این فراتر می رود از (آن) چه ممکن است برای بودجه شما، من به تصمیم شما احترام می گذارم و آرزو می کنم برای شما بهترین را در یافتن کاندیدای مناسب",
    "en": "If this exceeds what is feasible for your budget, I respect your decision and wish you the best in finding the right candidate",
    "groupCode": 0
  },
  {
    "id": 3567,
    "fa": "علی با کیست؟",
    "en": "Who's Ali with?",
    "groupCode": 0
  },
  {
    "id": 3568,
    "fa": "من تو رو با هیچ کدوم (بیشتر) از دوستام آشنا نمی کنم",
    "en": "I'm not setting you up with any more of my friends",
    "groupCode": 0
  },
  {
    "id": 3569,
    "fa": "نام ببرید یکی از دوستانت را (که) من اونطور (اون روش) انجام دادم",
    "en": "Name one friend of yours I did that way",
    "groupCode": 0
  },
  {
    "id": 3570,
    "fa": "باور کنید یا نه درست است",
    "en": "Believe it or not it's true",
    "groupCode": 0
  },
  {
    "id": 3571,
    "fa": "من گلو درد دارم و سرفه ام شروع شده است، بنابراین امروز به محل کار نمی آیم",
    "en": "I have a sore throat and I've started coughing, so I won't come to the office today",
    "groupCode": 0
  },
  {
    "id": 3572,
    "fa": "ما می خواستیم به شما اطلاع دهیم که ما تصمیم گرفته ایم با کاندیداتوری شما جلو نرویم",
    "en": "We wanted to let you know that we have decided not to move forward with your candidacy",
    "groupCode": 0
  },
  {
    "id": 3573,
    "fa": "ما خوشحال خواهیم شد (فرضی) اگر شما ما را مد نظر داشته باشید و به طور منظم سایت ما را برای فرصت های مناسب چک کنید",
    "en": "We would be happy if you kept considering us and regularly check our site for fitting opportunities",
    "groupCode": 0
  },
  {
    "id": 3574,
    "fa": "انتظار حقوق شما فراتر می رود از بودجه برنامه ریزی شده ما برای این موقعیت",
    "en": "Your salary expectation exceeds our planned budget for the position",
    "groupCode": 0
  },
  {
    "id": 3575,
    "fa": "من دیگر شیرینی نمی خورم زیرا نمی خواهم قند بیشتری در رژیم غذایی ام",
    "en": "I don't eat sweets anymore because I don't want any more sugar in my diet",
    "desc": "Use \"anymore\" for time-related meanings (no longer or nowadays).\nUse \"any more\" when referring to quantity (additional items or amounts).",
    "groupCode": 0
  },
  {
    "id": 3576,
    "fa": "بستگی دارد چقدر عمیق رابطه او (زن) و پدرش بوده",
    "en": "It depends on how deep the relationship between her and her father was",
    "groupCode": 0
  },
  {
    "id": 3577,
    "fa": "من مجبور شدم کون گشادم رو جمع کنم تا پایان دهم به پروژه قبل از آخرین مهلت (ضرب الاجل)",
    "en": "I had to work my ass off to finish the project before the deadline",
    "groupCode": 0
  },
  {
    "id": 3578,
    "fa": "من (در حال حاضر) صادق هستم",
    "en": "I am being honest",
    "groupCode": 0
  },
  {
    "id": 3579,
    "fa": "پدرت با چه ماشینی تو را به مدرسه (رانندگی) می رساند؟",
    "en": "What car did your dad drive you to school in?",
    "groupCode": 0
  },
  {
    "id": 3580,
    "fa": "بیایید ببریمش دورتر و ببینیم کجا این ایده منجر می شود",
    "en": "Let's take it farther and see where this idea leads",
    "groupCode": 0
  },
  {
    "id": 3581,
    "fa": "من PR مربوطه را ادغام کرده ام، بنابراین شما می تونید برید جلو و الان شروع کنید",
    "en": "I've merged the relevant PR, so you can go ahead and start now",
    "groupCode": 0
  },
  {
    "id": 3582,
    "fa": "من همین الان قطع کردم گوشی رو با خواهرم",
    "en": "I just got off the phone with my sister",
    "groupCode": 0
  },
  {
    "id": 3583,
    "fa": "او (مرد) کسی است که با او (زن) وقت گذرانی می کرد (شوخی می کرد)",
    "en": "He is the one who fooled around with her",
    "groupCode": 0
  },
  {
    "id": 3584,
    "fa": "این مشکل کیه؟ مال ماست",
    "en": "Whose problem is this? It's ours",
    "groupCode": 0
  },
  {
    "id": 3585,
    "fa": "او (مرد) آنقدر سرسخت است که بپرسد برای کمک",
    "en": "He is too stubborn to ask for help",
    "groupCode": 0
  },
  {
    "id": 3586,
    "fa": "به من گوش کن, لطفا",
    "en": "Hear me out, please",
    "groupCode": 0
  },
  {
    "id": 3587,
    "fa": "من کسی دیگری را نداشتم که بپرسم برای کمک",
    "en": "I had no one else to ask for help",
    "groupCode": 0
  },
  {
    "id": 3588,
    "fa": "طول می کشد بیش از چهار برابر تلاشی (که) او (مرد) می خواهد انجام دهد (بره داخلش)",
    "en": "It takes more than four times the effort he wants to go through",
    "groupCode": 0
  },
  {
    "id": 3589,
    "fa": "من نقشه می ریزم تا نزدیک شوم به این چالش به یک روش عمل گرایانه, اولویت قرار دادن کارایی و نتایج",
    "en": "I plan to approach this challenge in a pragmatic way, prioritizing efficiency and results",
    "groupCode": 0
  },
  {
    "id": 3590,
    "fa": "2 ساعت ممکن نبود طول بکشد اگر او (مرد) کمک خواسته بود و ما اصلاً این مشکل را (فرضی) نمی داشتیم",
    "en": "It might have not taken 2 hours if he had asked for help, and we wouldn't be having this problem at all",
    "groupCode": 0
  },
  {
    "id": 3591,
    "fa": "من نمی توانم درست غذا بخورم زیرا ورم لوزه دارم",
    "en": "I can't eat properly because I have tonsillitis /ˌtɒnsɪˈlaɪtɪs/",
    "groupCode": 0
  },
  {
    "id": 3592,
    "fa": "آن مدتی طول کشید. آیا توقف کردی برای یک میان وعده (اسنک)؟",
    "en": "That took awhile. Did you stop for a snack?",
    "groupCode": 0
  },
  {
    "id": 3593,
    "fa": "ایمیل با یک لحن (غیرشخصی) بی احساسی نوشته شده بود، فاقد هرگونه گرما یا دوستی",
    "en": "The email was written in an impersonal tone, lacking any warmth or friendliness",
    "groupCode": 0
  },
  {
    "id": 3594,
    "fa": "تمرین برای یک ماراتن برای بی عرضه ها نیست. شما نیاز دارید متعهد باشید و کار کنید سخت",
    "en": "Training for a marathon is not for wimps. You need to be committed and work hard",
    "groupCode": 0
  },
  {
    "id": 3595,
    "fa": "من به سوی سرنوشتی سوق داده شده ام (که) من نمی توانم فرار کنم",
    "en": "I'm led away towards a fate I can't flee",
    "desc": "\"I'm\" = Subject + verb \"am\" (present tense of \"to be\").\n\"led away\" = Passive verb (past participle \"led\" combined with \"away\" as an adverb showing direction).\n\"towards a fate I can't flee\" = Prepositional phrase indicating where you're being led.\n",
    "groupCode": 0
  },
  {
    "id": 3596,
    "fa": "او (مرد) در راه خانه اش است",
    "en": "He's on his way home",
    "groupCode": 0
  },
  {
    "id": 3597,
    "fa": "من یک نوبت پزشکی (ساعت) ۱۰ دارم، من قادر نخواهم بود حضور پبدا کنم در دیلی",
    "en": "I have a medical appointment at 10, I won't be able to attend the daily",
    "groupCode": 0
  },
  {
    "id": 3598,
    "fa": "ممنون از شما برای اطلاع رسانی من در مورد حادثه",
    "en": "Thank you for informing me about the incident",
    "groupCode": 0
  },
  {
    "id": 3599,
    "fa": "من همچنین با ایلیا در مورد رفتارش صحبت کرده ام و تأکید خواهم کرد که چنین اقداماتی قابل قبول نیست, صرف نظر از شرایط",
    "en": "I have also spoken to Ilia about his behavior and will further emphasize that such actions are not acceptable, regardless of the circumstances",
    "groupCode": 0
  },
  {
    "id": 3600,
    "fa": "من می خواستم بپرسم آیا هر دو مسئول تمیز کردن برای میزها بودند، همانطور که به نظر می رسد هر دو درگیر بودن در خط خطی کردن روی میزها",
    "en": "I wanted to ask if both were being held responsible for cleaning the tables, as it seems they were both involved in scribbling on the tables",
    "groupCode": 0
  },
  {
    "id": 3601,
    "fa": "من قدردانی می کنم (از) درک و تلاش های شما در پرداختن (آدرس دادن) به این موضوع و من ادامه خواهم داد به کار کردن با ایلیا بروی رفتار بهتر در آینده",
    "en": "I appreciate your understanding and efforts in addressing this matter, and I will continue to work with Ilia on better behavior in the future",
    "groupCode": 0
  },
  {
    "id": 3602,
    "fa": "آیا می دانید خیار چه نامیده می شود در آلمانی؟",
    "en": "Do you know what cucumber is called in German?",
    "groupCode": 0
  },
  {
    "id": 3603,
    "fa": "کجا بودی؟ شما باورش نمی کنید",
    "en": "Where have you been? You wouldn't believe it",
    "groupCode": 0
  },
  {
    "id": 3604,
    "fa": "بچه ها تمام روز شیطنت کرده اند",
    "en": "The kids have been playing up all day",
    "groupCode": 0
  },
  {
    "id": 3605,
    "fa": "میتونی شما (مودبانه) یه ذره صدا را کم کنی؟ واقعا بلند است",
    "en": "Could you turn down the volume a bit? It's really loud",
    "groupCode": 0
  },
  {
    "id": 3606,
    "fa": "آیا آن جلسه ای که داشتی برنامه ریزی می کردی (تاکید) اتفاق افتاد (برگزار شد)؟",
    "en": "Did the meeting you were planning ever come off?",
    "groupCode": 0
  },
  {
    "id": 3607,
    "fa": "آیا شما متوجه شدی عصبی بودنش (مرد) را؟",
    "en": "Did you pick up on his nervousness?",
    "groupCode": 0
  },
  {
    "id": 3608,
    "fa": "داروهای مختلف عمل می کنند روی قسمت های مختلف بدن شما در روش های مختلف زیادی",
    "en": "Different drugs act on different parts of your body in many different ways",
    "groupCode": 0
  },
  {
    "id": 3609,
    "fa": "سعی نکن دنبال من بیای",
    "en": "Don't try to come after me",
    "groupCode": 0
  },
  {
    "id": 3610,
    "fa": "من تو عجله ننداز",
    "en": "Don't rush me",
    "groupCode": 0
  },
  {
    "id": 3611,
    "fa": "چرا باید تو چیزی بگویی که تو بعداً عذرخواهی کنی برای (آن)؟",
    "en": "Why should you say something that you later apologize /əˈpɑːləˌdʒaɪz/ for?",
    "groupCode": 0
  },
  {
    "id": 3612,
    "fa": "چگونه تصمیم می گیری آیا ارسالش کنی به این سرویس یا اون یکی؟",
    "en": "How do you decide whether to send it to this service or that one?",
    "groupCode": 0
  },
  {
    "id": 3613,
    "fa": "پروفایل شما داره مورد توجه قرار می گیرد",
    "en": "Your profile is getting noticed",
    "groupCode": 0
  },
  {
    "id": 3614,
    "fa": " ۱.پوست درخت \n ۲.کنده (درخت) \n ۳.تنه (درخت) - صندوق عقب (اتومبیل) \n ۴.هیزم \n ۵.تکه چوب \n ۶.شاخه",
    "en": "1.Bark \n 2.Stump \n 3.Trunk \n 4.Log \n 5.Stick \n 6.Branch",
    "groupCode": 0
  },
  {
    "id": 3615,
    "fa": "آیا می توانید شعله را روشن نگه دارید؟",
    "en": "Can you keep the flame lit?",
    "desc": "\"lit\" in that sentence is an adjective",
    "groupCode": 0
  },
  {
    "id": 3616,
    "fa": "او (زن) یک شمع روشن کرد",
    "en": "She lit a candle",
    "groupCode": 0
  },
  {
    "id": 3617,
    "fa": "من تصمیم گرفتم کاندید شوم برای مدیریت مهندس کارکنان تا مسئولیت های رهبری بیشتری را بر عهده بگیرم",
    "en": "I decided to run for Staff Engineer Manager to take on more leadership responsibilities",
    "groupCode": 0
  },
  {
    "id": 3618,
    "fa": "من به طور اتفاقی قرارداد و حقوق همکارم را دیدم",
    "en": "I accidentally saw my coworker's contract and salary",
    "groupCode": 0
  },
  {
    "id": 3619,
    "fa": "من احساس می کنم (مثل) من حقوق کمتری دریافت می کنم (الان کم دریافتم). آیا باید مطرحش کنم با رئیسم؟",
    "en": "I feel like I'm being underpaid. Should I bring it up with my boss?",
    "groupCode": 0
  },
  {
    "id": 3620,
    "fa": "می تواند یک افسر پلیس شما را دستگیر کند اگر دارید می خوابید مست در وسیله نقلیه خود اما رانندگی نکرده اید؟",
    "en": "Can a police officer arrest you if you're sleeping drunk in your vehicle but haven't been driving?",
    "groupCode": 0
  },
  {
    "id": 3621,
    "fa": "هنوز برنده نشدیم؟",
    "en": "Haven't we won yet?",
    "groupCode": 0
  },
  {
    "id": 3622,
    "fa": "متاسفم برای وحشت. من وحشت نکردم",
    "en": "Sorry for the panic. I wasn't panicked",
    "groupCode": 0
  },
  {
    "id": 3623,
    "fa": "ما غرور و تعصب اشتباهی داریم که باید تغییر کند",
    "en": "We have misguided pride and prejudice that need to be changed",
    "groupCode": 0
  },
  {
    "id": 3624,
    "fa": "همه چیز عالی کار می کند از زمانی که شما رفتید",
    "en": "Everything has been working perfectly since you left",
    "groupCode": 0
  },
  {
    "id": 3625,
    "fa": "اگر نقطه پایانی فراخوان شود چندین بار به هر دلیلی، ما داده را ذخیره خواهیم کرد هر بار فراخوان شود",
    "en": "If the endpoint is called multiple times for any reason, we will persist the data each time it's called",
    "groupCode": 0
  },
  {
    "id": 3626,
    "fa": "فرض کردن است در مورد تصور یا در نظر گرفتن چیزی ممکن. فرض کنید باران می بارد؛ چه خواهیم کرد",
    "en": "Suppose is about imagining or considering something as possible. Suppose it rains; what will we do?",
    "groupCode": 0
  },
  {
    "id": 3627,
    "fa": "پذیرفتن (فرض کردن) است در مورد باور کردن چیزی است درست بدون دلیل. من فرض می کنم که او به دلیل ترافیک دیر کرده است",
    "en": "Assume is about believing something is true without proof. I assume he's late because of traffic",
    "groupCode": 0
  },
  {
    "id": 3628,
    "fa": "آیا جلسه داره ضبط می شود؟",
    "en": "Is the meeting being recorded?",
    "groupCode": 0
  },
  {
    "id": 3629,
    "fa": "آیا دویست مهمان برای پارتی زیاد است؟",
    "en": "Are two hundred guests too many for the party?",
    "groupCode": 0
  },
  {
    "id": 3630,
    "fa": "من در آرنجم احساس گزگز دارم",
    "en": "I have a tingling feeling in my elbow",
    "groupCode": 0
  },
  {
    "id": 3631,
    "fa": "من خریدم یک کلاه بافتنی پشمی با افتاب گیر و فلپ های گوش برای گرم نگه داشتن",
    "en": "I bought a wool knitted hat with a visor and ear flaps to keep warm",
    "groupCode": 0
  },
  {
    "id": 3632,
    "fa": "من ای کاش آن پول را خرج نکرده بودم",
    "en": "I wish I hadn't spent that money",
    "groupCode": 0
  },
  {
    "id": 3633,
    "fa": "شما می توانید تبدیل کنیدش برای پول بسیار کمتر و در زمان بسیار کمتر",
    "en": "You can transform it for much less money and in much less time",
    "groupCode": 0
  },
  {
    "id": 3634,
    "fa": "من مردم زیادی را به مهمانی دعوت کردم اما فقط یک تعداد انگشت شماری از آنها حاضر شدند",
    "en": "I invited a lot of people to the party but only a handful of them showed up",
    "groupCode": 0
  },
  {
    "id": 3635,
    "fa": "من تعداد انگشت شماری از دوستان داشتم که واقعاً پشتم را داشتند",
    "en": "I had a handful of friends that really had my back",
    "groupCode": 0
  },
  {
    "id": 3636,
    "fa": "او (مرد) امروز یک کمی شیطون است",
    "en": "He is a bit of a handful today",
    "groupCode": 0
  },
  {
    "id": 3637,
    "fa": "من دوستان زیادی ندارم، من یک چند تا دوست دارم",
    "en": "I don't have many friends, I have a handful of friends",
    "groupCode": 0
  },
  {
    "id": 3638,
    "fa": "چرا کسی آن را به من نگفته است؟",
    "en": "Why hasn't anyone told me that?",
    "groupCode": 0
  },
  {
    "id": 3639,
    "fa": "آیا این درست است که برخی از دانش آموزان در کلاس یک تلاش (ساختن) نمی کنند؟",
    "en": "Is it true that some students don't make an effort in class?",
    "groupCode": 0
  },
  {
    "id": 3640,
    "fa": "من نمی خواستم تلاش (ساختن) زیادی کنم",
    "en": "I didn't want to make much of an effort",
    "groupCode": 0
  },
  {
    "id": 3641,
    "fa": "تلاش او (مرد) مورد قدردانی رئیسش قرار گرفت",
    "en": "His effort was appreciated by his boss",
    "groupCode": 0
  },
  {
    "id": 3642,
    "fa": "من یک تاول زدم (گرفتم) روی پایم از راه رفتن زیاد",
    "en": "I got a blister on my foot from walking too much",
    "groupCode": 0
  },
  {
    "id": 3643,
    "fa": "این اصلاحات می تواند (فرضی) تسریع کند آزادسازی بازار را",
    "en": "These reforms could precipitate the liberalization /ˌlɪbrələˈzeɪʃn̩/ of the market",
    "groupCode": 0
  },
  {
    "id": 3644,
    "fa": "من می خواستم ایجاد کنم یک ائتلاف به منظور شکل دادن یک دولت ملی",
    "en": "I wanted to create a coalition in order to form a national government",
    "groupCode": 0
  },
  {
    "id": 3645,
    "fa": "محقق نشد چنانکه امید داشته بودم",
    "en": "It didn't come true as I had hoped",
    "groupCode": 0
  },
  {
    "id": 3646,
    "fa": "این کشور قرار گرفت تحت حکومت نظامی برای بازگرداندن نظم",
    "en": "The country was placed under martial law to restore order",
    "groupCode": 0
  },
  {
    "id": 3647,
    "fa": "اولین تلاش من در صحبت کردن به زبان انگلیسی مواجه شد با تمسخر از دوستانم",
    "en": "My first attempt at speaking English was met with mockery from my friends",
    "groupCode": 0
  },
  {
    "id": 3648,
    "fa": "آیا درست است که آلمانی ها همیشه شکایت می کنند؟",
    "en": "Is it true that Germans always complain?",
    "groupCode": 0
  },
  {
    "id": 3649,
    "fa": "چرا می خواهی مرا به این (موضوع) بکشانی؟",
    "en": "Why do you want to drag me into this?",
    "groupCode": 0
  },
  {
    "id": 3650,
    "fa": "همیشه چیزی برای شکایت وجود دارد",
    "en": "There's always something to complain about",
    "groupCode": 0
  },
  {
    "id": 3651,
    "fa": "من می گویم (فرضی) بیایید تمامش کنیم امروز و تلاش کنیم دوباره فردا",
    "en": "I would say let's call it a day and try again tomorrow",
    "groupCode": 0
  },
  {
    "id": 3652,
    "fa": "ما  نیاز داریم  به آن شاخص منحصر به فرد روی جدول (پایگاه داده)",
    "en": "We need that unique index on the table",
    "groupCode": 0
  },
  {
    "id": 3653,
    "fa": "من مطمئن خواهم شد جملات مختصر و ساده هستند برای به خاطر سپاری راحتتر",
    "en": "I'll ensure the sentences are concise and straightforward for easier memorization",
    "groupCode": 0
  },
  {
    "id": 3654,
    "fa": "من کف می زنم فداکاری و کار سخت شما را در این پروژه",
    "en": "I applaud your dedication and hard work on this project",
    "groupCode": 0
  },
  {
    "id": 3655,
    "fa": "او داره (مرد) علف های هرز باغ را می کشد (کندن)",
    "en": "He's pulling the weeds in the garden",
    "groupCode": 0
  },
  {
    "id": 3656,
    "fa": "آیا سطل پر از آب است؟",
    "en": "Is the bucket full of water?",
    "groupCode": 0
  },
  {
    "id": 3657,
    "fa": "آیا مداد تیز است یا کند؟",
    "en": "Is the pencil sharp or dull?",
    "groupCode": 0
  },
  {
    "id": 3658,
    "fa": "چگونه غوز را متوقف کنیم؟",
    "en": "How to stop slouching?",
    "groupCode": 0
  },
  {
    "id": 3659,
    "fa": "بیایید این PR را تأیید و ادغام کنیم تا جلوگیری کنیم از مشکلات آینده",
    "en": "Let's approve and merge this PR to prevent future problem",
    "groupCode": 0
  },
  {
    "id": 3660,
    "fa": "من مطمئن خواهم شد او (مرد) می آورد آنها را به مدرسه در اسرع وقت تا که شما شما بتوانید آن ها را پس بگیرید قبل از تعطیلات",
    "en": "I will make sure he brings them to school as soon as possible so that you can have them back before the holidays",
    "groupCode": 0
  },
  {
    "id": 3661,
    "fa": "علاوه بر این، همانطور که سال داره به پایان می رسد, من می خواستم بپرسم در مورد دو موضوع مهم در مورد پسرم",
    "en": "Additionally, as the year is coming to a close, I wanted to ask about two important topics regarding my son",
    "groupCode": 0
  },
  {
    "id": 3662,
    "fa": "عملکرد کلی او (مرد) در مدرسه چگونه است؟",
    "en": "How is his overall performance in school?",
    "groupCode": 0
  },
  {
    "id": 3663,
    "fa": "شانس های او (مرد) برای واجد شرایط بودن در Gymnasium یا Realschule چیست؟",
    "en": "What are his chances of qualifying for Gymnasium or Realschule?",
    "groupCode": 0
  },
  {
    "id": 3664,
    "fa": "در صورت امکان، من قدردانی خواهم کرد (فرضی) (از) بازخورد شما به صورت کتبی",
    "en": "If possible, I would appreciate your feedback in writing",
    "groupCode": 0
  },
  {
    "id": 3665,
    "fa": "از طرف دیگر، من خوشحال خواهم شد (فرضی) برنامه ریزی کردن یک جلسه بعد از مدرسه در زمانی که برای شما مناسب باشد (کار کند)",
    "en": "Alternatively, I would be happy to schedule a meeting after school at a time that works for you",
    "groupCode": 0
  },
  {
    "id": 3666,
    "fa": "در آخر، من واقعا (درستی) قدردانی می کنم (از) حمایت و راهنمایی شما به او (مرد)",
    "en": "Lastly, I truly appreciate your support and guidance to him",
    "groupCode": 0
  },
  {
    "id": 3667,
    "fa": "من پیشاپیش کریسمس و سال نو را به شما تبریک می گویم",
    "en": "I wish you a Merry Christmas and a Happy New Year in advance",
    "groupCode": 0
  },
  {
    "id": 3668,
    "fa": "من مجبورم صحبت کنم با افرادی که نمی شناسم",
    "en": "I’m forced to talk to people I don’t know",
    "groupCode": 0
  },
  {
    "id": 3669,
    "fa": "در صورت (اینکه) شما اهمیت می دهید، اینجا چند کلمه های کلیدی هستند (که) شما باید بدانید",
    "en": "In case you care, here are some keywords you should know",
    "groupCode": 0
  },
  {
    "id": 3670,
    "fa": "فقط یک روز پیش پا افتاده دیگر در کار",
    "en": "Just another mundane day at work",
    "groupCode": 0
  },
  {
    "id": 3671,
    "fa": "چگونه قرار بود بدانم که اتفاق خواهد افتد (فرضی)؟",
    "en": "How was I supposed to know that would happen?",
    "groupCode": 0
  },
  {
    "id": 3672,
    "fa": "مطمئنا, داشتن یک دم است یکی از بزرگترین نعمت هایی که خداوند به حیوانات داده است. تصور کن یک T-Rex با عظمت بدون دم!",
    "en": "Surely, having a tail is one of the greatest blessings that God has given to animals. Imagine a giant T-Rex without a tail!",
    "groupCode": 0
  },
  {
    "id": 3673,
    "fa": "اگه من میخواستم برم, من تا حالا رفته بودم",
    "en": "If I wanted to go, I would've gone by now",
    "groupCode": 0
  },
  {
    "id": 3674,
    "fa": "چرا نمی توانند کارتونها مانند این باشند دیگر؟",
    "en": "Why can't cartoons be like this anymore?",
    "groupCode": 0
  },
  {
    "id": 3675,
    "fa": "او (مرد) به شدت برای امتحان درس خواند",
    "en": "He studied rigorously for the exam",
    "groupCode": 0
  }
]