[
  {
    "id": 3001,
    "fa": "از غذای آن رستوران مسمومیت غذایی گرفتم. من دیگر هرگز آنجا نمی روم",
    "en": "I got food poisoning from the food at that restaurant. I'm never going there again",
    "desc": "\"I'm never going there again.\"\n\nPresent continuous; suggests a strong, immediate decision.\n\"I will never go there again.\"\n\nSimple future; emphasizes a definite decision about the future.",
    "groupCode": 0
  },
  {
    "id": 3002,
    "fa": "تو باید کمی بخوابی چون دیر شده",
    "en": "You should get some sleep because it's getting late",
    "groupCode": 0
  },
  {
    "id": 3003,
    "fa": "بیرون داره سرد میشه",
    "en": "\n 1.It's getting cold outside \n 2.It's becoming cold outside",
    "groupCode": 0
  },
  {
    "id": 3004,
    "fa": "او (مرد) خیلی راحت عصبانی می شود",
    "en": "\n 1.He gets angry very easily \n 2.He becomes angry very easily",
    "groupCode": 0
  },
  {
    "id": 3005,
    "fa": "فکر می کنید خواننده های معروف هنوز روی صحنه عصبی می شوند؟",
    "en": "Do you think famous singers still get nervous on stage?",
    "groupCode": 0
  },
  {
    "id": 3006,
    "fa": "من هنوز آماده نیستم اما من باید آماده شوم",
    "en": "I'm not ready yet but I have to get ready",
    "desc": "",
    "groupCode": 0
  },
  {
    "id": 3007,
    "fa": "Be یک حالت را توصیف می کند و Get یک عمل را توصیف می کند",
    "en": "Be describes a state and Get describes an action",
    "groupCode": 0
  },
  {
    "id": 3008,
    "fa": "در سال ۱۹۴۷, والدینم ازدواج نکرده بودند. آنها مجرد بودند. والدینم در سال ۱۹۴۸ ازدواج کردند",
    "en": "In 1947, my parents weren't married. They were single. My parents got married in 1948",
    "groupCode": 0
  },
  {
    "id": 3009,
    "fa": "هیچ چیز بیشتر از میهن پرستی به انسان قدرت نمی دهد",
    "en": "Nothing empowers man more than patriotism",
    "groupCode": 0
  },
  {
    "id": 3010,
    "fa": "آن مکان چند تا سرسره دارد؟",
    "en": "How many slides does that place have?",
    "groupCode": 0
  },
  {
    "id": 3011,
    "fa": "نه یعنی نه",
    "en": "No means no",
    "groupCode": 0
  },
  {
    "id": 3012,
    "fa": "چگونه قرار است به آن پاسخ دهم؟",
    "en": "How am I supposed to respond to that?",
    "groupCode": 0
  },
  {
    "id": 3013,
    "fa": "باتری گوشیم تموم شده",
    "en": "My phone battery is dead",
    "groupCode": 0
  },
  {
    "id": 3014,
    "fa": "من کابل دارم. من فقط به یک سر شارژر نیاز دارم",
    "en": "I have the cable. I just need a charger brick",
    "groupCode": 0
  },
  {
    "id": 3015,
    "fa": "پریز برق کجاست؟",
    "en": "Where is the outlet?",
    "groupCode": 0
  },
  {
    "id": 3016,
    "fa": "من این مشکل را از زمانی که یادم می آید داشتم",
    "en": "I have had this problem as long as I remember",
    "groupCode": 0
  },
  {
    "id": 3017,
    "fa": "آیا می توانم فردا با شلوارک به آفیس بیام؟",
    "en": "Can I come to office wearing shorts tomorrow?",
    "groupCode": 0
  },
  {
    "id": 3018,
    "fa": "ورق ها را بُر بزن و به هر بازیکن هفت تا بده",
    "en": "Shuffle the cards and deal out seven to each player",
    "groupCode": 0
  },
  {
    "id": 3019,
    "fa": "به احتمال زیاد است که فردا باران خواهد بارید",
    "en": "\n 1.It's highly likely that it will rain tomorrow \n 2.It's most likely that it will rain tomorrow",
    "groupCode": 0
  },
  {
    "id": 3020,
    "fa": "آنها می توانند آنالیز کنند چگونه مردم کار را انجام می دهند",
    "en": "They can analyze how people get work done",
    "groupCode": 0
  },
  {
    "id": 3021,
    "fa": "ما نیاز داریم این پروژه را تا پایان هفته انجام بدیم (به پایان برسانیم)",
    "en": "We need to get this project done by the end of the week",
    "groupCode": 0
  },
  {
    "id": 3022,
    "fa": "ما اجازه نداریم از مردمی که نمی شناسیم چک بگیریم",
    "en": "We are not allowed to take checks from people we don't know",
    "groupCode": 0
  },
  {
    "id": 3023,
    "fa": "من مقداری شک دارم در مورد کاری که برای شما انجام می دهند",
    "en": "I have some doubts about what they do for you",
    "groupCode": 0
  },
  {
    "id": 3024,
    "fa": "کدامیک صحیح است؟ مختصر توضیح دهید",
    "en": "Which one is correct? Explain briefly",
    "groupCode": 0
  },
  {
    "id": 3025,
    "fa": "دی وی دی مال کیا هستند؟",
    "en": "Whose DVDs are they?",
    "groupCode": 0
  },
  {
    "id": 3026,
    "fa": "من دیشب زود رسیدم خونه",
    "en": "\n 1.I arrived home early last night \n 2.I got home early last night",
    "desc": "You use \"at\" with \"home\" in certain contexts, particularly when emphasizing location or presence rather than movement",
    "groupCode": 0
  },
  {
    "id": 3027,
    "fa": "کی علی معمولاً خریدش را انجام می دهد؟",
    "en": "When does Ali usually do his shopping?",
    "groupCode": 0
  },
  {
    "id": 3028,
    "fa": "اون یک عکس قدیمی از پدرم است زمانیکه موهای بلند داشت",
    "en": "That's an old photo of my father when he had long hair",
    "groupCode": 0
  },
  {
    "id": 3029,
    "fa": "من قصد دارم برای تولدش (زن) به او یک کتاب بدهم",
    "en": "I'm gonna give her a book for her birthday",
    "groupCode": 0
  },
  {
    "id": 3030,
    "fa": "ویسکی از چه چیزی ساخته شده است؟",
    "en": "What is whiskey made of?",
    "groupCode": 0
  },
  {
    "id": 3031,
    "fa": "وقتی جلسه تمام شد، این یادداشت را به او (زن) بدهید",
    "en": "\n 1.When the meeting is over, give her this note \n 2.When the meeting finishes, give her this note",
    "groupCode": 0
  },
  {
    "id": 3032,
    "fa": "اون یکی است مثل این یکیه",
    "en": "That one is the same as this one",
    "groupCode": 0
  },
  {
    "id": 3033,
    "fa": "\n 1.& \n 2.' \n 3.* \n 4.{} \n 5._ \n 6.|",
    "en": "\n 1.Ampersand (And) \n 2.Apostrophe (Single Quotation Mark) \n 3.Asterisk (Star) \n 4.Braces \n 5.Underscore \n 6.Pipe",
    "groupCode": 0
  },
  {
    "id": 3034,
    "fa": "من یک احساسی دارم او (زن) من را خیلی دوست ندارد",
    "en": "\n 1.I gotta feeling she doesn't like me very much \n 2.I have a feeling she doesn't like me very much",
    "desc": "Gotta = Got a = Have a",
    "groupCode": 0
  },
  {
    "id": 3035,
    "fa": "من کم خونی دارم و به آهن بیشتری نیاز دارم",
    "en": "I have anemia (/əˈnēmēə/ انیمیا) and need more iron",
    "groupCode": 0
  },
  {
    "id": 3036,
    "fa": "یه یاد نمیارم پرسیده باشم",
    "en": "I don't recall asking",
    "groupCode": 0
  },
  {
    "id": 3037,
    "fa": "دیشب ماشین لباسشویی ما خراب شد",
    "en": "Last night our washing machine broke down",
    "groupCode": 0
  },
  {
    "id": 3038,
    "fa": "کلاه سوزان به اندازه مال تو گران است",
    "en": "Susan's hat is as expensive as yours",
    "groupCode": 0
  },
  {
    "id": 3039,
    "fa": "او (مرد) نه شراب می نوشد و نه آبجو",
    "en": "He doesn't drink neither wine nor beer",
    "groupCode": 0
  },
  {
    "id": 3040,
    "fa": "از آنجایی که در این لحظه باران نمی بارد، من برای قدم زدن بیرون خواهم رفت",
    "en": "As it isn't raining at the moment, I'll go out for a walk",
    "groupCode": 0
  },
  {
    "id": 3041,
    "fa": "من قول دادم او (زن) را ببرم دفعه بعد (که) آنها در شهر اجرا می کنند",
    "en": "I promised to take her the next time they perform in town",
    "groupCode": 0
  },
  {
    "id": 3042,
    "fa": "خواهرانش به او (مرد) گفتند او خیلی پیر شده است برای تماشای کارتون ها",
    "en": "Her sisters told him he was getting too old to watch cartoons",
    "groupCode": 0
  },
  {
    "id": 3043,
    "fa": "مادرم معمولاً چیز خوبی می پزد برای ناهار یکشنبه",
    "en": "My mother usually cooks something nice for Sunday lunch",
    "groupCode": 0
  },
  {
    "id": 3044,
    "fa": "من قهوه نمیخورم (نمی نوشم) و خواهرم نمی خوره (نمی نوشه)",
    "en": "I don't drink coffee and neither does my sister",
    "groupCode": 0
  },
  {
    "id": 3045,
    "fa": "من فکر می کنم او (مرد) را می شناسم. من شاید سال گذشته در یک پارتی با او ملاقات کرده باشم",
    "en": "I think I know him. I may have met him last year at a party",
    "groupCode": 0
  },
  {
    "id": 3046,
    "fa": "من بهت ایمیل خواهم زد وقتی رسیدم آنجا",
    "en": "I'll email you when I get there",
    "groupCode": 0
  },
  {
    "id": 3047,
    "fa": "من مایلم شما را به جایی که مادرتان را ملاقات کردم ببرم",
    "en": "I would like to take you to the place where I met your mother",
    "groupCode": 0
  },
  {
    "id": 3048,
    "fa": "اگر او (زن) را دیده بودم, من از او پرسیده بودم",
    "en": "If I had seen her, I would have asked her",
    "groupCode": 0
  },
  {
    "id": 3049,
    "fa": "علی خوشحال به نظر می رسد",
    "en": "Ali looks happy",
    "groupCode": 0
  },
  {
    "id": 3050,
    "fa": "او (زن) حتی به ما نگاه نکرد! اون چیزی است که من دوست نداشتم",
    "en": "She didn't even look at us! That's what I didn't like",
    "groupCode": 0
  },
  {
    "id": 3051,
    "fa": "اگه از من میخوای بیام, فقط بپرس",
    "en": "If you want me to come, just ask",
    "groupCode": 0
  },
  {
    "id": 3052,
    "fa": "من نمی دانستم آیا ادامه دهم یا توقف کنم",
    "en": "I didn't know whether to go on or stop",
    "groupCode": 0
  },
  {
    "id": 3053,
    "fa": "من نتونستم او (زن) را پیدا کنم. او می بایستی خرید رفته باشه",
    "en": "I couldn't find her. She must have gone shopping",
    "groupCode": 0
  },
  {
    "id": 3054,
    "fa": "او (زن) هرگز مرا قبلاً ندیده است. او (زن) داره منو با یکی دیگه اشتباه میگیره",
    "en": "She has never seen me before. She's confusing me with someone else",
    "groupCode": 0
  },
  {
    "id": 3055,
    "fa": "ارائه آنها یک موفقیت بود، اگرچه آنها آن را به خیلی خوب آماده نکرده بودند",
    "en": "Their presentation was a success, though they hadn't prepared it very well",
    "desc": "\"Although\": Used at the beginning of a sentence or clause to contrast.\n\nE.g., \"Although they hadn't prepared it well, the presentation was a success.\"\n\"Though\": Can be used at the end of a sentence for contrast, or at the beginning.\n\nE.g., \"Their presentation was a success, though they hadn't prepared it well.\"\n\n\n\n\n\n",
    "groupCode": 0
  },
  {
    "id": 3056,
    "fa": "من همیشه دستکش ظرفشویی می پوشم تا از دستانم در برابر آب داغ و مواد شوینده محافظت کنم",
    "en": "I always wear dishwashing gloves to protect my hands from hot water and detergent",
    "groupCode": 0
  },
  {
    "id": 3057,
    "fa": "من (مودبانه) از شما می خواهم یک بار دیگر آن را چک کنید",
    "en": "I would like you to check it once again",
    "groupCode": 0
  },
  {
    "id": 3058,
    "fa": "آنها در اوایل روز شروع کردند، بنابراین آنها مدیریت کردن به موقع تمام کنند",
    "en": "They started early in the day, so they managed to finish on time",
    "groupCode": 0
  },
  {
    "id": 3059,
    "fa": "فکر می کنی ما تا ساعت هفت تمام خواهیم کرد؟ من می ترسم که نه",
    "en": "Do you think we'll finish by seven o'clock? I'm afraid not",
    "groupCode": 0
  },
  {
    "id": 3060,
    "fa": "قطار چقدر طول می کشد تا به لندن برسد؟",
    "en": "\n 1.How long does the train take to reach London? \n 2.How long does the train take to get to London?",
    "groupCode": 0
  },
  {
    "id": 3061,
    "fa": "علی تنها در باغ با خودش نشسته بود (داشت)",
    "en": "Ali was sitting by himself in the garden",
    "groupCode": 0
  },
  {
    "id": 3062,
    "fa": "شام به زودی آماده خواهد شد، اما ما هنوز برای نوشیدن وقت داریم",
    "en": "\n 1.Dinner will be ready soon, but we still have time for a drink \n 2.Dinner will be ready presently, but we still have time for a drink",
    "desc": "Dinner will be ready soon:\nMeaning: Dinner will be ready in a short amount of time.\nTone: Informal and common in everyday speech.\nDinner will be ready presently:\nMeaning: Dinner will be ready very shortly.\nTone: Slightly more formal and can sound old-fashioned.\nKey Difference:\n\"Soon\" is more casual and flexible.\n\"Presently\" is more formal and suggests it will happen very soon.",
    "groupCode": 0
  },
  {
    "id": 3063,
    "fa": "بچه های زیادی از مدرسه ما در مسابقه شرکت کردند",
    "en": "A lot of kids from our school participated in the race",
    "groupCode": 0
  },
  {
    "id": 3064,
    "fa": "من مطمئنم او (زن) بدش نمی آید که به من لطفی کند",
    "en": "I'm sure she wouldn't mind doing me a favor",
    "desc": "\"To do\": The infinitive form \"to do\" is not used after \"wouldn't mind.\"",
    "groupCode": 0
  },
  {
    "id": 3065,
    "fa": "من از خواب بیدار شدم و دیگر نتوانستم بخوابم",
    "en": "I woke up and couldn't get back to sleep",
    "groupCode": 0
  },
  {
    "id": 3066,
    "fa": "او (زن) به من خیانت کرده است. من فکر کنم نامزدیمون رو قطع خواهم کرد",
    "en": "She has been cheating on me. I think I'll break off our engagement",
    "desc": "\"Break up\" is mostly used for romantic relationships.\n\"Break off\" can be used more broadly, including engagements, negotiations, or other formal agreements.",
    "groupCode": 0
  },
  {
    "id": 3067,
    "fa": "ما فکر می کنیم این عکس خیلی شبیه عکس دیگری است",
    "en": "We think this picture is very much like another",
    "groupCode": 0
  },
  {
    "id": 3068,
    "fa": "آنها مطمئناً انتظار نداشتند همه برای جلسه حاضر شوند",
    "en": "They certainly didn't expect everyone to turn up for the meeting",
    "groupCode": 0
  },
  {
    "id": 3069,
    "fa": "من نگاهی کوتاه به ساعتم انداختم تا زمان را چک کنم",
    "en": "I glanced at my watch to check the time",
    "desc": "Glance: A quick, deliberate look. For example, \"She glanced at her phone.\"",
    "groupCode": 0
  },
  {
    "id": 3070,
    "fa": "او (مرد) نگاهی تصادفی به سلبریتی انداخت که او (زن) با عجله از کنارش گذشت",
    "en": "He caught a glimpse of the celebrity as she quickly passed",
    "desc": "A brief, often accidental view. For example, \"He caught a glimpse of the deer in the forest.",
    "groupCode": 0
  },
  {
    "id": 3071,
    "fa": "یک نفر کلاهی مثل کلاه من در اتاق جا گذاشت",
    "en": "Somebody left a hat like mine in the room",
    "groupCode": 0
  },
  {
    "id": 3072,
    "fa": "از همون خیلی اول دروغ گفتی",
    "en": "From the very beginning you lied",
    "groupCode": 0
  },
  {
    "id": 3073,
    "fa": "اگر ایده ای به من میدهید، احتمالاً بدترین چیزی (که) میتوانید بگویید (این) است (که) 'تصور کنی اگر بخواهی'",
    "en": "If you're pitching me an idea, probably the worst thing you can say is 'Imagine if you will'",
    "groupCode": 0
  },
  {
    "id": 3074,
    "fa": "صداقت برای من مهم است",
    "en": "Honesty is important to me",
    "desc": "to me: Opinion",
    "groupCode": 0
  },
  {
    "id": 3075,
    "fa": "برای من مهم است که ادامه بدی ورزش منظم",
    "en": "It's important for me to keep up regular exercise",
    "desc": "For me: Benefit",
    "groupCode": 0
  },
  {
    "id": 3076,
    "fa": "در زیر سه سهم سمی است برای فروش در اسرع وقت قبل از شیرجه اجتناب ناپذیر آنها به پایینتر",
    "en": "Below are three toxic stocks to sell ASAP before they inevitably plunge lower",
    "groupCode": 0
  },
  {
    "id": 3077,
    "fa": "ما نیاز داریم نسخه را بالا (بامپ) ببریم",
    "en": "We need to bump the version",
    "groupCode": 0
  },
  {
    "id": 3078,
    "fa": "بزاق من می سازد پلاک بیشتر از (مال) یک شخص معمولی",
    "en": "My saliva /səˈlaɪvə/ makes more plaque /ˈplæk/ than a normal person's.",
    "groupCode": 0
  },
  {
    "id": 3079,
    "fa": "این احتمال وجود دارد که جلسه مجدداً زمانبندی خواهد شد",
    "en": "It's likely that the meeting will be rescheduled",
    "groupCode": 0
  },
  {
    "id": 3080,
    "fa": "شما نیاز خواهید داشت یک صلاحیت در مددکاری (کار) اجتماعی کسب کنید",
    "en": "You'll need to acquire a qualification in social work",
    "groupCode": 0
  },
  {
    "id": 3081,
    "fa": "لباس ها خشک شدند هنوز؟",
    "en": "Are the clothes dry yet?",
    "groupCode": 0
  },
  {
    "id": 3082,
    "fa": "یک شانس کمی (باریک) است برای گرفتن یک جای پارک در مرکز شهر",
    "en": "It's a slim chance of getting a parking spot downtown",
    "groupCode": 0
  },
  {
    "id": 3083,
    "fa": "انواع کفش ها برای مناسبت های مختلف: کفش های کتانی بند دار برای دویدن، چکمه های کش دار برای روزهای بارانی، کفش های راحتی برای بیرون رفتن های معمولی، و چکمه های زیپ دار برای یک ظاهر شیک",
    "en": "Types of shoes for various occasions: lace-up sneakers for running, pull-on boots for rainy days, slip-on loafers for casual outings, and zip-up boots for a stylish touch",
    "groupCode": 0
  },
  {
    "id": 3084,
    "fa": "شما می توانید تا دیروقت بیرون بمانید به شرطی که (تا زمانی که) تو به من اطلاع بدی کجا هستی",
    "en": "You can stay out late so long as you let me know where you are",
    "groupCode": 0
  },
  {
    "id": 3085,
    "fa": "چه می بره (چه چیزی لازم است) اگر می تونستی آن را در یک کلمه خلاصه کنی؟",
    "en": "What does it take if you could summarize it in one word?",
    "groupCode": 0
  },
  {
    "id": 3086,
    "fa": "دو ثروتمندترین مرد روی زمین نتونستند همسرشان را خوشحال نگه دارند، چه امیدی دارید؟",
    "en": "The two richest men on Earth couldn't keep their wives happy, what hope do you have?",
    "groupCode": 0
  },
  {
    "id": 3087,
    "fa": "قرار بده یک گلدان از گل های تازه را روی میز برای یک ظاهر شیک",
    "en": "Place a vase of fresh flowers on the table for a stylish touch",
    "groupCode": 0
  },
  {
    "id": 3088,
    "fa": "اضافه کن یک روسری به لباس (ست کامل) خودت برای یک ظاهر شیک",
    "en": "Add a scarf to your outfit for a stylish touch",
    "groupCode": 0
  },
  {
    "id": 3089,
    "fa": "بپیچ هدیه را با یک روبان برای یک ظاهر شیک",
    "en": "Wrap the present with a ribbon for a stylish touch",
    "groupCode": 0
  },
  {
    "id": 3090,
    "fa": "داری شلوار می پوشی؟",
    "en": "Are you wearing pants?",
    "groupCode": 0
  },
  {
    "id": 3091,
    "fa": "اگر به من بود، دیگر پول خرج (فرضی) نمی کردم",
    "en": "If it were up to me, I wouldn't spend any more money",
    "groupCode": 0
  },
  {
    "id": 3092,
    "fa": "به عقب نگاه نکن هیچ چیز برای تو نیست",
    "en": "Don't look back there is nothing for you",
    "groupCode": 0
  },
  {
    "id": 3093,
    "fa": "بخشی از من که تو هستی هرگز نخواهد مرد",
    "en": "The part of me that is you will never die",
    "groupCode": 0
  },
  {
    "id": 3094,
    "fa": "آنها می تونستند (توانسته بودن) با کار بیشتر پروژه را به موقع تمام کنند",
    "en": "They could have finished the project on time with more work",
    "groupCode": 0
  },
  {
    "id": 3095,
    "fa": "کاش تمام پنجره ها را چک کرده بودم قبل از ترک کردن",
    "en": "I wish I had checked all the windows before leaving",
    "groupCode": 0
  },
  {
    "id": 3096,
    "fa": "ترش کردم",
    "en": "I have heartburn",
    "groupCode": 0
  },
  {
    "id": 3097,
    "fa": "دلیلی برای متاسف بودن وجود ندارد",
    "en": "There's no reason to be sorry",
    "groupCode": 0
  },
  {
    "id": 3098,
    "fa": "دلیلی برای ترس وجود ندارد",
    "en": "There's no reason to be afraid",
    "groupCode": 0
  },
  {
    "id": 3099,
    "fa": "ترجیح می دم خوش شانس باشم تا باهوش",
    "en": "I'd rather be lucky than smart",
    "groupCode": 0
  },
  {
    "id": 3100,
    "fa": "ترجیح می دم بمیرم تا نامیدت کنم",
    "en": "I'd rather die than disappoint you",
    "groupCode": 0
  },
  {
    "id": 3101,
    "fa": "ترجیح می دم در موردش صحبت نکنم",
    "en": "I'd rather not talk about it",
    "groupCode": 0
  },
  {
    "id": 3102,
    "fa": "پشیمانم از خوردن (داشتن) این غذا",
    "en": "I regret having this food",
    "groupCode": 0
  },
  {
    "id": 3103,
    "fa": "بازگشت دلالت دارد به یک مکانی بعد از (مدتی) دور بودن",
    "en": "Get back implies returning to a place after having been away",
    "groupCode": 0
  },
  {
    "id": 3104,
    "fa": "این خیلی بعید است، اما من فکر می کنم ما ممکنه برنده شیم",
    "en": "It's a long shot, but I think we might win",
    "groupCode": 0
  },
  {
    "id": 3105,
    "fa": "من نمی توانم راحت برم بخواب به خاطر بی خوابیم",
    "en": "I can't get to sleep well because of my insomnia",
    "groupCode": 0
  },
  {
    "id": 3106,
    "fa": "او (مرد) پس از ایستادن برای مدت طولانی احساس ضعف کرد",
    "en": "He felt faint after standing for too long",
    "groupCode": 0
  },
  {
    "id": 3107,
    "fa": "من احساس سوزن و سوزن (سنجاق) در دستم حس می کنم",
    "en": "I feel pins and needles in my hand",
    "groupCode": 0
  },
  {
    "id": 3108,
    "fa": "من احساس بی حالی می کنم",
    "en": "I feel lethargic /ləˈTHärjik/",
    "groupCode": 0
  },
  {
    "id": 3109,
    "fa": "او (زن) با یک پزشک ازدواج کرده است.",
    "en": "She is married to a doctor",
    "groupCode": 0
  },
  {
    "id": 3110,
    "fa": "میشه این عکس رو برای من قاب کنی؟",
    "en": "Can you frame this photo for me?",
    "groupCode": 0
  },
  {
    "id": 3111,
    "fa": "مواظب (محتاط باش) پیشنهادات سرمایه گذاری آنلاین باش تا اجتناب کنید از قربانی شدن یک کلاهبرداری (قصابی خوک)",
    "en": "Be cautious of online investment offers to avoid falling victim to a pig butchering scam",
    "groupCode": 0
  },
  {
    "id": 3112,
    "fa": "من عاشق خوردن خیار شور هستم با ساندویچم",
    "en": "I love eating pickle with my sandwich",
    "desc": "\"pickle\" often refers specifically to pickled cucumber. When talking about pickled versions of other vegetables or fruits, it's more precise to use their specific names, like \"pickled carrot\" or \"pickled pepper,\" to avoid confusio",
    "groupCode": 0
  },
  {
    "id": 3113,
    "fa": "آنها باید کاری بکنند فقط برای آرام کردن جمعیت خود",
    "en": "They have to do something just to appease their own population",
    "groupCode": 0
  },
  {
    "id": 3114,
    "fa": "اگر یک بازار آزاد را از بین ببرید، شما یک بازار سیاه ایجاد می کنید",
    "en": "If you destroy a free market you create a black market",
    "groupCode": 0
  },
  {
    "id": 3115,
    "fa": "دور (پیاده) نشو وقتی دارم باهات حرف میزنم",
    "en": "Don't walk away when I'm talking to you",
    "groupCode": 0
  },
  {
    "id": 3116,
    "fa": "شرکت های سهامی خاص شرکت ها را خریداری و بهبود می بخشند برای افزایش بها",
    "en": "Private equity firms buy and improve companies to increase their value",
    "desc": "Private equity refers to investment in private companies (not publicly traded on stock exchanges) through the purchase of shares or stakes. Investors provide capital with the expectation of high returns, often by improving the company's performance and eventually selling it at a profit",
    "groupCode": 0
  },
  {
    "id": 3117,
    "fa": "شرکت ما داره تمرکز می کنه روی M&A برای رشد حضور مارکتش",
    "en": "Our company is focusing on M&A (Mergers and acquisitions) to grow its market presence",
    "desc": "Mergers and acquisitions (M&A) refer to the processes of combining companies (mergers) or purchasing one company by another (acquisitions).\n\nMergers occur when two companies join to form a new entity.\nAcquisitions happen when one company buys another, which then becomes part of the buying company.\nM&A activities are often used to expand market reach, enhance capabilities, or increase efficiencies",
    "groupCode": 0
  },
  {
    "id": 3118,
    "fa": "شرکت ما داره کاوش می کنه هم فرصتهای VC برای استارت آپ ها و معاملات PE برای به دست آوردن شرکت های تاسیس شده",
    "en": "Our firm is exploring both VC (Venture Capital) opportunities for startups and PE (Private Equity) deals to acquire established companies",
    "desc": "VC stands for venture capital. It refers to funding provided to early-stage, high-growth potential startups or small businesses in exchange for equity. Venture capital is typically used to help these companies grow and scale before they become profitable or go public.",
    "groupCode": 0
  },
  {
    "id": 3119,
    "fa": "اندازه بلیط برای این دور از سرمایه گذاری خطرپذیر متغیر است از 500000 دلار تا 2 میلیون دلار",
    "en": "The ticket size for this round of venture capital funding ranges from $500,000 to $2 million",
    "desc": "Ticket size refers to the amount of money invested in a single deal or transaction. In finance and investment, it indicates the scale of individual investments, such as the size of a venture capital investment or a private equity buyout",
    "groupCode": 0
  },
  {
    "id": 3120,
    "fa": "مصاحبه زمانبندی شده شما فعلا لغو خواهد شد",
    "en": "Your scheduled interview will be cancelled for the time being",
    "groupCode": 0
  },
  {
    "id": 3121,
    "fa": "من در واقع (حقوقی دریافت نمی کنم) پرداخت نمیشه",
    "en": "\n 1.I don't actually get paid \n 2.I don't actually receive pay",
    "groupCode": 0
  },
  {
    "id": 3122,
    "fa": "اینها برای چه استفاده می شدند؟",
    "en": "What were these used for?",
    "groupCode": 0
  },
  {
    "id": 3123,
    "fa": "چگونه کیسه جاروبرقی را عوض کنیم و فیلترها را تمیز کنیم؟",
    "en": "How to change the vacuum bag and clean the filters?",
    "groupCode": 0
  },
  {
    "id": 3124,
    "fa": "من خوش عکس نیستم",
    "en": "I'm not photogenic",
    "groupCode": 0
  },
  {
    "id": 3125,
    "fa": "این عکس شما را (شیک) نشان نمی ده",
    "en": "This picture doesn't flatter you",
    "groupCode": 0
  },
  {
    "id": 3126,
    "fa": "شرکت مشاوره کسب شد (خریداری شد) توسط یک شرکت فناوری بزرگتر",
    "en": "The consulting firm was acquired by a larger technology company",
    "desc": "Use \"company\" when referring to any type of business, especially larger or more diverse businesses, like technology companies, manufacturing companies, or retail companies.\n\nUse \"firm\" when referring to businesses that provide professional services, such as law firms, accounting firms, or consulting firms, typically smaller or partnership-based businesses.",
    "groupCode": 0
  },
  {
    "id": 3127,
    "fa": "تو حق نداشتی به من بگویی که نسبت به من حس داشتی",
    "en": "You had no right to tell me you had feelings for me",
    "groupCode": 0
  },
  {
    "id": 3128,
    "fa": "من (حالم) عالی بودم قبل از اینکه من پی بردم در مورد شما",
    "en": "I was doing great before I found out about you",
    "groupCode": 0
  },
  {
    "id": 3129,
    "fa": "چطور هیچوقت به من چیزی نگفتی؟",
    "en": "\n 1.How come you never told me anything? \n 2.How come you never said anything to me?",
    "groupCode": 0
  },
  {
    "id": 3130,
    "fa": "کم سخت بگیر بهش (مرد). او جونیور است",
    "en": "Cut him some slack. He is a junior",
    "groupCode": 0
  },
  {
    "id": 3131,
    "fa": "من امید می داشتم که (فرضی) پیش بیاد",
    "en": "I was hoping that would come up",
    "groupCode": 0
  },
  {
    "id": 3132,
    "fa": "بیا در اینجا بعضی نظرات را بگیریم. این چیزها به یک دلیلی اتفاق می افتند",
    "en": "Let's get some perspective here. These things happen for a reason",
    "groupCode": 0
  },
  {
    "id": 3133,
    "fa": "او (مرد) همیشه ایده های عالی را (می یاید) مطرح می کند",
    "en": "He always comes up with great ideas",
    "groupCode": 0
  },
  {
    "id": 3134,
    "fa": "کسی هنوز از علی شنیده؟",
    "en": "Has anyone heard from Ali yet?",
    "groupCode": 0
  },
  {
    "id": 3135,
    "fa": "من می دانم دقیقاً که او (زن) داره برش چی می گذره (حالش چطوره)",
    "en": "I know exactly what she's going through",
    "groupCode": 0
  },
  {
    "id": 3136,
    "fa": "تو خیلی نگران هستی در مورد اومدن مامانت",
    "en": "You're so uptight about your mom coming",
    "groupCode": 0
  },
  {
    "id": 3137,
    "fa": "در مورد امتحانات نگران نباش، آنها به زودی تمام خواهد شد",
    "en": "Don't get uptight about the exams, they will be over soon",
    "groupCode": 0
  },
  {
    "id": 3138,
    "fa": "من فقط نمی خواهم مامانم فکر کند که چون من با فهیم ازدواج نکردم، زندگی من چرند است",
    "en": "I just don't want my mom to think that because I didn't marry Fahim, my life is crap",
    "groupCode": 0
  },
  {
    "id": 3139,
    "fa": "اون یک باری از مزخرف بود",
    "en": "That was a load of crap",
    "groupCode": 0
  },
  {
    "id": 3140,
    "fa": "او (مرد) داره خفه میشه",
    "en": "He's choking",
    "groupCode": 0
  },
  {
    "id": 3141,
    "fa": "کسی اینجا دکتره؟",
    "en": "Is anyone here a doctor?",
    "groupCode": 0
  },
  {
    "id": 3142,
    "fa": "او (مرد) به دلیل استرس (صداش درنمی آید) خفه شد",
    "en": "He choked up due to the stress",
    "groupCode": 0
  },
  {
    "id": 3143,
    "fa": "اون مسخره ترین چیزی است که من تا به حال (تاکید) شنیده ام",
    "en": "That's the most ridiculous thing I've ever heard",
    "groupCode": 0
  },
  {
    "id": 3144,
    "fa": "تو مرا فروختی",
    "en": "You sold me out",
    "groupCode": 0
  },
  {
    "id": 3145,
    "fa": "تو الان به من ضربه زدی؟",
    "en": "Did you just flick me?",
    "groupCode": 0
  },
  {
    "id": 3146,
    "fa": "هر بار که سرت را می چرخانی، موهایت به صورتم ضربه می زنه",
    "en": "Every time you turn your head, your hair flick my face",
    "groupCode": 0
  },
  {
    "id": 3147,
    "fa": "او (زن) گرد غبار را از روی کتش تکان داد",
    "en": "She flicked the dust off her coat",
    "groupCode": 0
  },
  {
    "id": 3148,
    "fa": "تو نمیذاری (مودبانه) تموم کنم",
    "en": "You wouldn't let me finish",
    "groupCode": 0
  },
  {
    "id": 3149,
    "fa": "یک فاجعه در حمل و نقل بود و من باید این را سفارش بدم",
    "en": "There was a disaster in shipping and I've gotta get this order in",
    "groupCode": 0
  },
  {
    "id": 3150,
    "fa": "من باید این را به انجام برسانم",
    "en": "I have got to get this done",
    "desc": "The phrase \"I have got to get\" is an informal way of saying \"I need to get\" or \"I must get.\" It's used to express a strong need or obligation to obtain or do something",
    "groupCode": 0
  },
  {
    "id": 3151,
    "fa": "من (الان چیزهای) زیادی برای سروکله زدن دارم",
    "en": "I just have too much to deal with",
    "groupCode": 0
  },
  {
    "id": 3152,
    "fa": "من ترکیب (رمزی) این را حدود یک سال پیش فراموش کردم",
    "en": "I forgot the combination to this about a year ago",
    "groupCode": 0
  },
  {
    "id": 3153,
    "fa": "آیا چوب استیک دیگری (چوب ژاپنی) دارید؟",
    "en": "\n 1.You got any Chopsticks? \n 2.Do you have any Chopsticks?",
    "desc": "The phrase \"You got any ChapStick?\" is an informal way of saying \"Have you got any ChapStick?\"",
    "groupCode": 0
  },
  {
    "id": 3154,
    "fa": "اون یک بلوز خیره کننده است",
    "en": "That is a stunning blouse",
    "groupCode": 0
  },
  {
    "id": 3155,
    "fa": "من مقداری از ادکلن شما را قرض گرفتم و امیدوارم او (زن) دوستش داشته باشد",
    "en": "I borrowed some of your cologne /kuh·lown/ and I hope she likes it",
    "groupCode": 0
  },
  {
    "id": 3156,
    "fa": "او (مرد) آنقدر در درد بود که آنها مجبور شدند او را به بیمارستان ببرند",
    "en": "He was in such pain that they had to take him to the hospital",
    "groupCode": 0
  },
  {
    "id": 3157,
    "fa": "او (زن) مرا به یاد کسی می اندازد که سال ها پیش ملاقات کردم",
    "en": "She reminds me of somebody I met years ago",
    "groupCode": 0
  },
  {
    "id": 3158,
    "fa": "من تصمیم گرفتم انجامش بدم فقط برای خاطر خودم",
    "en": "I've decided to do it just for my sake",
    "groupCode": 0
  },
  {
    "id": 3159,
    "fa": "درست (فقط) زمانی که فکر می کنید تمام شده؛ یک مشکل جدید پیش می آید",
    "en": "Just when you think it’s over; a new problem comes up",
    "groupCode": 0
  },
  {
    "id": 3160,
    "fa": "هرج و مرج کامل به وجود آمد، وقتی زلزله شروع شد",
    "en": "Total chaos broke out when the earthquake started",
    "groupCode": 0
  },
  {
    "id": 3161,
    "fa": "آیا تو می توانی به من اطمینان دهی به کار بیشتر دیگه ای نیاز نخواهد بود؟",
    "en": "Can you assure me it won't need any more work?",
    "groupCode": 0
  },
  {
    "id": 3162,
    "fa": "من (مرد) نگاهی تصادفی به حیوان انداختم قبل از اینکه ناپدید بشه",
    "en": "I caught a glimpse of the animal before it disappeared",
    "groupCode": 0
  },
  {
    "id": 3163,
    "fa": "او (مرد) همیشه داره از دولت انتقاد می کند، اما هرگز رای نمی دهد",
    "en": "He's always running down the government, but never votes",
    "groupCode": 0
  },
  {
    "id": 3164,
    "fa": "مردم نیاز دارند به یک زندگی خانوادگی پایدار برای اجتناب از استرس",
    "en": "People need a stable family life to avoid stress",
    "groupCode": 0
  },
  {
    "id": 3165,
    "fa": "آن در جیرجیر می کند وقتی که باز می شود. میتونی روغنش بزنی؟",
    "en": "That door creaks when opened. Can you oil it?",
    "desc": "\"opened\" is used correctly as a past participle that functions similarly to an adjective. You don’t need to include \"it is\" in the sentence.\n\nHere's why:\n\n\"When opened\" means \"when the door is opened.\"",
    "groupCode": 0
  },
  {
    "id": 3166,
    "fa": "دستگاهی (ماشینی) که تو می توانی ببینی از قطعات ریز زیادی تشکیل شده است",
    "en": "The machine that you can see consists of many tiny parts",
    "groupCode": 0
  },
  {
    "id": 3167,
    "fa": "من می دانم که چه چیزی را (روی) میز می آورم و عاشق احساس توانایی داشتن کمک کردن به یک تنوعی از مشتریان هستم",
    "en": "I know what I bring to the table and love the feeling of being able to help a variety of clients",
    "groupCode": 0
  },
  {
    "id": 3168,
    "fa": "من هفته‌ها صرف کردم (برای) انجام تحقیق پرزحمت تا مطمئن شوم همه جزئیات کامل باشند",
    "en": "I spent weeks doing painstaking research to ensure every details was perfect",
    "groupCode": 0
  },
  {
    "id": 3169,
    "fa": "من باید یک عالمه بشاشم",
    "en": "I gotta take a massive piss",
    "groupCode": 0
  },
  {
    "id": 3170,
    "fa": "من نقشه ترک کردن نمی کشیدم، اما من در نهایت جابجا شدم چون من یک شغل جدید گرفتم",
    "en": "I wasn't planning to leave, but I ended up moving because I got a new job",
    "groupCode": 0
  },
  {
    "id": 3171,
    "fa": "می توانم عطرت را تا مایل ها استشمام کنم",
    "en": "I can smell your scent for miles",
    "groupCode": 0
  },
  {
    "id": 3172,
    "fa": "تو یک شکست خورده نیستی. تو فقط در خاک اشتباهی برای شکوفا شدن هستی",
    "en": "You're not a failure. You're just in the wrong soil to bloom",
    "groupCode": 0
  },
  {
    "id": 3173,
    "fa": "من اینطور بیانش می کنم: سخت کوشی در نهایت نتیجه می دهد",
    "en": "I put it this way: hard work pays off in the end",
    "groupCode": 0
  },
  {
    "id": 3174,
    "fa": "مواظب باش با کی سر و کله میزنی",
    "en": "Be careful who you mess with",
    "groupCode": 0
  },
  {
    "id": 3175,
    "fa": "من فقط به خالقم تعظیم می کنم",
    "en": "I bow only to my creator",
    "groupCode": 0
  },
  {
    "id": 3176,
    "fa": "من دیگه از شکست خوردن نمی ترسم",
    "en": "\n 1.I'm no longer afraid of failing \n 2.I'm not afraid of failing anymore",
    "groupCode": 0
  },
  {
    "id": 3177,
    "fa": "من فقط می خواهم عذرخواهی کنم از مردمی که من نامیدم پیر در 30 (سالگی) وقتیکه من 18 (سالم) بودم",
    "en": "I just want to apologize to the people I called old at 30 when I was 18",
    "groupCode": 0
  },
  {
    "id": 3178,
    "fa": "اگر من در این دام گرفتار نمی شدم، تو را می کشتم",
    "en": "If I wasn't caught in this snare, I'd kill you",
    "groupCode": 0
  },
  {
    "id": 3179,
    "fa": "اگر تو در آن دام بمانی، خواهی مرد",
    "en": "If you stay in that snare, You'll die",
    "groupCode": 0
  },
  {
    "id": 3180,
    "fa": "خیلی خوب انجام دادی",
    "en": "You did so well",
    "groupCode": 0
  },
  {
    "id": 3181,
    "fa": "اگر شما می خواهید گریه کنید، ببرید مقداری پیاز را تا هیچ کسی (فرضی) متوجه نشود که شما دارید گریه می کنید",
    "en": "If you wanna cry, cut some onions so nobody would notice that you're crying",
    "groupCode": 0
  },
  {
    "id": 3182,
    "fa": "من قصد ندارم بدنام کنم آنها را",
    "en": "I don't mean to denigrate them",
    "groupCode": 0
  },
  {
    "id": 3183,
    "fa": "اونها رو بدنام نکن ارزشش را ندارد",
    "en": "Don't denigrate them it's not worth it",
    "groupCode": 0
  },
  {
    "id": 3184,
    "fa": "آیا من می توانم پرداخت کنم اجاره آپارتمانم را برای کل سال جلوتر؟",
    "en": "Can I pay my apartment lease for the entire year upfront?",
    "groupCode": 0
  },
  {
    "id": 3185,
    "fa": "در این لحظه بود (که) علی دانست او دیگه نمی‌خواست تاکو بخورد",
    "en": "It was at this moment Ali knew he didn't want to eat taco anymore",
    "groupCode": 0
  },
  {
    "id": 3186,
    "fa": "من اعتقاد داشتم به خودم زمانی که هیچ کس دیگری نداشت",
    "en": "I believed in me when no one else did",
    "groupCode": 0
  },
  {
    "id": 3187,
    "fa": "سیاستمداران در حال حاضر به شنیدن شکایات افراد مشهور نازپرورده عادت دارند",
    "en": "Politicians are by now used to hearing the complaints of pampered celebrities",
    "groupCode": 0
  },
  {
    "id": 3188,
    "fa": "تو به اندازه کافی بزرگ هستی که پدر من باشی",
    "en": "You're old enough to be my father",
    "groupCode": 0
  },
  {
    "id": 3189,
    "fa": "من نمی تونم شما را ببینم، لطفاً شما می تونی دوربین خود را روشن کنید؟",
    "en": "I can't see you, can you please turn your camera on?",
    "groupCode": 0
  },
  {
    "id": 3190,
    "fa": "تو داری یخ میزنی",
    "en": "You're freezing",
    "groupCode": 0
  },
  {
    "id": 3191,
    "fa": "منزجر کننده ترین چیزی که تو دیدی کسی بدون شرم انجام دهد چیست؟",
    "en": "What is the most disgusting thing you've seen someone do with no shame?",
    "desc": "In your sentence, \"What is the most disgusting thing you've seen someone do with no shame?\", the structure involves:\n\n\"You've seen\": This part uses the present perfect tense and refers to a past action (seeing something happen).\n\n\"Someone do\": After verbs like \"seen,\" \"heard,\" or \"watched,\" we use the base form of the verb (do) rather than its past tense (did).\n\nBreakdown:\n\"Seen\" (past participle) is already in the past tense.\nAfter \"seen,\" you use the base form of the verb \"do,\" not \"did,\" because \"seen\" is followed by the base form of the verb.\nExample Comparisons:\nCorrect: \"I've seen someone do something\" (Base form \"do\" after \"seen\").\nIncorrect: \"I've seen someone did something\" (Using \"did\" here is incorrect because it’s the past tense form, which doesn’t fit the structure after \"seen\").",
    "groupCode": 0
  },
  {
    "id": 3192,
    "fa": "نیاز نیست اینقدر به روم بیاری",
    "en": "No need to rub it in",
    "groupCode": 0
  },
  {
    "id": 3193,
    "fa": "من همیشه انجام می دهم تحقیقات بازار قبل از عرضه یک محصول جدید",
    "en": "I always conduct market research before launching a new product",
    "groupCode": 0
  },
  {
    "id": 3194,
    "fa": "جدی هستی؟ (در حال حاضر)",
    "en": "Are you being serious?",
    "groupCode": 0
  },
  {
    "id": 3195,
    "fa": "لاستیک هام (ماشین) کاملا پاره شده و من نیاز دارم پنچری رو درست کنم",
    "en": "My tires are completely torn apart, and I need to fix the puncture",
    "groupCode": 0
  },
  {
    "id": 3196,
    "fa": "من فکر کردم اون پمپ بنزین کمتر شلوغ است",
    "en": "I thought that gas station was less crowded",
    "groupCode": 0
  },
  {
    "id": 3197,
    "fa": "پارک در اوایل صبح بسیار ساکت تر است",
    "en": "The park is much quieter in the early morning",
    "groupCode": 0
  },
  {
    "id": 3198,
    "fa": "او (مرد) در اطراف مردم جدید کمی ترسو است",
    "en": "He's a bit timid around new people",
    "groupCode": 0
  },
  {
    "id": 3199,
    "fa": "اونا دارن پول چاپ (ضرب) می کنند",
    "en": "They are minting money",
    "groupCode": 0
  },
  {
    "id": 3200,
    "fa": "شما خیلی مناسب (گزینه عالی) خواهید بود (فرضی) برای سمت مهندس نرم افزار",
    "en": "You'd be a great fit for Software Engineer position",
    "groupCode": 0
  },
  {
    "id": 3201,
    "fa": "ما می خواهیم مطمئن شویم که همه سالم به خانه می رسند",
    "en": "We want to make sure everyone gets home safely",
    "groupCode": 0
  },
  {
    "id": 3202,
    "fa": "ما مایلیم به شما یادآوری کنیم که تعطیلات سالانه خود را تا 31 دسامبر نقشه بریزید",
    "en": "We would like to remind you to plan your annual /ˈænjuːəl/ (اَنیواِل) vacation by December 31",
    "groupCode": 0
  },
  {
    "id": 3203,
    "fa": "من پاسپورت همسر و پسرم را به روز کرده ام و مایلم تقاضا بدم برای نو کردن مجوزهای اقامت آنها برای منعکس کردن جزئیات جدید پاسپورت و تاریخ های انقضا",
    "en": "I have updated my wife and son's passports, and I would like to request the renewal of their residence permits to reflect the new passport details and expiration dates",
    "groupCode": 0
  },
  {
    "id": 3204,
    "fa": "تنها قسمتی از توضیحات که باقی می ماند قسمت آخر است",
    "en": "The only part of the description that remains is the last one",
    "desc": "A restrictive clause gives essential information needed to understand the sentence. It tells you which specific person or thing you're talking about.\n\nUse \"that\" for restrictive clauses. Example: \"The car that is red is mine.\" (The clause \"that is red\" tells you which car.)\nA non-restrictive clause adds extra information that isn’t essential to understand the sentence.\n\nUse \"which\" for non-restrictive clauses. Example: \"The car, which is red, is mine.\" (The color is just extra info here.)\nIn your sentence, \"that remains\" is essential, so we use \"that\" instead of \"which.\"",
    "groupCode": 0
  },
  {
    "id": 3205,
    "fa": "من بیخیالش نیستم",
    "en": "I am not over it",
    "groupCode": 0
  },
  {
    "id": 3206,
    "fa": "این بزرگش رو داری؟",
    "en": "Do you have this in large?",
    "groupCode": 0
  },
  {
    "id": 3207,
    "fa": "اندازه منه",
    "en": "It fits me",
    "groupCode": 0
  },
  {
    "id": 3208,
    "fa": "بهت میاد",
    "en": "It suits you",
    "groupCode": 0
  },
  {
    "id": 3209,
    "fa": "سر به سرم نذار",
    "en": "Don't tease me",
    "groupCode": 0
  },
  {
    "id": 3210,
    "fa": "اینجا کمبود مسکن مقرون به صرفه وجود دارد و من نمی خواهم وام مسکن بزرگی بر دارم",
    "en": "There is a shortage of affordable housing here and I don't want to take a big mortgage",
    "groupCode": 0
  },
  {
    "id": 3211,
    "fa": "اگر ما استثنا را چاپ کرده بودیم، ما در لاگ داشته بودیمش",
    "en": "If we had printed the exception, we would have had it in the log",
    "groupCode": 0
  },
  {
    "id": 3212,
    "fa": "می توانی نخود را به من (پاس) بدی؟",
    "en": "Can you pass me the chickpeas?",
    "groupCode": 0
  },
  {
    "id": 3213,
    "fa": "تابلو می گوید: جای خالی نیست",
    "en": "The sign says: No Vacancy",
    "groupCode": 0
  },
  {
    "id": 3214,
    "fa": "رفیق, بیشتر اوقات, من اینجوریم",
    "en": "Dude, most of the time, I am like this",
    "groupCode": 0
  },
  {
    "id": 3215,
    "fa": "من احساس بی طرفی می کنم کاملا در مورد شیرینی های",
    "en": "I feel quite neutral about sweets",
    "groupCode": 0
  },
  {
    "id": 3216,
    "fa": "رابطه جنسی معمولی چقدر طول می کشد؟",
    "en": "How long normal sex lasts?",
    "groupCode": 0
  },
  {
    "id": 3217,
    "fa": "\n 1.@ \n 2.- \n 3.$ \n 4.! \n 5.¡ \n 6.# \n 7.,",
    "en": "\n 1.At Sign \n 2.Dash (Hyphen) \n 3.Dollar Sign $ \n 4.Exclamation \n 5.Inverted Exclamation \n 6.Number Sign (Hash) \n 7.Comma",
    "groupCode": 0
  },
  {
    "id": 3218,
    "fa": "\n 1.\" \n 2./ \n 3.\\ \n 4.[] \n 5.() ",
    "en": "\n 1.Double Quotation Marks \n 2.Slash (Forward Slash) \n 3.Backward Slash \n 4.Brackets \n 5.Parentheses",
    "groupCode": 0
  },
  {
    "id": 3219,
    "fa": "برام یک ساندویچ درست کن، اما گوجه فرنگی نذار (را نگه دار)",
    "en": "Make me a sandwich, but hold the tomato",
    "desc": "This means you are asking someone to make a sandwich for you, but you don't want tomato in it. \"Hold the tomato\" is an idiomatic way of saying \"leave out the tomato.",
    "groupCode": 0
  },
  {
    "id": 3220,
    "fa": "من خیلی از صحبت های معلم را درک نکردم",
    "en": "I didn't take in much of the teacher said",
    "groupCode": 0
  },
  {
    "id": 3221,
    "fa": "چیز زیادی باقی نمانده است",
    "en": "There is not too much left",
    "groupCode": 0
  },
  {
    "id": 3222,
    "fa": "خوب خواهد بود اگر ما بتوانیم از علی اطلاعات (خلاصه کلام) بگیریم",
    "en": "It will be good if we can get a heads-up from Ali",
    "desc": "Heads-up: a short talk or statement about how a situation or plan is developing",
    "groupCode": 0
  },
  {
    "id": 3223,
    "fa": "رئیس یک جلسه تشکیل داد تا به ما یک اطلاعات سریع (خلاصه کلام) بدهد در مورد اینکه (روی) چگونه پروژه داره می ره",
    "en": "The boss called a meeting to give us a quick heads-up on how the project's going",
    "desc": "Heads-up: a short talk or statement about how a situation or plan is developing",
    "groupCode": 0
  },
  {
    "id": 3224,
    "fa": "من فکر می کنم شما باید کاملا از این فرصت استفاده کنی!",
    "en": "I think you should totally take advantage of this opportunity!",
    "groupCode": 0
  },
  {
    "id": 3225,
    "fa": "بالاخره بهار اینجا است, و زمان آن است بار دیگر تعویض کنید تایرهای زمستانی خود را با تابستانی هاش طراحی شدند برای چسبناکی بهتر در موقعیت های گرمتر",
    "en": "Spring is finally here, and it's time once again to swap your winter tires for summer ones designed for better grip in warmer conditions",
    "groupCode": 0
  },
  {
    "id": 3226,
    "fa": "وقتی شروع به بهتر کردن خود می کنید، تنهایی عوارضی (قیمتی) است که می پردازید",
    "en": "When you start improving yourself, loneliness is the toll you pay",
    "groupCode": 0
  },
  {
    "id": 3227,
    "fa": "اگر همسرت (زن) آنقدر زیباست, چرا شما اینجا با من هستی؟",
    "en": "If your wife's that beautiful, why are you here with me?",
    "groupCode": 0
  },
  {
    "id": 3228,
    "fa": "من بیش از حد به او (زن) احترام می گذارم که کاری که قصد دارم با او انجام بدهم را با تو انجام دهم",
    "en": "I respect her too much to do to her what I'm going to do to you",
    "groupCode": 0
  },
  {
    "id": 3229,
    "fa": "آیا تا به حال (تاکید) شاهد بوده ای یک زندگی ویران شده با یک اشتباه کوچک؟",
    "en": "Have you ever witnessed a life ruined by a small mistake?",
    "desc": "Let's break it down:\n\nFull version: \"Have you ever witnessed a life that was ruined from a small mistake?\"\nThis is a full passive sentence with \"was.\"\nReduced version: \"Have you ever witnessed a life ruined from a small mistake?\"\nHere, \"that was\" is omitted (which is common in English), and \"ruined\" works as part of a reduced clause.\nSo, even though it's passive, you don’t need \"was\" because it's implied and reduced.",
    "groupCode": 0
  },
  {
    "id": 3230,
    "fa": "او (مرد) هرگز از شر لکه روی زندگیش خلاص نخواهد شد",
    "en": "He will never get rid of the stain on his life",
    "groupCode": 0
  },
  {
    "id": 3231,
    "fa": "آیا من شنیدنی هستم؟",
    "en": "Am I audible?",
    "groupCode": 0
  },
  {
    "id": 3232,
    "fa": "ویدیوی شما کمی تار است",
    "en": "Your video is a bit blurry",
    "groupCode": 0
  },
  {
    "id": 3233,
    "fa": "وجود دارد مقداری نویز پس زمینه در انتهای شما",
    "en": "There is some background noise at your end",
    "groupCode": 0
  },
  {
    "id": 3234,
    "fa": "بالانس نقدی موجود برای برداشت ممکن است تا هشت هفته کاهش یابد",
    "en": "The available cash balance for withdrawal may be reduced for up to eight weeks",
    "groupCode": 0
  },
  {
    "id": 3235,
    "fa": "او (زن) فیلم های ترسناک را دوست ندارد",
    "en": "She doesn't like horror films",
    "groupCode": 0
  },
  {
    "id": 3236,
    "fa": "بدهی های مستقیم می توان لغو شوند در هشت هفته اول",
    "en": "The direct debits can be revoked within the first eight weeks",
    "groupCode": 0
  },
  {
    "id": 3237,
    "fa": "لطفا از پرس و جوها اضافی توسط تلفن خودداری (اجتناب) کنید",
    "en": "Please refrain from additional inquiries by phone",
    "groupCode": 0
  },
  {
    "id": 3238,
    "fa": "او (مرد) هفته گذشته در دفتر نبود",
    "en": "He wasn't at the office last week",
    "groupCode": 0
  },
  {
    "id": 3239,
    "fa": "برای ما امکان پذیر نیست پردازش کردن درخواست شما در زمان مناسب (به موقع)",
    "en": "It's not possible for us to process your request in a timely manner",
    "groupCode": 0
  },
  {
    "id": 3240,
    "fa": "شما فقط داری 16 مسابقه باقی مانده",
    "en": "You only have 16 matches left",
    "groupCode": 0
  },
  {
    "id": 3241,
    "fa": "ادرارم کاملا کف کرده است. آیا بدان معنی است که کلیه هایم آسیب دیده؟",
    "en": "My urine has been quite foamy. Does it mean that my kidneys are damaged?",
    "groupCode": 0
  },
  {
    "id": 3242,
    "fa": "سرزنشم نکن",
    "en": "Don't scold me",
    "groupCode": 0
  },
  {
    "id": 3243,
    "fa": "بهم گیر نده",
    "en": "Don't pick on me",
    "groupCode": 0
  },
  {
    "id": 3244,
    "fa": "من تصادفاً آرنجم را روی میز کوبیدم",
    "en": "I accidentally bumped my elbow on the table",
    "groupCode": 0
  },
  {
    "id": 3245,
    "fa": "او عادت داشت (مرد) حلقه هایش را روی انگشت اشاره، انگشت وسط، انگشت حلقه و انگشت کوچیکه بپوشد",
    "en": "He used to wear his rings on his index finger, middle finger, ring finger, and pinky finger",
    "groupCode": 0
  },
  {
    "id": 3246,
    "fa": "مچ دستم داره مرا می کشد از تایپ کردن و کف دستم تمام عرق کرده",
    "en": "My wrist is killing me from typing, and my palm is all sweaty",
    "groupCode": 0
  },
  {
    "id": 3247,
    "fa": "او (مرد) روی کاناپه نشست و رشته هایش را با صدای بلند هورت کشید",
    "en": "He sat on the couch and slurped his noodles loudly",
    "groupCode": 0
  },
  {
    "id": 3248,
    "fa": "در هنگام تماشای تلویزیون, او (مرد) پاپ کورن ملچ ملوچ (خرچ و خرچ کردن) می کرد",
    "en": "While watching TV, he munched /mʌnt͡ʃ/ on popcorn",
    "groupCode": 0
  },
  {
    "id": 3249,
    "fa": "من از دکتر برگشتم و جراحی انجام دادم",
    "en": "I'm back from the doctor and got the operation done",
    "groupCode": 0
  },
  {
    "id": 3250,
    "fa": "اگر شما به تعطیلات نیاز دارید، شما نیاز داری برای مدتی استراحت کنی (دور شوی)",
    "en": "If you need a vacation, you need to get away for a while",
    "groupCode": 0
  },
  {
    "id": 3251,
    "fa": "تو میتونستی (توانسته بودی) کت رو بدی به من و من می گذاشتمش (گذاشته بودمش) روی چوب لباسی برات",
    "en": "You could have given me your coat, and I would have put it on the hanger for you",
    "groupCode": 0
  },
  {
    "id": 3252,
    "fa": "آیا آب لیمو برای کلیه ها خوب است؟",
    "en": "Is lemon water good for kidneys?",
    "groupCode": 0
  },
  {
    "id": 3253,
    "fa": "بنابراین، حیاتی است نگه داشتن بهینه سلامت کلیه برای رفاه کلی",
    "en": "Therefore, it's crucial to maintain optimal kidney health for overall well-being",
    "groupCode": 0
  },
  {
    "id": 3254,
    "fa": "اگر قصد داری به من اعتماد کنی، شما نیاز داری من را بشناسی",
    "en": "If you're gonna trust me, you need to know me",
    "desc": "\"You need to know me\": They should already understand you.\n\"You need to get to know me\": They need to take time to learn about you.",
    "groupCode": 0
  },
  {
    "id": 3255,
    "fa": "ما تازه ملاقات کردیم، اما شما نیاز داری اول من را بشناسی",
    "en": "We just met, but you need to get to know me first",
    "desc": "\"You need to know me\": They should already understand you.\n\"You need to get to know me\": They need to take time to learn about you.",
    "groupCode": 0
  },
  {
    "id": 3256,
    "fa": "من ازش مراقبت خواهم کرد و به شما پاسخ می دهم (بر می گردانم)",
    "en": "I'll take care of it and get back to you",
    "desc": "\"Get back to you\" = Respond to you after handling it.\n\"Get it back to you\" = Return the item to you after handling it.",
    "groupCode": 0
  },
  {
    "id": 3257,
    "fa": "کی ما تقریباً خواهیم دانست در مورد بودجه؟",
    "en": "When will we roughly know about the budget?",
    "groupCode": 0
  },
  {
    "id": 3258,
    "fa": "یک روز جوانی، روز بعد شما داری می نشینی اینگونه لبه تختت با کتف بد، زانوی بد و درد سیاتیک",
    "en": "One day you're young, the next day you're sitting like this at the edge of your bed with a bad shoulder, bad knee, and sciatica /saɪˈætɪkə/ pain",
    "groupCode": 0
  },
  {
    "id": 3259,
    "fa": "آنها برای سالگرد خود به یک استراحت عاشقانه رفتند",
    "en": "They went on a romantic getaway for their anniversary",
    "groupCode": 0
  },
  {
    "id": 3260,
    "fa": "من نیاز دارم برای مدتی استراحت کنم (دور باشم)",
    "en": "I need to get away for a while",
    "groupCode": 0
  },
  {
    "id": 3261,
    "fa": "او (مرد) قادر بود بیان کند ایده هایش را به وضوح در طول ارائه (عرضه)",
    "en": "He was able to articulate his ideas clearly during the presentation",
    "groupCode": 0
  },
  {
    "id": 3262,
    "fa": "من لباسم (ست کامل) چک کردم",
    "en": "I check out my outfit",
    "groupCode": 0
  },
  {
    "id": 3263,
    "fa": "من یک کیف انتخاب کردم",
    "en": "I pick out a bag",
    "groupCode": 0
  },
  {
    "id": 3264,
    "fa": "فقط پای خود را داخل کفش خود کنید (بکشید)",
    "en": "Just slide your foot into your shoe",
    "groupCode": 0
  },
  {
    "id": 3265,
    "fa": "جوراب خود را بپوشید, لطفا",
    "en": "Put on your socks, please",
    "groupCode": 0
  },
  {
    "id": 3266,
    "fa": "من پیراهنم را با احتیاط (داخل شلوارم) فرو می کنم تا مطمئن شوم تمیز و حرفه ای به نظر می رسد",
    "en": "I carefully tuck in my shirt to ensure it looks clean and professional",
    "groupCode": 0
  },
  {
    "id": 3267,
    "fa": "من حوصله ام سر رفت، بنابراین شروع کردم پرتاب تصادفی کش های مو در کامیون همکارانم",
    "en": "I got bored, so I started tossing random hair ties into my coworkers' truck",
    "groupCode": 0
  },
  {
    "id": 3268,
    "fa": "یک سود تقسیمی بخشی از سودهای اشتراکی با سهامداران است",
    "en": "A dividend is the cut of profits shared with shareholders",
    "groupCode": 0
  },
  {
    "id": 3269,
    "fa": "در طول سال, ما سمینارهای بیشتری پیشنهاد خواهیم داد",
    "en": "In the course of the year, we will offer further seminars",
    "groupCode": 0
  },
  {
    "id": 3270,
    "fa": "شما بیشتر از همیشه خوش آمدید برای آمدن به آفیس در هر زمانی و استفاده کنی از هر ورودی",
    "en": "You are all more than welcome to come to the office at any time and use any of the entrances",
    "groupCode": 0
  },
  {
    "id": 3271,
    "fa": "آیا می تونی یک جلسه زوم را به زبان انگلیسی با اطمینان رهبری کنی؟",
    "en": "Can you confidently lead a Zoom meeting in English?",
    "groupCode": 0
  },
  {
    "id": 3272,
    "fa": "آیا می تونی یک درگیری بین همکاران را میانجیگری کنی؟",
    "en": "Can you mediate a conflict between co-workers?",
    "groupCode": 0
  },
  {
    "id": 3273,
    "fa": "در صورتیکه تو از دستش دادی",
    "en": "In case you missed it",
    "groupCode": 0
  },
  {
    "id": 3274,
    "fa": "اگر می خواهید انگلیسی تجاری مناسبی را یاد بگیرید، اجتناب کنید از بدام افتادن در چرخه یادگیری جالب اما حرفه ای بی ربط لغات",
    "en": "If you want to learn proper business English, avoid getting trapped in a cycle of learning interesting but professionally irrelevant vocabulary",
    "groupCode": 0
  },
  {
    "id": 3275,
    "fa": "او (مرد) تماس (برمی گرداند تماس) خواهد گرفت به محض اینکه (اسرع وقت) او سوار ماشین می شود",
    "en": "He' ll call back as soon as he gets in the car",
    "groupCode": 0
  },
  {
    "id": 3276,
    "fa": "من بطور ضروری نیاز دارم اطلاعات در مورد تاریخ تحویل برای پروژه ساخت فرودگاه فرانکفورت",
    "en": "I urgently need information regarding the delivery date for the Frankfurt Airport construction project",
    "desc": "\"Regarding,\" \"on,\" and \"about\" all mean concerning or related to but vary in formality:\n\n\"Regarding\": More formal.\n\"On\": Slightly less formal.\n\"About\": Most casual.",
    "groupCode": 0
  },
  {
    "id": 3277,
    "fa": "لطفا من رو ببخشید, من یک تماس روی خط دیگه زودتر داشتم",
    "en": "Please excuse me, I had a call on the other line earlier",
    "groupCode": 0
  },
  {
    "id": 3278,
    "fa": "من یک نگاهی داخل سیستم خواهم داشت",
    "en": "I'll have a look in the system",
    "groupCode": 0
  },
  {
    "id": 3279,
    "fa": " تحویل (کالای) شما خواهد رسید در سایت ساخت در ۲۴ ساعت بعدی",
    "en": "Your delivery will arrive at the construction site within the next 24 hours",
    "groupCode": 0,
    "desc": "The verb \"arrive\" doesn’t always imply that something moves on its own. It’s often used to describe when an object reaches a destination, regardless of who or what is physically transporting it.\n\nIn this case, \"Your delivery will arrive\" means that the delivery is expected to reach the site. The sentence focuses on the final result—the delivery being at the construction site—not on who or what actually brings it there.\n\nIf you prefer to emphasize the fact that it’s being brought by someone, you could rephrase it:\n\n\"Your delivery will be delivered to the construction site.\""
  },
  {
    "id": 3280,
    "fa": "به لطف (تشکر) ادغام یکپارچه، کارمند قادر است بلافاصله اطلاعات تفصیلی (با جزییات) در مورد وضعیت سفارش فراهم کند",
    "en": "Thanks to the seamless integration, the employee is able to immediately provide detailed information on the order status",
    "groupCode": 0
  },
  {
    "id": 3281,
    "fa": "این بدان معنی است که دفعه بعد که من قرار می دهم یک سفارش با شما، من می توانم مستقیماً ببینم در پورتال جاییکه در حال حاضر تحویل در آن واقع شده و زمانیکه خواهد رسید",
    "en": "This means that the next time I place an order with you, I can see directly in the portal where the delivery is currently located and when it will arrive",
    "groupCode": 0
  },
  {
    "id": 3282,
    "fa": "به نظر می رسد شبیه یک رویا",
    "en": "Sounds like a dream",
    "groupCode": 0
  },
  {
    "id": 3283,
    "fa": "من دسترسی را از طریق ایمیل برات ارسال خواهم کرد",
    "en": "I will send you access by e-mail",
    "groupCode": 0
  },
  {
    "id": 3284,
    "fa": "من جدی هستم. آیا به نظر میرسم (شبیه) دارم شوخی می کنم؟",
    "en": "I'm dead serious. Do I look like I'm kidding?",
    "groupCode": 0
  },
  {
    "id": 3285,
    "fa": "مکان اشتباه زمان اشتباه. نه، من دقیقاً جایی هستم که باید باشم",
    "en": "Wrong place wrong time. No, I am exactly where I should be",
    "groupCode": 0
  },
  {
    "id": 3286,
    "fa": "نور داره سوسو می زنه",
    "en": "The light is flickering",
    "groupCode": 0
  },
  {
    "id": 3287,
    "fa": "میز لرزان است",
    "en": "The table is wobbly",
    "groupCode": 0
  },
  {
    "id": 3288,
    "fa": "در داره جیرجیر می کنه",
    "en": "The door is creaking",
    "groupCode": 0
  },
  {
    "id": 3289,
    "fa": "رنگ داره کنده میشه (پوست کندن)",
    "en": "The paint is peeling off",
    "groupCode": 0
  },
  {
    "id": 3290,
    "fa": "دوستم و من زیر بار مشکلات هستیم",
    "en": "My friend and I are under the burden of problems",
    "groupCode": 0
  },
  {
    "id": 3291,
    "fa": "علی, پیشرفت تو کاملا غیر قابل توقف است",
    "en": "Ali, your progress is totally unstoppable",
    "groupCode": 0
  },
  {
    "id": 3292,
    "fa": "غیرقابل انکار است که از یک لیموناد سرد در ماه جولای نمی توان پیشی گرفت",
    "en": "It is undeniable that a cold lemonade in July cannot be surpassed /sərˈpæs/",
    "groupCode": 0
  },
  {
    "id": 3293,
    "fa": "در زمان استراحتم، به بعضی مطالعات (خواندنی) رسیدگی کردم",
    "en": "During my downtime, I caught up on some reading",
    "groupCode": 0
  },
  {
    "id": 3294,
    "fa": "من یه مقدار کار دارم برای رسیدگی کردن",
    "en": "I have some work to catch up on",
    "groupCode": 0
  },
  {
    "id": 3295,
    "fa": "محموله شما در 20 سپتامبر 2024 در مرکز تدارکات ما پردازش شد و به مقصدش رسیده است",
    "en": "Your shipment was processed at our logistics center on September 20, 2024, and has reached its destination",
    "desc": "\"Logistics\" is the correct term when referring to the overall process of managing the movement of goods, and it is typically used in the plural form in this context",
    "groupCode": 0
  },
  {
    "id": 3296,
    "fa": "تو لایق آن افزایش (حقوق) هستی. الان جا نزن (تسلیم نشو)",
    "en": "You deserve that raise. Don't back down now",
    "groupCode": 0
  },
  {
    "id": 3297,
    "fa": "من یک فرصت (شوت) داشتم و ازش بهترین استفاده را کردم",
    "en": "I had one shot, and I made it count",
    "desc": "The phrase \"made it count\" emphasizes that the person took advantage of that time in a meaningful or useful way",
    "groupCode": 0
  },
  {
    "id": 3298,
    "fa": "مربع پنج برابر است با بیست و پنج",
    "en": "Five squared equals twenty-five",
    "groupCode": 0
  },
  {
    "id": 3299,
    "fa": "مکعب دو برابر با هشت است",
    "en": "Two cubed equals eight",
    "groupCode": 0
  },
  {
    "id": 3300,
    "fa": "سه به توان چهار برابر با هشتاد و یک است",
    "en": "Three to the power of four equals eighty-one",
    "groupCode": 0
  },
  {
    "id": 3301,
    "fa": "سه چهارم پیتزا تمام شده بود وقتی به خانه رسیدم",
    "en": "Three quarters of the pizza was gone by the time I got home",
    "groupCode": 0
  },
  {
    "id": 3302,
    "fa": "من یک و دو سوم از یک پیتزا را خوردم",
    "en": "I ate one and two-thirds of a pizza",
    "desc": "\"Two-thirds\" is plural because you are referring to two parts out of three.",
    "groupCode": 0
  },
  {
    "id": 3303,
    "fa": "شما باید صبر خود را افزایش دهید",
    "en": "You have to increase your patience",
    "groupCode": 0
  },
  {
    "id": 3304,
    "fa": "چقدر مکررا شما باید شلوار جین را بشویید؟",
    "en": "How frequently should you wash jeans?",
    "groupCode": 0
  },
  {
    "id": 3305,
    "fa": "بهترین راه ها برای ترقی دادن (سیستم) ایمنی چیست؟",
    "en": "What are the best ways to boost your immunity?",
    "groupCode": 0
  },
  {
    "id": 3306,
    "fa": "من احساس بیماری و (در) درد دارم. من احساس هر دو گرما و سرما را دارم",
    "en": "I feel sick and in pain. I feel both hot and cold",
    "groupCode": 0
  },
  {
    "id": 3307,
    "fa": "من برای دو هفته یک سرما خوردگی داشتم",
    "en": "I have had a cold for two weeks",
    "groupCode": 0
  },
  {
    "id": 3308,
    "fa": "من دیابتی هستم",
    "en": "I'm diabetic /ˌdaɪəˈbetɪk/",
    "groupCode": 0
  },
  {
    "id": 3309,
    "fa": "من (مدتی) سر درد (ها) دارم",
    "en": "I've been having headaches",
    "groupCode": 0
  },
  {
    "id": 3310,
    "fa": "پوستم میخاره و نمیتونم جلوی خاراندن رو بگیرم!",
    "en": "My skin is itchy, and I can't stop scratching!",
    "groupCode": 0
  },
  {
    "id": 3311,
    "fa": "من نیاز دارم به یک برگه بیماری از پزشکم تا غیبتم را بهانه کنم از کار به دلیل بیماریم",
    "en": "I need a sick note from my doctor to excuse my absence from work due to my illness",
    "groupCode": 0
  },
  {
    "id": 3312,
    "fa": "او (مرد) یک دروغگوی کثیف است",
    "en": "He is a filthy liar",
    "groupCode": 0
  },
  {
    "id": 3313,
    "fa": "هوشمندانه ترین مذاکره حقوقی که داشته اید چیست؟",
    "en": "What is the cleverest salary negotiation you've had?",
    "groupCode": 0
  },
  {
    "id": 3314,
    "fa": "چرا باید به لقمه های ناچیز قانع باشم؟",
    "en": "Why do I have to settle for crumbs?",
    "groupCode": 0
  },
  {
    "id": 3315,
    "fa": "چرا نمی توانیم ما عمیقتر از 12.2 کیلومتر زمین را حفاری کنیم؟",
    "en": "Why can't we dig deeper than 12.2 km into the Earth?",
    "groupCode": 0
  },
  {
    "id": 3316,
    "fa": "چگونه من سطوح تستوسترون را به طور سریع و به طور ایمن افزایش دهم؟",
    "en": "How do I increase testosterone levels quickly and safely?",
    "groupCode": 0
  },
  {
    "id": 3317,
    "fa": "قراره (قصد) خیلی سرگرم کننده باشه!",
    "en": "It's ganna be a lot of fun!",
    "groupCode": 0
  },
  {
    "id": 3318,
    "fa": "مطمئن شوید که ثبت نام شده اید و روی آیکون زنگ کلیک کنید تا مطلع شوید زمانیکه رویداد داره شروع میشه",
    "en": "Make sure you're enrolled and click the bell icon to be notified when the event is about to start",
    "groupCode": 0
  },
  {
    "id": 3319,
    "fa": "نگران نباشید اگر گفتید بله - این یک احساس بسیار مشترک است",
    "en": "Don't worry if you said yes - it's a very common feeling",
    "groupCode": 0
  },
  {
    "id": 3320,
    "fa": "بگذار به شما نشان دهم برخی از حقایق چشم باز کن باور نکردنی را که نقاشی کند یک تصویری از اینکه چقدر تحول آفرین می تواند باشد مهارت های انگلیسی قوی در محل کار",
    "en": "Let me show you some incredibly eye-opening facts that paint a picture of how transformative strong English skills at work can be",
    "groupCode": 0
  },
  {
    "id": 3321,
    "fa": "نزدیک به ۹ نفر از هر ۱۰ انگلیسی زبانان پیشرفته با شغل خودشان راضی هستند",
    "en": "Nearly 9 out of 10 advanced English speakers are satisfied with their jobs",
    "groupCode": 0
  },
  {
    "id": 3322,
    "fa": "آیا چیزی بود شما قرار بود امروز انجام بدی اما نکردی؟",
    "en": "Was there anything you were supposed to do today but didn't?",
    "groupCode": 0
  },
  {
    "id": 3323,
    "fa": "کی تو را دعوتت کرد؟ او (مرد) مرا دعوت کرد",
    "en": "Who invited you? He invited me",
    "groupCode": 0
  },
  {
    "id": 3324,
    "fa": "آیا می توانید (مودبانه) به او (مرد) یک اسپرسو بدید؟",
    "en": "Could you get him an espresso?",
    "groupCode": 0
  },
  {
    "id": 3325,
    "fa": "جریان ها می توانند متناهی یا بی نهایت باشند",
    "en": "Streams can be finite /ˈfaɪˌnaɪt/ or infinite /ˈɪnfənət/",
    "groupCode": 0
  },
  {
    "id": 3326,
    "fa": "او (مرد) هم شما را دوست می داشت (داشته بود) اگر او از شما خبر داشته بود",
    "en": "He would have loved you too if he had known about you",
    "groupCode": 0
  },
  {
    "id": 3327,
    "fa": "در حال حاضر، او (مرد) هیچ ایده ای ندارد شما کجا هستید. اگر او (مرد) می دانست تو کجا بودی، سوراخی در کیهان پاره می کرد (پاره کرده بود) تا تو را به خانه بیاورد",
    "en": "Right now, he has no idea where you are. If he knew where you were, he would have torn a hole in the universe to bring you home",
    "groupCode": 0
  },
  {
    "id": 3328,
    "fa": "پاهام (ران هام) احساس ضعف می کنند",
    "en": "My legs feel weak",
    "groupCode": 0
  },
  {
    "id": 3329,
    "fa": "گوشم درد میکنه (دردناک است)",
    "en": "My ears are sore",
    "groupCode": 0
  },
  {
    "id": 3330,
    "fa": "گلویم خشکه! من نمی توانم سرفه را متوقف کنم!",
    "en": "My throat is dry! I can't stop coughing!",
    "groupCode": 0
  },
  {
    "id": 3331,
    "fa": "من (مدتی) احساس افسردگی می کنم",
    "en": "I've been feeling depressed",
    "groupCode": 0
  },
  {
    "id": 3332,
    "fa": "سرم صدمه دیده! چم شده؟",
    "en": "My head hurts! What is wrong with me?",
    "groupCode": 0
  },
  {
    "id": 3333,
    "fa": "او (زن) فکر می کند او ممکن است باردار باشد",
    "en": "She thinks she might be pregnant",
    "groupCode": 0
  },
  {
    "id": 3334,
    "fa": " ۱.کلم \n ۲.کاهو \n ۳.کلم بروکلی \n ۴.اسفناج \n ۵.گل کلم",
    "en": "1.Cabbage /ˈkæbədʒ/ \n 2.Lettuce /ˈletəs/ \n 3.Broccoli /ˈbrɑːkəli/ \n 4.Spinach /ˈspɪnət͡ʃ/ \n 5.Cauliflower /ˈkɑːləˌflɑːwər/",
    "groupCode": 0
  },
  {
    "id": 3335,
    "fa": " ۱.کلم قرمز \n ۲.شلغم \n ۳.بادمجان \n ۴.چغندر \n ۵.فلفل",
    "en": "1.Red cabbage \n 2.Turnip /ˈtɜːrnəp/ \n 3.Eggplant \n 4.Beetroot \n 5.Pepper",
    "groupCode": 0
  },
  {
    "id": 3336,
    "fa": " ۱.پیاز \n ۲.سیب زمینی \n ۳.سیر \n ۴.قارچ \n ۵.ذرت ",
    "en": "1.Onion \n 2.Potato \n 3.Garlic \n 4.Mushroom \n 5.Corn",
    "groupCode": 0
  },
  {
    "id": 3337,
    "fa": " ۱.هویج \n ۲.گوجه فرنگی \n ۳.خیار \n ۴.نخود فرنگی \n ۵.مارچوبه ",
    "en": "1.Carrot \n 2.Tomato \n 3.Cucumber \n 4.Peas \n 5.Asparagus /əˈsperəɡəs/",
    "groupCode": 0
  },
  {
    "id": 3338,
    "fa": "بیا داخل",
    "en": "Come on in",
    "desc": "\"Come in\": A straightforward invitation to enter.\n\"Come on in\": A casual, friendly invitation, often more welcoming.",
    "groupCode": 0
  },
  {
    "id": 3339,
    "fa": "سن قبل از زیبایی اغلب به صورت طنز استفاده می شود زمانیکه اجازه داده می شود فرد جوانتر رهبری را بر عهده بگیرد",
    "en": "Age before beauty often used humorously when letting someone younger take the lead",
    "groupCode": 0
  },
  {
    "id": 3340,
    "fa": "لطفا عقب وایسا؛ تو خیلی به من نزدیکی",
    "en": "Please back off; you're too close to me",
    "groupCode": 0
  },
  {
    "id": 3341,
    "fa": "من تو آسمونام (آسمون نهم)",
    "en": "I'm on cloud nine",
    "groupCode": 0
  },
  {
    "id": 3342,
    "fa": "من تو پوست خودم نمی گنجم (من رو ماهم)",
    "en": "I'm over the moon",
    "groupCode": 0
  },
  {
    "id": 3343,
    "fa": "در چه حالی هستی؟ نمی توان شکایت کرد",
    "en": "How are you doing? Can't complain",
    "groupCode": 0
  },
  {
    "id": 3344,
    "fa": "آیا می توانید به من یک صندلی تو راهرو جلوی هواپیما بدید؟",
    "en": "Can you give me an aisle seat in the front of the plane?",
    "groupCode": 0
  },
  {
    "id": 3345,
    "fa": "متأسفانه, بازه زمانی که شما ارائه کردید برای ما مناسب نیست. آیا می توانید (مودبانه) لطفا به من اطلاع دهید زمان های موجود در مؤسسه خود را در دوشنبه و جمعه؟",
    "en": "Unfortunately, the time slot you provided is not suitable for us. Could you please let me know the available time slots at your institute on Monday and Friday?",
    "groupCode": 0
  },
  {
    "id": 3346,
    "fa": "کفش های جدیدم انگشتان پایم داره میزنه (نیشگون می گیرند) و این واقعا ناراحت کننده است",
    "en": "My new shoes are pinching my toes, and it's really uncomfortable",
    "groupCode": 0
  },
  {
    "id": 3347,
    "fa": "در چه حالی هستی؟ بهتر از (این) نمی تونست بشه",
    "en": "How are you doing? Couldn't be better",
    "groupCode": 0
  },
  {
    "id": 3348,
    "fa": "آشنا بازی زیاده اینجا",
    "en": "There is a lot of nepotism here",
    "groupCode": 0
  },
  {
    "id": 3349,
    "fa": "من نفخ کردم",
    "en": "I'm bloated",
    "groupCode": 0
  },
  {
    "id": 3350,
    "fa": "پوشیدن یک کلاه ایمنی تصادف نیاز است طبق قانون",
    "en": "The wearing of a crash helmet is required by law",
    "groupCode": 0
  },
  {
    "id": 3351,
    "fa": "شروع یک کار جدید در یک کشور خارجی احساس دلهره آور بود، اما من مصمم به موفقیت بودم",
    "en": "Starting a new job in a foreign country felt daunting, but I was determined to succeed",
    "groupCode": 0
  },
  {
    "id": 3352,
    "fa": "وقتیکه من هفته گذشته گم شدم، او (مرد) نمی دانست که من به دردسر افتاده بودم. اگر او (مرد) دانسته بود من کجا بودم، سوراخی در کیهان پاره می کرد (پاره کرده بود) تا تو را به خانه بیاورد",
    "en": "When I got lost last week, he didn't know I was in trouble. If he had known where I had been, he would have torn a hole in the universe to bring me home",
    "groupCode": 0
  },
  {
    "id": 3353,
    "fa": "این بزرگترین جامعه از زبان آموزان در جهان است",
    "en": "It's the world's largest community of language learners",
    "desc": "You need the possessive form \"world's\" to indicate that the community belongs to or is associated with the world.",
    "groupCode": 0
  },
  {
    "id": 3354,
    "fa": "خیلی چیزای بیشتر هست که من میخوام بگم",
    "en": "There's so much more I want to tell",
    "groupCode": 0
  },
  {
    "id": 3355,
    "fa": "من نگاهی خواهم انداخت تا ببینم چقدر خوب با کار فیته (مناسب است)",
    "en": "I'll take a look to see how well it fits the job",
    "groupCode": 0
  },
  {
    "id": 3356,
    "fa": "اون یک عدد (غیرمنصفانه) ظالمانه و مضحک است",
    "en": "That's an outrageous and ludicrous /ˈluːdəkrəs/ number",
    "groupCode": 0
  },
  {
    "id": 3357,
    "fa": "آخر هفته خوبی داشته باشید",
    "en": "Have a great weekend",
    "groupCode": 0
  },
  {
    "id": 3358,
    "fa": "آیا شما شهروند خوبی نیستید؟",
    "en": "Aren't you a good citizen?",
    "groupCode": 0
  },
  {
    "id": 3359,
    "fa": "من همیشه این دو کلمه را با هم اشتباه می گیرم",
    "en": "I always confuse these two words",
    "groupCode": 0
  },
  {
    "id": 3360,
    "fa": "چند نفر می خواهند به گردش (گشت و گذار) بروند؟",
    "en": "How many people want to go on the excursion?",
    "groupCode": 0
  },
  {
    "id": 3361,
    "fa": "تعریف شما رو زیاد شنیدم (شهرت شما بر شما مقدم است)",
    "en": "Your reputation precedes you",
    "groupCode": 0
  },
  {
    "id": 3362,
    "fa": "ما مایلیم این بعد از ظهر به یک گردش (گشت و گذار) برویم",
    "en": "We would like to go on an excursion this afternoon",
    "groupCode": 0
  },
  {
    "id": 3363,
    "fa": "آیا والدین شما ثروتمند هستند؟",
    "en": "Are your parents rich?",
    "groupCode": 0
  },
  {
    "id": 3364,
    "fa": "آیا می توانم یک نی بگیرم، لطفا؟",
    "en": "Can I get a straw, please?",
    "groupCode": 0
  },
  {
    "id": 3365,
    "fa": "ای کاش به اندازه این سینی محکم بودم زیر آن بار",
    "en": "I wish I'd be as sturdy as this tray under that load",
    "groupCode": 0
  },
  {
    "id": 3366,
    "fa": "پسرم رفتار خوبی داشت (خوب رفتار بود) در طول پرواز طولانی به آلمان",
    "en": "My son was well-behaved during the long flight to Germany",
    "groupCode": 0
  },
  {
    "id": 3367,
    "fa": "پدربزرگ شما کجا زندگی می کند؟",
    "en": "Where does your grandfather live?",
    "groupCode": 0
  },
  {
    "id": 3368,
    "fa": "چرا خواهر و برادر (تنی زادگان) شما اینقدر جوان و ثروتمند هستند؟",
    "en": "Why are your siblings so young and rich?",
    "groupCode": 0
  },
  {
    "id": 3369,
    "fa": "من یک خواهر (یا برادر) دارم",
    "en": "I have one sibling",
    "desc": "The difference between \"sibling\" and \"siblings\" is:\n\n\"Sibling\" (singular): Refers to one brother or sister.\n\nExample: I have one sibling.\n\"Siblings\" (plural): Refers to two or more brothers or sisters.\n\nExample: I have three siblings.\nSo, \"sibling\" is for one, while \"siblings\" is for more than one.",
    "groupCode": 0
  },
  {
    "id": 3370,
    "fa": "آیا فرزندان شما دارن در ژانویه کارآموزی می کنند؟",
    "en": "Are your children doing the internship in January?",
    "groupCode": 0
  },
  {
    "id": 3371,
    "fa": "آیا در حال حاضر برنامه هایی دارید؟",
    "en": "Do you already have plans?",
    "groupCode": 0
  },
  {
    "id": 3372,
    "fa": "نوه پسری و نوه دختری من خیلی باهوش هستند",
    "en": "My grandson and granddaughter are very smart",
    "groupCode": 0
  },
  {
    "id": 3373,
    "fa": "من با همسرم زمان های پیشنهادی را چک خواهیم کرد و اگر آنها با برنامه (زمانی) ما مطابقت داشته باشد، من به شما بر خواهم گرداند",
    "en": "I will check the offered time slots with my wife, and if they match our schedule, I will get back to you",
    "groupCode": 0
  },
  {
    "id": 3374,
    "fa": "آیا مادربزرگ شما یک کامپیوتر دارد؟",
    "en": "Does your grandmother have a computer?",
    "groupCode": 0
  },
  {
    "id": 3375,
    "fa": "هنگام کار با تراکنش ها در Spring، به طور کلی توصیه می شود به کار بگیرید قابلیت های مدیریت تراکنش Spring را به جای مدیریت تراکنش های دستی",
    "en": "When working with transactions in Spring, it's generally recommended to leverage Spring's transaction management capabilities instead of manually managing transactions",
    "groupCode": 0
  },
  {
    "id": 3376,
    "fa": "چرا همیشه این عادت را دارید که چیزی روی میز من بگذارید؟",
    "en": "Why do you always have this habit of putting something on my desk?",
    "groupCode": 0
  },
  {
    "id": 3377,
    "fa": "شرم آورترین جنایاتی که سلبریتی ها به خاطر (آن) دستگیر شده اند چیستند؟",
    "en": "What are the most embarrassing crimes that celebrities have been arrested for?",
    "groupCode": 0
  },
  {
    "id": 3378,
    "fa": "من نیاز دارم به تو در کنارم",
    "en": "I need you by my side",
    "groupCode": 0
  },
  {
    "id": 3379,
    "fa": "من هرگز تو را رها نخواهم کرد",
    "en": "I will never abandon you",
    "groupCode": 0
  },
  {
    "id": 3380,
    "fa": "تو منو خجالت میدی",
    "en": "You flatter me",
    "groupCode": 0
  },
  {
    "id": 3381,
    "fa": "من با شما تماس خواهم گرفت (یک تماس میدم) بعد از اصلاح",
    "en": "I will give you a call after the refinement",
    "groupCode": 0
  },
  {
    "id": 3382,
    "fa": "من یک ایمیل فرستادم و الان دارم انتظار می کشم برای یک پیگیری",
    "en": "I sent an email, and now I'm waiting for a follow-up",
    "groupCode": 0
  },
  {
    "id": 3383,
    "fa": "دختر کوچولو یک یتیم شد پس از (اینکه) والدینش فوت شدن",
    "en": "The little girl became an orphan after her parents passed away",
    "groupCode": 0
  },
  {
    "id": 3384,
    "fa": "آیا حق دفاع از خودش را دارد, و اگر چنین است, پاسخی متناسب چیست؟",
    "en": "Does it have the right to defend itself, and if so, what is a proportionate response?",
    "groupCode": 0
  },
  {
    "id": 3385,
    "fa": "من در مورد این موضوع یک معضل اخلاقی دارم",
    "en": "I've been having a moral quandary about the issue",
    "groupCode": 0
  },
  {
    "id": 3386,
    "fa": "او (مرد) خسته و ژولیده به نظر رسید",
    "en": "He looked tired and disheveled",
    "groupCode": 0
  },
  {
    "id": 3387,
    "fa": "ملت مستقل مورد حمله قرار گرفت",
    "en": "The sovereign nation was attacked",
    "groupCode": 0
  },
  {
    "id": 3388,
    "fa": "من واقعاً مخالفم با بسیاری از این سازمان ها برای دلایل خودم",
    "en": "I'm really opposed to a lot of these organizations for my own reasons",
    "groupCode": 0
  },
  {
    "id": 3389,
    "fa": "ما توانایی های آنها را تنزل داده ایم",
    "en": "We've degraded their capabilities",
    "groupCode": 0
  },
  {
    "id": 3390,
    "fa": "اجازه ندهید این تروریست ها آینده شما را دیگر بیش از آنچه قبلا انجام داده اند نابود کنند",
    "en": "Don't let these terrorists destroy your future any more than they've already done",
    "groupCode": 0
  },
  {
    "id": 3391,
    "fa": "شما یک فرصت دارید نجات دهید کشور خود را قبل از (اینکه) سقوط کند داخل پرتگاه یک جنگ طولانی که منجر خواهد شد به نابودی",
    "en": "You have an opportunity to save your country before it falls into the abyss of a long war that will lead to destruction",
    "groupCode": 0
  },
  {
    "id": 3392,
    "fa": "اعتقادات او (زن) با ارزش های گروه متضاد است",
    "en": "Her beliefs are antithetical to the group's values",
    "groupCode": 0
  },
  {
    "id": 3393,
    "fa": "این برای همه کسانی است که گرفتن مهربانیم (به عنوان) نقطه ضعف",
    "en": "This is for all the people who took my kindness as weakness",
    "groupCode": 0
  }
]