[]

Das Restaurant ist links neben dem Cafe

Der Fluss ist zwischen den Cafes

Der Dom/ die Kirche ist neben dem Park/ zwischen dem Park und der Straße

Die Ampel ist an der Straße/ an der Kreuzung der Straßen

Die Polizei ist vor dem Park neben der Straße.

Die Brücke ist an der Straße neben der Ampel, links neben der Ampel.

Es gibt ein flaches Dach
das Flachdach
die Fenster sind größer
der Carport
Das Haus hat zwei Etagen/ Stockwerke
es ist zweigeschossig
das Erdgeschoss/ die erste Etage
die Außentreppe
In Vanillas Garten steht ein Baum
Welches Haus hat eine grüne Tür? Eingangstür?
Welches Haus hat einen silbernen Briefkasten?
In welchem Garten gibt es ein Schwimmbad
der Liegestuhl, das Blumenbeet, der Blumenkasten
Aufgabe 3: Schreiben Sie kurze Sätze: Wo gibt es welche Zimmer im Haus? Wo sind die Zimmer? Welche ZImmer gibt es
Bitte schreiben Sie in ein Word-Dokument.

Welche Zimmer gibt es in dem Haus?

Bitte die Nomen groß schreiben - mit Versalie beginnen

Bitte formulieren Sie Sätze: Die Küche ist im Erdgeschoss….
Es gibt ein Arbeitszimmer….Es gibt  einen Schreibtisch und einen Stuhl. Der Computer steht auf dem Schreibtisch. Der Mülleimer steht neben dem Schreibtisch.

Es gibt …. + Akkusativ   Es gibt einen Schreibtisch.

Raum 4:

Das Wohnzimmer -> G
Die Kuche -> F

Das Arbeitszimmer -> D

Das Schlafzimmer -> B
Das Bad -> C
Das Toilette -> E
Der Flur -> H
Der Erdgeschoss -> J
Das Erste stock -> I


Ein Schreibtisch und ein stuhl. Das Computer steht auf dem Schreibtisch. Müllleimer steht neben dem schreibtisch
Wohnzimmer: Es ist ein großes Zimmer in dem Haus. Es hat ein Sofa und einen Esstisch mit 6 Stühlen. Es hat auch ein Fernsehen und eine Lampe auf dem Boden (=die Stehlampe). Das Zimmer hat einen großen Teppich.

der Esstisch , der Fernseher

Das Arbeitszimmer ist hinter der Toilette und neben den Wohnzimmer im Erdgeschoss. Es gibt einen Schreibtisch und eine Laptop.

Die Küche ist im ersten Stock. Sie ist groß und sauber. Sie ist neben dem Wohnzimmer.
Ich habe eine Küche. Sie  ist llnks neben dem Wohnzimmer. Das Wohnzimmer  ist nicht zu groß. Ich habe einen kleinen Kühlschrank.

Hausaufgabe: Wie sieht Ihre Wohnung aus? Wie viele Zimmer gibt es? Gibt es einen Balkon? Gibt es einen Keller? Welche Möbel sind im Wohnzimmer? Schreiben Sie zehn Sätze.
