[


  {
    "id": ,
    "fa": "",
    "en": "When astronauts are in space can they still be blinded by the sun?"
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": "Why can't the Sun be seen from outer space?"
  },
  {
    "id": ,
    "fa": "",
    "en": "What colour is the Sun when viewed from outside of the Earth's atmosphere?"
  },
  {
    "id": ,
    "fa": "",
    "en": "Why is space never illuminated by the light emanating from the Sun?"
  },
  {
    "id": ,
    "fa": "",
    "en": "Would Earth be visible from Mars with the naked eye?"
  },
  {
    "id": ,
    "fa": "",
    "en": "I didn't know what's on the stake otherwise I wouldn't try that hard"
  },
  {
    "id": ,
    "fa": "",
    "en": "Please remember to put your dishes in the dishwashers"
  },
  {
    "id": ,
    "fa": "",
    "en": "Many cups and plates as well as cutlery are left on the desks"
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  }







  won't be able to make it for the retro today, still stuck on my appointment

  if there is something how we can mitigate it

  she is coming back on or in november,

  The sun overwhelms the light from distance

  get your ass back to the ranger now

  I want to trust you but how can I
]

// grammer passive till Infinitive

Forgot to mention I won't be in office this week and on 16th as my daughter's kita is closed and we will take turn and manage her.
o be honest, you make me very (healthy) envious, I love having hands on that kind of stuff
How do I tell him it's not a viable career option and shut down the account while not being despised?


Dear Ali,
I am really really sorry but I have to cancel our match today, I just decided I’m not coming to the office because I am feeling sick and the pain it’s not going away despite the medicines.
I will then go on holiday but will re-schedule our meeting as soon as possible when I’m back.
Sorry again, hope you have a great day.
Valentina

No problem at all. Your health comes first. Rest up and feel better soon. We'll reschedule our meeting when both of us come back from our holiday.