[
  {
    "id": 1704,
    "fa": "رویای من بالاخره محقق شد و امیدوارم مدت زیادی ادامه داشته باشد",
    "en": "My dream has finally come to fruition (/fro͞oˈiSH(ə)n/), and it will hopefully last long"
  },
  {
    "id": 1705,
    "fa": "سیستم تخلیه جدید ما امروز راه اندازی خواهد شد",
    "en": "Our new evacuation system will be put into operation today"
  },
  {
    "id": 1706,
    "fa": "آیا تا به حال فکر کرده اید بالاترین ارتفاعی که هر جت جنگنده می تواند به آن برسد چیست؟",
    "en": "Have you ever wondered what is the highest altitude any fighter jet can reach?"
  },
  {
    "id": 1707,
    "fa": "او (زن) اجازه داد به (او) مخ دوستش را بزند برای بیش از 5 دقیقه",
    "en": "She let him hitting on her friend for over 5 minutes"
  },
  {
    "id": 1708,
    "fa": "به عنوان رئیس، من اجازه نداشتم باشم",
    "en": "As chairman, I wasn't allowed to be"
  },
  {
    "id": 1709,
    "fa": "اینجا جایی نبود؟",
    "en": "Was there nowhere here?"
  },
  {
    "id": 1710,
    "fa": "فکر کنم رفته",
    "en": "I think it's gone"
  },
  {
    "id": 1711,
    "fa": "من سعی کردم بدون اینکه آماده باشم یک غذای پیچیده بپزم, منجر به یک فاجعه آشپزی شد",
    "en": "I attempted to cook a complex dish without being ready, resulting in a culinary disaster"
  },
  {
    "id": 1712,
    "fa": "من مصمم بودم که او را وادار کنم تا مؤسسه را اداره کند",
    "en": "I was determined to get him to run the Institute"
  },
  {
    "id": 1713,
    "fa": "من یک تحسین کننده بزرگ کار شما هستم",
    "en": "I'm a great admirer of your work"
  },
  {
    "id": 1714,
    "fa": "او (مرد) بعد از این بیشتر آنجاست",
    "en": "He's there most after this"
  },
  {
    "id": 1715,
    "fa": "خدا تاس بازی نمی کند",
    "en": "God doesn't play dice"
  },
  {
    "id": 1716,
    "fa": "چرا بعد از تمام کارهایی که شما برای کشورتان انجام داده اید، نگران باشم؟",
    "en": "Why would I be worried after everything you've done for your country?"
  },
  {
    "id": 1717,
    "fa": "من نمی خواستم با دادن اطلاعات نادرست او را از خودم بیازارم",
    "en": "I didn't want to sour him on me by giving him false information"
  },
  {
    "id": 1718,
    "fa": "ممنون از سوار کردنتان",
    "en": "Thanks for the lift"
  },
  {
    "id": 1719,
    "fa": "چگونه می تونم کفشم را کوچکتر کنم؟",
    "en": "How can I make my shoe smaller?"
  },
  {
    "id": 1720,
    "fa": "تو اصلا به پدرت نرفتی",
    "en": "You don't take after your father at all"
  },
  {
    "id": 1721,
    "fa": "تو با پدرت خیلی فرق داری",
    "en": "You're very different from your father"
  },
  {
    "id": 1722,
    "fa": "تو جنبه شوخی نداری",
    "en": "You can't take a joke"
  },
  {
    "id": 1723,
    "fa": "آیا مادرشوهرت در زندگی خصوصی شما دخالت می کند؟",
    "en": "Does your mother-in-law interfere in your private life?"
  },
  {
    "id": 1724,
    "fa": "کل کلاس از خنده منفجر شد",
    "en": "The whole class burst out laughing"
  },
  {
    "id": 1725,
    "fa": "امروز حوصله بیرون رفتن ندارم",
    "en": "I'm not in the mood for going out today"
  },
  {
    "id": 1726,
    "fa": "از کجا فهمیدی دروغ میگه؟",
    "en": "How did you know he was lying?"
  },
  {
    "id": 1727,
    "fa": "چرا می خواهید شغلت را ترک کنی؟",
    "en": "Why do you want to quit your job?"
  },
  {
    "id": 1728,
    "fa": "در مورد حقوق نیست",
    "en": "It's not about the salary"
  },
  {
    "id": 1729,
    "fa": "تو جلوی همه سرم داد زدی",
    "en": "You shouted at me in front of everybody"
  },
  {
    "id": 1730,
    "fa": "چرا اینقدر از دست برادرت ناراحتی؟",
    "en": "Why are you so upset with your brother?"
  },
  {
    "id": 1731,
    "fa": "تمام آخر هفته مثل اسب کار کردم",
    "en": "I worked like a horse all weekend"
  },
  {
    "id": 1732,
    "fa": "با خانواده خوش گذشت؟",
    "en": "Did you have fun with your family?"
  },
  {
    "id": 1733,
    "fa": "وقتشه دست از حرف زدن برداریم و اقدام کنید",
    "en": "It's time to stop talking and take action"
  },
  {
    "id": 1734,
    "fa": "من باید به آمریکا برگردم",
    "en": "I have to get back to America"
  },
  {
    "id": 1735,
    "fa": "هیچ کس آنجا او را جدی نمی گیرد",
    "en": "There's no one there taking him seriously"
  },
  {
    "id": 1736,
    "fa": "بهتر است به خانه برگردی",
    "en": "It's best you get home"
  },
  {
    "id": 1737,
    "fa": "فکر میکردم که من به شما آزمایش گرا نزدیک خواهم بود",
    "en": "I thought I'd be close to you experimentalists"
  },
  {
    "id": 1738,
    "fa": "تئوری فقط تا اینجا شما را می رساند",
    "en": "Theory will get you only so far"
  },
  {
    "id": 1739,
    "fa": "من دارم چیزی را آموزش می دهم که هیچ کس در اینجا علاقه ندارد",
    "en": "I'm teaching something no one here is interested of"
  },
  {
    "id": 1740,
    "fa": "چطور می تواند هر دو باشد؟",
    "en": "How could it be both?"
  },
  {
    "id": 1741,
    "fa": "چرا آنها بدون برنامه ریزی مناسب پروژه را شروع کرده بودند؟",
    "en": "Why would they have started the project without proper planning?"
  },
  {
    "id": 1742,
    "fa": "چه اتفاقی برای ستاره ها می افتد وقتی أنها می میرند؟",
    "en": "What happens to stars when they die?"
  },
  {
    "id": 1743,
    "fa": "",
    "en": "Make sure he understands that he's not losing a damn thing by getting rid of you"
  },
  {
    "id": 1744,
    "fa": "پنیر کپک زده است",
    "en": "The cheese is mouldy"
  },
  {
    "id": 1745,
    "fa": "پنیر کپک زده است",
    "en": "The cheese is mouldy"
  },
  {
    "id": 1746,
    "fa": "نان کهنه است",
    "en": "The bread is stale"
  },
  {
    "id": 1747,
    "fa": "شیر فاسد شده است",
    "en": "The milk is spoiled"
  },
  {
    "id": 1748,
    "fa": "شیر منقضی شده است",
    "en": "The milk has expired"
  },
  {
    "id": 1749,
    "fa": "هلوها پوسیده هستند",
    "en": "The peaches are rotten"
  },
  {
    "id": 1750,
    "fa": "یخچال ما بو می دهد",
    "en": "Our fridge stinks"
  },
  {
    "id": 1751,
    "fa": "چیز مهمی نیست",
    "en": "It's not a big deal"
  },
  {
    "id": 1752,
    "fa": "سقوط بازار سهام پس انداز او (مرد) را از بین برد (پاک کرد)",
    "en": "The stock market crash wiped out his savings"
  },
  {
    "id": 1753,
    "fa": "او (زن) قهوه را روی میز ریخت و مجبور شد آن را پاک کند",
    "en": "She spilled coffee on the table and had to wipe it up"
  },
  {
    "id": 1754,
    "fa": "دستمال را بگیر و آب را جذب کن",
    "en": "Take the towel and sop water up"
  }
]

// grammer passive till Infinitive

Forgot to mention I won't be in office this week and on 16th as my daughter's kita is closed and we will take turn and manage her.
o be honest, you make me very (healthy) envious, I love having hands on that kind of stuff
How do I tell him it's not a viable career option and shut down the account while not being despised?


Dear Ali,
I am really really sorry but I have to cancel our match today, I just decided I’m not coming to the office because I am feeling sick and the pain it’s not going away despite the medicines.
I will then go on holiday but will re-schedule our meeting as soon as possible when I’m back.
Sorry again, hope you have a great day.
Valentina

No problem at all. Your health comes first. Rest up and feel better soon. We'll reschedule our meeting when both of us come back from our holiday.