[

{
  "id":,
  "fa": "من حوصله ام سر رفت، بنابراین شروع کردم به پرتاب تصادفی کش مو در کامیون همکارانم",
  "en": "I got bored, so I started throwing random hair ties into my coworkers' trucks",
  "groupCode": 0
},

  {
    "id":,
    "fa": "سود تقسیمی سهم سودی است که بین سهامداران تقسیم می شود",
    "en": "The dividend is the share of profits distributed to shareholders",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "در طول سال, ما سمینارهای بیشتری پیشنهاد خواهیم داد",
    "en": "In the course of the year, we will offer further seminars",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "شما بیشتر از همیشه خوش آمدید برای آمدن به آفیس در هر زمانی و استفاده کنی از هر ورودی",
    "en": "You are all more than welcome to come to the office at any time and use any of the entrances",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "شما فقط داری 16 مسابقه باقی مانده",
    "en": "You only have 16 matches left",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "سوپریادگیران 4.2 برابر بیشتر احتمال دارد دوره خود را به پایان برسانند",
    "en": "Super learners are 4.2x more likely to finish their course",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Wrong place wrong time Raiden. No, I am exactly where I should be",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Why can't we dig deeper than 12.2 km into the Earth?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "معمولاً چه چیزی شما را از ارائه بازخورد به متقاضیان رد شده باز می دارد؟",
    "en": "What usually holds you back from providing feedback to rejected applicants?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  }

  {
    "id":,
    "fa": "او (مرد) تو را به خاطر متفاوت بودنش تحقیر کرد",
    "en": "He despised you for being different",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "ما باید برای حفظ محیط زیست خود برای نسل های آینده گامها را برداریم",
    "en": "We need to take steps to sustain our environment for future generations",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "شمشیر خود را بکش و مرد خود را نجات بده",
    "en": "Draw your sword and save your man",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "امیدوارم این ایمیل شما را در حال خوبی بیابد",
    "en": "I hope this email finds you well",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "آیا به طور خلاصه (مخلص کلام) وظایف خود را می دانید؟",
    "en": "Do you know your responsibilities in a nutshell?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "از خواب بیدار شدن هر روز صبح با لبخندی روشن آسان تر از آن چیزی است که تو فکر می کنی",
    "en": "Getting up every morning with a bright smile is easier than you think",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "با مراقبت های موثر و روتین دندان، شما قرار می دهید اساس سلامت دهان و دندان که تا سنین بالا خوب دوام می آورد",
    "en": "With effective and routine dental care, you lay the foundation for oral and dental health that lasts well into old age",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "دندانپزشک من گفت خوب مسواک بزنید و نخ دندان بکشید برای جلوگیری از ایجاد جرم (پلاک)",
    "en": "My dentist said to brush and floss well to avoid tartar (plaque) buildup",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "من (هر دو) به وجد آمدم و ترسیده بودم",
    "en": "I was both ecstatic and terrified",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "طبق مطالعات, تقریباً 70 درصد پروژه های نرم افزاری به موقع تحویل داده نمی شوند",
    "en": "According to studies, approximately 70% of software projects are not delivered on time",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "در اینجا ما ازش استفاده خواهیم کرد برای یادگیری پیچیدگی های حوزه های تجاری",
    "en": "Here we will use it to learn the intricacies of business domains",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "باید عاری از ابهام، مفروضات ضمنی و جزئیات اضافی باشد",
    "en": "It should be free of ambiguity, implicit assumptions, and extraneous details",
    "groupCode": 0
  }
]

https://www.youtube.com/watch?v=RYhODLiB4Fw
//1:08