[

  {
    "id": ,
    "fa": "آیا این چیزها رو داری درست می کنی تا از این دعوا رهایی یابی؟",
    "en": "Are you making things up to get out of this fight?"
  },



  {
    "id": ,
    "fa": "این گزارش آمد کمتر از دو ماه قبل از دیدار رهبران جهان برای نشست جهانی اجلاس",
    "en": "The report comes less than two month before world leaders meet for the global commit summit"
  },
  {
    "id": ,
    "fa": "دیروز ناگهان چراغ جلوی ماشینم سمت راننده سوخت",
    "en": "Yesterday, suddenly, the headlight of my car on the driver's side burnt out"
  }
  {
    "id": ,
    "fa": "من بلیط باز دارم و مایلم تاریخ خروج را زمانبندی کنم",
    "en": "I have open ended ticket and I would like to schedule a departure date"
  },
  {
    "id": ,
    "fa": "زمانبندی شدم برای حرکت در 15",
    "en": "I am scheduled to depart on June 15th"
  },

  {
    "id": ,
    "fa": "ما برای 22ام صندلی های موجود داریم. دوست دارید (مودبانه) آنها را رزرو کنم؟",
    "en": "We have seats available for the 2th. Would you like me to reserve them?"
  },
  {
    "id": ,
    "fa": "من قراره برای یک هفته نباشم (برم), بنابراین اگر قراره با من ارتباط برقرار کنی نمی تونی",
    "en": "I'm gonna be gone for a week, so if you gonna reach me, you can't."
  },
  {
    "id": ,
    "fa": "این برنامه سفر من است",
    "en": "Here is my itinerary (/aɪˈtɪnəˌreri/)"
  },
  {
    "id": ,
    "fa": "می تونی هرازگاهی ببریش پیش (خانه) علی",
    "en": "Can you take it to Ali's every now and then"
  },
  {
    "id": ,
    "fa": "",
    "en": "A man ambition should never exceed his worth"
  },
  {
    "id": ,
    "fa": "",
    "en": "Like the rest of the world, we are shocked and deeply saddened by this inconceivable act of terror"
  },
  {
    "id": ,
    "fa": "از شما صمیمانه دعوت می شود تا به ما کمک کنید تا غذای دیروز را تمام کنیم",
    "en": "You are cordially (کُردیِ لی) invite to help us finish off the food from yesterday"
  },
  {
    "id": ,
    "fa": "چگونه به خارج از کشور پول ارسال کنیم؟",
    "en": "How to send money abroad?"
  },
  {
    "id": ,
    "fa": "هیچ کس همه چیز را از رحم مادرش یاد نمی گیرد",
    "en": "Nobody learns everything from their mother's womb"
  },
  {
    "id": ,
    "fa": "کنجکاو باش نه قضاوت کننده",
    "en": "Be curious not judgemental"
  },
  {
    "id": ,
    "fa": "دستگیره در شل بود، بنابراین سفتش کردم تا درب را نگه دارم از تکان خوردن",
    "en": "The doorknob was loose (لوس), so I tightened it to keep the door from wobbling"
  },
  {
    "id": ,
    "fa": "او (مرد) درست به من یاد داد",
    "en": "He taught me right"
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  }







  won't be able to make it for the retro today, still stuck on my appointment

  if there is something how we can mitigate it

  she is coming back on or in november,

  The sun overwhelms the light from distance

  get your ass back to the ranger now

  I want to trust you but how can I
]

// grammer passive till Infinitive

Forgot to mention I won't be in office this week and on 16th as my daughter's kita is closed and we will take turn and manage her.
o be honest, you make me very (healthy) envious, I love having hands on that kind of stuff
How do I tell him it's not a viable career option and shut down the account while not being despised?


Dear Ali,
I am really really sorry but I have to cancel our match today, I just decided I’m not coming to the office because I am feeling sick and the pain it’s not going away despite the medicines.
I will then go on holiday but will re-schedule our meeting as soon as possible when I’m back.
Sorry again, hope you have a great day.
Valentina

No problem at all. Your health comes first. Rest up and feel better soon. We'll reschedule our meeting when both of us come back from our holiday.