[

  {
    "id": ,
    "fa": "من همچنین برای اخبار در اینترنت گشت و گذار می کنم",
    "en": "I also surf the net for news"
  },
  {
    "id": ,
    "fa": "حدود پنج دقیقه دیگر کارم تمام خواهد شد",
    "en": "I'll be finished in about five minutes"
  },
  {
    "id": ,
    "fa": "او (زن) ملاقات کور من است",
    "en": "She is my blind date"
  },
  {
    "id": ,
    "fa": "میتونم ببینم چرا ممکنه عصبی بشی",
    "en": "I can see why you might be nervous"
  },
  {
    "id": ,
    "fa": "او کمی داره دیرش میشه. او به زودی اینجا خواهد بود",
    "en": "He's running a little late. He'll be here shortly"
  },
  {
    "id": ,
    "fa": "چرا می خواهید شروع به فروش بستنی کنید؟",
    "en": "Why do you want to start selling ice cream?"
  },
  {
    "id": ,
    "fa": "من اوقات فراغت تابستان امسال دارم",
    "en": "I have spare time this summer"
  },
  {
    "id": ,
    "fa": "من هرگز این کار را انجام نداده ام",
    "en": "I've never done this before"
  },
  {
    "id": ,
    "fa": "آیا می توانم برای شما چیزی بگیرم برای نوشیدن؟",
    "en": "Can I get you something to drink?"
  },
  {
    "id": ,
    "fa": "اگر محموله امروز حرکت کند، سه هفته دیگر می رسد",
    "en": "If the shipment leaves today, it will arrive in three weeks"
  },
  {
    "id": ,
    "fa": "ارسال یک جعبه بزرگ به ایران چقدر طول می کشد؟",
    "en": "How long would it take to ship a large box to Iran?"
  },
  {
    "id": ,
    "fa": "خانواده شما چند نفره است؟ ما چهار نفر هستیم",
    "en": "How many people are in your family? There are four of us"
  },
  {
    "id": ,
    "fa": "من بچه وسط هستم",
    "en": "I'm the middle child"
  },
  {
    "id": ,
    "fa": "متولد کدام سال هستید؟",
    "en": "Which year were you born?"
  },
  {
    "id": ,
    "fa": "با او (مرد) کنار میای؟",
    "en": "Do you get along with him?"
  },
  {
    "id": ,
    "fa": "برای کیست؟",
    "en": "Who is it for?"
  },
  {
    "id": ,
    "fa": "چطور هیچ وقت برای من کارت تولد درست نمی کنی؟",
    "en": "How come you never make me a birthday card?"
  },
  {
    "id": ,
    "fa": "چرا در ایالات متحده به مهاجران نیاز است در حالی که بسیاری از آمریکایی ها شغل ندارند؟",
    "en": "Why are immigrants needed in the U.S. when many Americans don't have jobs?"
  },
  {
    "id": ,
    "fa": "من الان هوشیارم",
    "en": "I'm sober now"
  },
  {
    "id": ,
    "fa": "من او را به خانه رساندم",
    "en": "I drove her home"
  },
  {
    "id": ,
    "fa": "قهوه ات را گرفتی؟",
    "en": "Did you get your coffee?"
  },
  {
    "id": ,
    "fa": "سه سهام رانندگی مستقل که باید در پاییز امسال در رادار هر سرمایه گذاری باشد",
    "en": "Three autonomous driving stocks that should be on every investor’s radar this fall"
  },
  {
    "id": ,
    "fa": "من وسط یه چیزی هستم آیا می توانم 10 دقیقه دیگر با شما تماس بگیرم؟",
    "en": "I'm in the middle of something. Can I call you back in 10 minutes?"
  },
  {
    "id": ,
    "fa": "نمی دانم، بیا یه نگاهی بندازیم",
    "en": "I don't know, let's take a look"
  },
  {
    "id": ,
    "fa": "من دارم نقشه می ریزم تا در ماه آگوست یک سفر به اروپا داشته باشم",
    "en": "I'm planning to take a trip to europe in August"
  },
  {
    "id": ,
    "fa": "من از ساعت 6 صبح درس می خونم و واقعا نیاز به استراحت دارم",
    "en": "I've been studying since 6 o'clock in the morning and I really need to take a break"
  },
  {
    "id": ,
    "fa": "آروم باش یه نفس عمیق بکش",
    "en": "Calm down take a deep breath"
  },
  {
    "id": ,
    "fa": "حمام کردی؟",
    "en": "Did you take a bath?"
  },
  {
    "id": ,
    "fa": "با خیال راحت هر چیزی را که می خواهید بردارید",
    "en": "Feel free to take anything you want"
  },
  {
    "id": ,
    "fa": "من به یک مهمانی دعوت شده ام و واقعاً چیزی برای پوشیدن ندارم",
    "en": "I've been invited to a party and I really don't have anything to wear"
  },
  {
    "id": ,
    "fa": "میشه منو ببر خونه لطفا؟",
    "en": "Can you take me home please?"
  },
  {
    "id": ,
    "fa": "میدونم که تو عصبانی هستی اما سر من خالی نکن",
    "en": "I know you're mad but don't take it out on me"
  },
  {
    "id": ,
    "fa": "فراموش نکن قرص هات رو بخوری",
    "en": "Don't forget to take your pills"
  },
  {
    "id": ,
    "fa": "می توانید به این پروژه نگاهی بیندازید؟",
    "en": "Can you take a look at this project?"
  },
  {
    "id": ,
    "fa": "او مرا به شک انداخت",
    "en": "He made me doubt"
  },
  {
    "id": ,
    "fa": "",
    "en": "I was extremely drunk that day"
  },
  {
    "id": ,
    "fa": "او (زن) هم سن من است",
    "en": "She is my age"
  },
  {
    "id": ,
    "fa": "شما هرگز نمی دانید چه زمانی قصد دارید به یکی نیاز داشته باشید",
    "en": "You never know when you are gonna need one"
  },
  {
    "id": ,
    "fa": "از کجا قراره چاپگر پیدا کنم؟",
    "en": "Where am I supposed to find a printer?"
  },
  {
    "id": ,
    "fa": "از خودت خوب مراقب کن",
    "en": "Take a good care of yourself"
  },
  {
    "id": ,
    "fa": "هر دوی آنها واقعاً برای شما خوب به نظر می رسند",
    "en": "Both of them look really good on you"
  },
  {
    "id": ,
    "fa": "میشه از ما عکس بگیری",
    "en": "Can you take a picture of us?"
  },
  {
    "id": ,
    "fa": "من می خواهم به این آدرس بروم اما مطمئن نیستم که کدام اتوبوس را باید بگیرم؟",
    "en": "I wanna go to this address but I'm not sure which bus I should take?"
  },
  {
    "id": ,
    "fa": "تو خیلی لجوج هستی تو هرگز نصیحت من را نمی پذیری",
    "en": "You're so stubborn you never take my advice"
  },
  {
    "id": ,
    "fa": "آیا می توانم یک نصیحت به شما کنم؟",
    "en": "Can I give you a piece of advice?"
  },
  {
    "id": ,
    "fa": "چرا بقیه روز را مرخصی نمی گیری؟",
    "en": "Why don't you take the rest of the day off?"
  },
  {
    "id": ,
    "fa": "نگران نباشید. من از آن برای شما مراقبت خواهم کرد",
    "en": "Don't worry. I'll take care of it for you"
  },
  {
    "id": ,
    "fa": "من حتی برای آن وقت ندارم",
    "en": "I don't even have time for that"
  },
  {
    "id": ,
    "fa": "میتونی منو برگردونی خونه؟",
    "en": "Can you take me back home?"
  },
  {
    "id": ,
    "fa": "نمی توانم چشم از تو بردارم",
    "en": "I can't take my eyes off you"
  },
  {
    "id": ,
    "fa": "باید از این فرصت استفاده کنی",
    "en": "You should take advantage of this opportunity"
  },
  {
    "id": ,
    "fa": "او تصمیم گرفت که اوضاع را خودش به دست بگیرد",
    "en": "He decided to take matters into his own hands"
  },
  {
    "id": ,
    "fa": "می تونی آن را با خودت ببری",
    "en": "You can take it with you"
  },
  {
    "id": ,
    "fa": "باید موتور رو جدا کنم ببینم مشکلش چیه",
    "en": "I need to take the engine apart to see what the problem is"
  },
  {
    "id": ,
    "fa": "من معمولاً تمرین می کنم تا ذهنم را از مشکلاتم برهانم",
    "en": "I usually work out to take my mind off my problems"
  },
  {
    "id": ,
    "fa": "او (مرد) به من گفت که برای من کاری پیدا خواهد کرد و من رو حرفش حساب کردم",
    "en": "He told me he would find me a job and I took his word for it"
  },
  {
    "id": ,
    "fa": "تمام روز طول کشید تا به خانه برگردم",
    "en": "It took me all day to drive back home"
  },
  {
    "id": ,
    "fa": "تقریبا 3 سال از ما وقت گرفته",
    "en": "It's taken us almost 3 years"
  },
  {
    "id": ,
    "fa": "من دوست دارم نظر شما را در مورد این موضوع بگیرم",
    "en": "I'd love to hear your take on this issue"
  },
  {
    "id": ,
    "fa": "آتش سوزی سال گذشته جان او را گرفت",
    "en": "Fire took her life last year"
  },
  {
    "id": ,
    "fa": "چرا هیچ یک از تماس های من را  جواب نمی دی (نمی گیری)؟",
    "en": "Why don't you take any of my call?"
  },
  {
    "id": ,
    "fa": "شروع کردم به گرفتن درس پیانو",
    "en": "I've started taking piano lessons"
  },
  {
    "id": ,
    "fa": "من هرگز در عمرم (تاکید) گلف بازی نکرده ام اما دوست دارم امتحانش کنم",
    "en": "I have never played golf ever in my life and I'd love to take a shot at it"
  },
  {
    "id": ,
    "fa": "آیا قبلاً 2 بار نپرسیده بودم که آیا این مانع از یکدیگر نمی شود؟",
    "en": "Hadn't I already asked 2 times if this doesn't get in each other's way?"
  },
  {
    "id": ,
    "fa": "چیزی برای ذکر نیست تا اینجا",
    "en": "Nothing to mention so far"
  },
  {
    "id": ,
    "fa": "پسرم گفت که با خدمات اجتماعی تماس می گیرد مگر اینکه کمک هزینه اش را افزایش دهم. آیا باید او را باور کنم؟",
    "en": "My son said he would call social services unless I raised his allowance. Should I believe him?"
  },
  {
    "id": ,
    "fa": "لطفا، در مهمانی امشب درست رفتار کن",
    "en": "Please, behave yourself at the party tonight"
  }
]

// grammer passive till Infinitive

Forgot to mention I won't be in office this week and on 16th as my daughter's kita is closed and we will take turn and manage her.
o be honest, you make me very (healthy) envious, I love having hands on that kind of stuff
How do I tell him it's not a viable career option and shut down the account while not being despised?


Dear Ali,
I am really really sorry but I have to cancel our match today, I just decided I’m not coming to the office because I am feeling sick and the pain it’s not going away despite the medicines.
I will then go on holiday but will re-schedule our meeting as soon as possible when I’m back.
Sorry again, hope you have a great day.
Valentina

No problem at all. Your health comes first. Rest up and feel better soon. We'll reschedule our meeting when both of us come back from our holiday.