[

  {
    "id":,
    "fa": "آیا خودت جاه طلبی کاندیداتوری برای ریاست جمهوری را داری؟",
    "en": "Do you have the ambition to run for the presidency yourself?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "آمریکا می گوید در حمله پهپادی به پایگاهی در شمال شرقی اردن سه تن از نیروهایش کشته و ده ها تن دیگر زخمی شده اند",
    "en": "The US says three of its troops have been killed and dozens more wounded in a drone attack on a base in northeastern Jordan",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "پلیس در جستجوی مرتکب کننده (عامل) جنایت است",
    "en": "The police are searching for the perpetrator of the crime",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "من از او نقل قول می کنم در مقاله تحقیقاتی خود برای حمایت از بحث خود",
    "en": "I quote him in my research paper to support my argument",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "من قادر نخواهم بود برسم به دفتر امروز",
    "en": "I will not be able to make it to the office today",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "من بسیار سوپرایز شدم که این اتهامات علیه من (فرضی) مطرح می شود، زیرا من کار خلافی نکرده بودم",
    "en": "I was very surprised that these charges would be brought against me because I hadn't done anything wrong",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "او (مرد) به تجاوز جنسی متهم شد",
    "en": "He charged with rape",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "خیلی خیالم راحت شد",
    "en": "I was very relieved",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "او (زن) مدام مرا نزدیک تر می کرد و بعد از چند دقیقه با دست مرا از میله بیرون برد",
    "en": "She kept pulling me closer and after several minutes she led me by the hand out of the bar",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "هر دوی ما مشروب خورده بودیم",
    "en": "We had both been drinking",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "پدرم الگوی من بود",
    "en": "My father was my role model",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "صبحتان بخیر عالیجنابان، بزرگواران, دوستان و همکارانتان",
    "en": "Good morning your highness, excellencies, friends and colleagues",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "من می خواهم تشکر کنم از شما برای فرصت اینجا بودن امروز",
    "en": "I would like to thank you for the opportunity to be here today",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "فداکاری بی وقفه او برای بهتر شدن در بازی منجر به پیشرفت قابل توجهی در مهارت های او شد",
    "en": "His relentless dedication to getting better at the game led to significant improvements in his skills",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "رفتم ماشینم را پارک کنم، اما متوجه شدم چرخ عقب سمت چپ روی جدول است",
    "en": "I went to park my car, but I noticed that the left rear wheel was on curbstone",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "آیا زمانی باقی مانده است؟",
    "en": "Is there any time left?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "آیا من سربار تو هستم؟",
    "en": "Am I a burden to you?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "به تو چه",
    "en": "What's it to you?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "آیا می توانید آن را زودتر از سال گذشته انجام دهید؟ (بسازید)",
    "en": "Can you make it earlier than last year?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "خفه شو هر چی من میگم همینه",
    "en": "Shut up it's what ever I say it is",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "باد شدید می توانست میز پیک نیک را واژگون (چپ) کند",
    "en": "The strong wind could overturn the picnic table",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "من یک دسته دستی قابل تنظیم خریدم",
    "en": "I bought a adjustable hand grip",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "کامپیوترت رو درست کردی (دادن به کسی)؟",
    "en": "Did you have your computer fixed?",
    "desc": "Passive Causative: We use a causative verb when we want to talk about something that someone else did for us or for another person. It means that the subject caused the action to happen, but didn't do it themselves. Get is more informal",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "هفته دیگه موهامو کوتاه خواهم کرد (دادن به کسی)",
    "en": "I'll get my hair cut next week",
    "desc": "Passive Causative: We use a causative verb when we want to talk about something that someone else did for us or for another person. It means that the subject caused the action to happen, but didn't do it themselves. Get is more informal",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "من دادم به برقکار چراغ شکسته ام را نگاه کند",
    "en": "I had the electrician look at my broken light",
    "desc": "Active Causative: We can also use the construction 'subject + have + person + infinitive'. This has a very similar meaning to 'have something done', which we've already talked about, but this time we say who did the thing. Get is more informal",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "مادرم را آرام کردی",
    "en": "1. Did you sedate my mother? 2.Did you calm my mother down?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "برو رو زمین الان",
    "en": "Get down on the ground now",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "دستان خود را از جیب خود دور نگه دارید",
    "en": "Keep your hands out of your pocket",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Why are you being asked to attest?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "شاید تو باید پسرت را طوری بزرگ می کردی که نیایند با آدم هایی مثل من معامله نکن",
    "en": "Maybe you should've raised your son not to go into business with guys like me",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "اونا اصلا قابل اعتماد به نظر نمی رسند",
    "en": "They don't look trustworthy at all",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "تو به نظر مارموز میرسی",
    "en": "You sound shadier",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "من در حال حاضر با کمبود کلمات مواجه هستم، اما از آنجایی که باید صحبت کنم نمی توانم این کار را بکنم",
    "en": "I'm currently running short on words, but I can't afford this since I have to speak",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "من همیشه صحبتم را با یک سلب مسئولیت شروع می کنم",
    "en": "I always start my talk with a disclaimer",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "من هرگز ادعا نکرده ام که یک سخنران انگیزشی هستم",
    "en": "I've never claimed to be a motivational speaker",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "من زندگی ام را وقف پیگیری بی وقفه (بی امان) دانش و خرد می کنم",
    "en": "I dedicate my life to the relentless pursuit of knowledge and wisdom",
    "groupCode": 0
  }
]

https://www.youtube.com/watch?v=RYhODLiB4Fw
//1:08