//because = چون
//because of = چون که
//due to = به دلیل

[
  {
    "id":,
    "fa": "",
    "en": "I have a needling feeling in my elbow",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "I have come out in rash",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "There's no such thing as a free (breakfast, dinner or lunch)",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Never better",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Confectionery",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "contemporary",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "ADHD چیست",
    "en": "Attention-deficit/hyperactivity disorder () is one of the most common mental disorders affecting children. Symptoms of ADHD include inattention (not being able to keep focus), hyperactivity (excess movement that is not fitting to the setting) and impulsivity (hasty acts that occur in the moment without thought)",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "slipping",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "tripping",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "spilling",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "electric shock",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "spraining",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "tumbling",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "You have reached the maximum number of payments while the device is unlock. Before you start you next payment you have to unlock you device again",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "\n 1.I dare not mention the incident to him; he'll go crazy \n 2.I don't dare mention the incident to him; he'll go crazy",
    "desc": "\"Daren't\" (I daren't mention the incident): This form is a contraction of \"dare not.\" It is more commonly used in British English and can be considered somewhat formal. It is often seen in written language and may sound a bit old-fashioned.\n\n\"Don't dare\" (I don't dare mention the incident): This is a more casual and widely used form in both British and American English. It is less formal and more commonly heard in spoken language",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "سوپریادگیران 4.2 برابر بیشتر احتمال دارد دوره خود را به پایان برسانند",
    "en": "Super learners are 4.2x more likely to finish their course",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "My current employer just offered me a better salary, a 40% increase, in case I don't resign. This only happened after I officially resigned to my boss. What would be my best decision?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "We are very happy to announce that Eva May has returned from her extended sick leave",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "We have missed her greatly and are very happy to welcome her back to our Knauf Digital team",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Eva will be taking on a new task within Commercial Software with Christine Kei, where her skills and experience will undoubtedly make a significant impact",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Please join us in welcoming her back and offering your support as she transitions into this new role",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "I'm just a few days away from launching my brand new course",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "How to disagree with your boss without getting sacked",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "No, this isn’t some magic pill or dodgy marketing sales pitch",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Ever dreamt of levelling up your advanced English skills in just an hour?",
    "groupCode": 0
  }
]







