[
  {
    "id": ,
    "fa": "من دانشجوی سال اول این دانشگاه هستم",
    "en": "I'm a freshman at this university"
  },
  {
    "id": ,
    "fa": "",
    "en": "I'm a sophomore at this high school"
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": "I also surf the net for news and sports"
  },
  {
    "id": ,
    "fa": "",
    "en": "I'll be finished in about five minutes"
  },
  {
    "id": ,
    "fa": "",
    "en": "She is my blind date"
  },
  {
    "id": ,
    "fa": "",
    "en": "I can see why you might be nervous"
  },
  {
    "id": ,
    "fa": "",
    "en": "He's running a little late. He'll be here shortly"
  },
  {
    "id": ,
    "fa": "",
    "en": "Why do you want to start selling ice cream"
  },
  {
    "id": ,
    "fa": "",
    "en": "I have spare time this summer"
  },
  {
    "id": ,
    "fa": "",
    "en": "I'm sure you're not the first student to drop her class"
  },
  {
    "id": ,
    "fa": "",
    "en": "I've never done this before"
  },
  {
    "id": ,
    "fa": "",
    "en": "I'm not doing well in it"
  },
  {
    "id": ,
    "fa": "",
    "en": "What's the big deal?"
  },
  {
    "id": ,
    "fa": "",
    "en": "Can I get you something to drink?"
  },
  {
    "id": ,
    "fa": "",
    "en": "Could you bring some on the side?"
  },
  {
    "id": ,
    "fa": "",
    "en": "If the shipment leaves today, it will arrive in three weeks"
  },
  {
    "id": ,
    "fa": "",
    "en": "How long would it take to ship a large box to Iran?"
  },
  {
    "id": ,
    "fa": "",
    "en": "How many people are in your family? There are four of us"
  },
  {
    "id": ,
    "fa": "",
    "en": "I'm the middle child"
  },
  {
    "id": ,
    "fa": "",
    "en": "Which year were you born?"
  },
  {
    "id": ,
    "fa": "",
    "en": "Do you get along with him?"
  },
  {
    "id": ,
    "fa": "",
    "en": "Who is it for?"
  },
  {
    "id": ,
    "fa": "",
    "en": "How come you never make me a birthday card?"
  },
  {
    "id": ,
    "fa": "",
    "en": "Why are immigrants needed in the U.S. when many Americans don't have jobs?"
  },
  {
    "id": ,
    "fa": "",
    "en": "I'm sober"
  },
  {
    "id": ,
    "fa": "",
    "en": "I drove her home"
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },
  {
    "id": ,
    "fa": "",
    "en": ""
  },

]

// grammer passive till Infinitive

Forgot to mention I won't be in office this week and on 16th as my daughter's kita is closed and we will take turn and manage her.
o be honest, you make me very (healthy) envious, I love having hands on that kind of stuff
How do I tell him it's not a viable career option and shut down the account while not being despised?


Dear Ali,
I am really really sorry but I have to cancel our match today, I just decided I’m not coming to the office because I am feeling sick and the pain it’s not going away despite the medicines.
I will then go on holiday but will re-schedule our meeting as soon as possible when I’m back.
Sorry again, hope you have a great day.
Valentina

No problem at all. Your health comes first. Rest up and feel better soon. We'll reschedule our meeting when both of us come back from our holiday.