[


  {
    "id":,
    "fa": "من می خواهم تشکر کنم از شما برای فرصت اینجا بودن امروز",
    "en": "I would like to thank you for the opportunity to be here today",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "فداکاری بی وقفه او برای بهتر شدن در بازی منجر به پیشرفت قابل توجهی در مهارت های او شد",
    "en": "His relentless dedication to getting better at the game led to significant improvements in his skills",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "رفتم ماشینم را پارک کنم، اما متوجه شدم چرخ عقب سمت چپ روی جدول است",
    "en": "I went to park my car, but I noticed that the left rear wheel was on curbstone",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "آیا می توانید آن را زودتر از سال گذشته انجام دهید؟ (بسازید)",
    "en": "Can you make it earlier than last year?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "چرا از شما دارن می خواهند که شهادت دهید؟",
    "en": "\n 1.Why are you being asked to attest? \n 2.Why are you being asked to testify?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "من هنوز بیمارم. دکتر مرخصی استعلاجی مرا 3 روز دیگر تمدید کردد",
    "en": "I'm still sick. The doctor extended my sick leave for another 3 days",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "او (مرد) تو را به خاطر متفاوت بودنش تحقیر کرد",
    "en": "He despised you for being different",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "ما باید برای حفظ محیط زیست خود برای نسل های آینده گامها را برداریم",
    "en": "We need to take steps to sustain our environment for future generations",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "شمشیر خود را بکش و مرد خود را نجات بده",
    "en": "Draw your sword and save your man",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "امیدوارم این ایمیل شما را در حال خوبی بیابد",
    "en": "I hope this email finds you well",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "آیا به طور خلاصه (مخلص کلام) وظایف خود را می دانید؟",
    "en": "Do you know your responsibilities in a nutshell?",
    "groupCode": 0
  }
]

https://www.youtube.com/watch?v=RYhODLiB4Fw
//1:08