[

  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "It will be good if can get the head ups from lena",
    "groupCode": 0
  },

  {
    "id":,
    "fa": "",
    "en": "Alan didn't know whether to go on or stop",
    "groupCode": 0
  }

  {
    "id":,
    "fa": "",
    "en": "Their presentation was a success, although they hadn't prepared it very well",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "They started early in the day so they managed to finish in time",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "When I last checked, everyone was at work",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Anna was sitting by herself in the garden",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Dinner will be ready presently, but we still have time for a drink",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "The sign outside the house that we wanted to buy said 'Sold'",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "I’m sure she wouldn't mind doing me a favour?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": " I woke up and couldn't get back to sleep again",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "We think one picture is very much like another",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "They certainly didn't expect everyone to turn up for the meeting!",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "She glance through the door and then walked on",
    "desc": "Glance: This usually implies a deliberate but brief look. You choose to glance at something, even if only for a moment.\nGlimpse: This suggests an unintentional or fleeting view. You might catch a glimpse of something out of the corner of your eye, or it might disappear before you get a good look.",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "I wish I had checked all the windows before leaving",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "David was in such pain that they had to take him to hospital",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "She reminds me of somebody I met years ago",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "I’ve decided to do it just for my sake",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "I think you should take advantage of such an opportunity!",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Total chaos broke out when the earthquake started. ",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Can you assure me it won’t need any more work? ",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "I ran out of petrol on my way home",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "\n 1.I dare not mention the incident to him; he'll go crazy \n 2.I don't dare mention the incident to him; he'll go crazy",
    "desc": "\"Daren't\" (I daren't mention the incident): This form is a contraction of \"dare not.\" It is more commonly used in British English and can be considered somewhat formal. It is often seen in written language and may sound a bit old-fashioned.\n\n\"Don't dare\" (I don't dare mention the incident): This is a more casual and widely used form in both British and American English. It is less formal and more commonly heard in spoken language",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "I caught a glimpse of the animal before it disappeared",
    "desc": "Glance: This usually implies a deliberate but brief look. You choose to glance at something, even if only for a moment.\nGlimpse: This suggests an unintentional or fleeting view. You might catch a glimpse of something out of the corner of your eye, or it might disappear before you get a good look.",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "crtisize",
    "en": "He's always running down the government, but never votes.",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "That door creaks when opened. Can you oil it?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "spring is finally here and it's time once again to swap your winter tires for grippy summer tires",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "The cash balance available for withdrawal may be reduced for up to eight weeks",
    "groupCode": 0
  }
  {
    "id":,
    "fa": "",
    "en": "She doesn't like horror films",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "He wasn't at the office last week",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "The available cash balance may be reduced for up to eight weeks to prevent overdrafts from potential direct debit returns",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "The direct debits can be revoked within the first eight weeks",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "It is not possible for us to process your request in a timely manner",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Please refrain from additional inquiries by phone",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "من حوصله ام سر رفت، بنابراین شروع کردم به پرتاب تصادفی کش مو در کامیون همکارانم",
    "en": "I got bored, so I started throwing random hair ties into my coworkers' trucks",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "سود تقسیمی سهم سودی است که بین سهامداران تقسیم می شود",
    "en": "The dividend is the share of profits distributed to shareholders",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "در طول سال, ما سمینارهای بیشتری پیشنهاد خواهیم داد",
    "en": "In the course of the year, we will offer further seminars",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "شما بیشتر از همیشه خوش آمدید برای آمدن به آفیس در هر زمانی و استفاده کنی از هر ورودی",
    "en": "You are all more than welcome to come to the office at any time and use any of the entrances",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "شما فقط داری 16 مسابقه باقی مانده",
    "en": "You only have 16 matches left",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "سوپریادگیران 4.2 برابر بیشتر احتمال دارد دوره خود را به پایان برسانند",
    "en": "Super learners are 4.2x more likely to finish their course",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Wrong place wrong time Raiden. No, I am exactly where I should be",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Why can't we dig deeper than 12.2 km into the Earth?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "معمولاً چه چیزی شما را از ارائه بازخورد به متقاضیان رد شده باز می دارد؟",
    "en": "What usually holds you back from providing feedback to rejected applicants?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "My current employer just offered me a better salary, a 40% increase, in case I don't resign. This only happened after I officially resigned to my boss. What would be my best decision?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "I won't be able to attend the retro meeting due to an internal parallel meeting",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "",
    "en": "Why do I have to settle for crumbs?",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "او (مرد) تو را به خاطر متفاوت بودنش تحقیر کرد",
    "en": "He despised you for being different",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "ما باید برای حفظ محیط زیست خود برای نسل های آینده گامها را برداریم",
    "en": "We need to take steps to sustain our environment for future generations",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "شمشیر خود را بکش و مرد خود را نجات بده",
    "en": "Draw your sword and save your man",
    "groupCode": 0
  },
  {
    "id":,
    "fa": "امیدوارم این ایمیل شما را در حال خوبی بیابد",
    "en": "I hope this email finds you well",
    "groupCode": 0
  }
]

https://www.youtube.com/watch?v=RYhODLiB4Fw
//1:08